MaJerle/stm32-usart-uart-dma-rx-tx/drivers/CMSIS/Device/ST/STM32C5xx/Include/stm32c593xx.h
/* ================================================================================================================== */
/* ================                              Peripheral declaration                              ================ */
/* ================================================================================================================== */


/** @addtogroup STM32C5xx_Peripheral_declaration
  * @{
  */

/*!< APB1 peripherals */
#define TIM2                ((TIM_TypeDef *) TIM2_BASE)
#define TIM3                ((TIM_TypeDef *) TIM3_BASE)
#define TIM4                ((TIM_TypeDef *) TIM4_BASE)
#define TIM5                ((TIM_TypeDef *) TIM5_BASE)
#define TIM6                ((TIM_TypeDef *) TIM6_BASE)
#define TIM7                ((TIM_TypeDef *) TIM7_BASE)
#define TIM12               ((TIM_TypeDef *) TIM12_BASE)
#define WWDG                ((WWDG_TypeDef *) WWDG_BASE)
#define IWDG                ((IWDG_TypeDef *) IWDG_BASE)
#define SPI2                ((SPI_TypeDef *) SPI2_BASE)
#define SPI3                ((SPI_TypeDef *) SPI3_BASE)
#define COMP1               ((COMP_TypeDef *) COMP1_BASE)
#define USART2              ((USART_TypeDef *) USART2_BASE)
#define USART3              ((USART_TypeDef *) USART3_BASE)
#define UART4               ((USART_TypeDef *) UART4_BASE)
#define UART5               ((USART_TypeDef *) UART5_BASE)
#define I2C1                ((I2C_TypeDef *) I2C1_BASE)
#define I2C2                ((I2C_TypeDef *) I2C2_BASE)
#define I3C1                ((I3C_TypeDef *) I3C1_BASE)
#define CRS                 ((CRS_TypeDef *) CRS_BASE)
#define USART6              ((USART_TypeDef *) USART6_BASE)
#define UART7               ((USART_TypeDef *) UART7_BASE)
#define FDCAN1              ((FDCAN_GlobalTypeDef *) FDCAN1_BASE)
#define FDCAN_CONFIG        ((FDCAN_Config_TypeDef *) FDCAN_CONFIG_BASE)
#define FDCAN2              ((FDCAN_GlobalTypeDef *) FDCAN2_BASE)

/*!< APB2 peripherals */
#define TIM1                ((TIM_TypeDef *) TIM1_BASE)
#define SPI1                ((SPI_TypeDef *) SPI1_BASE)
#define TIM8                ((TIM_TypeDef *) TIM8_BASE)
#define USART1              ((USART_TypeDef *) USART1_BASE)
#define TIM15               ((TIM_TypeDef *) TIM15_BASE)
#define TIM16               ((TIM_TypeDef *) TIM16_BASE)
#define TIM17               ((TIM_TypeDef *) TIM17_BASE)
#define USB_DRD_FS          ((USB_DRD_TypeDef *) USB_DRD_FS_BASE)
#define USB_DRD_PMA_BUFF    ((USB_DRD_PMABuffDescTypeDef *) USB_DRD_PMAADDR)

/*!< APB3 peripherals */
#define LPUART1             ((USART_TypeDef *) LPUART1_BASE)
#define LPTIM1              ((LPTIM_TypeDef *) LPTIM1_BASE)
#define RTC                 ((RTC_TypeDef *) RTC_BASE)
#define SBS                 ((SBS_TypeDef *) SBS_BASE)
#define TAMP                ((TAMP_TypeDef *) TAMP_BASE)

/*!< AHB1 peripherals */
#define LPDMA1              ((DMA_TypeDef *) LPDMA1_BASE)
#define LPDMA1_CH0          ((DMA_Channel_TypeDef *) LPDMA1_CH0_BASE)
#define LPDMA1_CH1          ((DMA_Channel_TypeDef *) LPDMA1_CH1_BASE)
#define LPDMA1_CH2          ((DMA_Channel_TypeDef *) LPDMA1_CH2_BASE)
#define LPDMA1_CH3          ((DMA_Channel_TypeDef *) LPDMA1_CH3_BASE)
#define LPDMA1_CH4          ((DMA_Channel_TypeDef *) LPDMA1_CH4_BASE)
#define LPDMA1_CH5          ((DMA_Channel_TypeDef *) LPDMA1_CH5_BASE)
#define LPDMA1_CH6          ((DMA_Channel_TypeDef *) LPDMA1_CH6_BASE)
#define LPDMA1_CH7          ((DMA_Channel_TypeDef *) LPDMA1_CH7_BASE)
#define LPDMA2              ((DMA_TypeDef *) LPDMA2_BASE)
#define LPDMA2_CH0          ((DMA_Channel_TypeDef *) LPDMA2_CH0_BASE)
#define LPDMA2_CH1          ((DMA_Channel_TypeDef *) LPDMA2_CH1_BASE)
#define LPDMA2_CH2          ((DMA_Channel_TypeDef *) LPDMA2_CH2_BASE)
#define LPDMA2_CH3          ((DMA_Channel_TypeDef *) LPDMA2_CH3_BASE)
#define LPDMA2_CH4          ((DMA_Channel_TypeDef *) LPDMA2_CH4_BASE)
#define LPDMA2_CH5          ((DMA_Channel_TypeDef *) LPDMA2_CH5_BASE)
#define LPDMA2_CH6          ((DMA_Channel_TypeDef *) LPDMA2_CH6_BASE)
#define LPDMA2_CH7          ((DMA_Channel_TypeDef *) LPDMA2_CH7_BASE)
#define FLASH               ((FLASH_TypeDef *) FLASH_R_BASE)
#define CRC                 ((CRC_TypeDef *) CRC_BASE)
#define CORDIC              ((CORDIC_TypeDef *) CORDIC_BASE)
#define RAMCFG_SRAM1        ((RAMCFG_TypeDef *) RAMCFG_SRAM1_BASE)
#define RAMCFG_SRAM2        ((RAMCFG_TypeDef *) RAMCFG_SRAM2_BASE)
#define ETH1                ((ETH_TypeDef *) ETH1_BASE)
#define ICACHE              ((ICACHE_TypeDef *) ICACHE_BASE)

/*!< AHB2 peripherals */
#define ADC1                ((ADC_TypeDef *) ADC1_BASE)
#define ADC2                ((ADC_TypeDef *) ADC2_BASE)
#define ADC12_COMMON        ((ADC_Common_TypeDef *) ADC12_COMMON_BASE)
#define ADC3                ((ADC_TypeDef *) ADC3_BASE)
#define ADC3_COMMON         ((ADC_Common_TypeDef *) ADC3_COMMON_BASE)
#define GPIOA               ((GPIO_TypeDef *) GPIOA_BASE)
#define GPIOB               ((GPIO_TypeDef *) GPIOB_BASE)
#define GPIOC               ((GPIO_TypeDef *) GPIOC_BASE)
#define GPIOD               ((GPIO_TypeDef *) GPIOD_BASE)
#define GPIOE               ((GPIO_TypeDef *) GPIOE_BASE)
#define GPIOF               ((GPIO_TypeDef *) GPIOF_BASE)
#define GPIOG               ((GPIO_TypeDef *) GPIOG_BASE)
#define GPIOH               ((GPIO_TypeDef *) GPIOH_BASE)
#define DAC1                ((DAC_TypeDef *) DAC1_BASE)
#define HASH                ((HASH_TypeDef *) HASH_BASE)
#define RNG                 ((RNG_TypeDef *) RNG_BASE)
#define PKA                 ((PKA_TypeDef *) PKA_BASE)

/*!< AHB3 peripherals */
#define DBGMCU              ((DBGMCU_TypeDef *) DBGMCU_BASE)
#define EXTI                ((EXTI_TypeDef *) EXTI_BASE)
#define PWR                 ((PWR_TypeDef *) PWR_BASE)
#define RCC                 ((RCC_TypeDef *) RCC_BASE)

/*!< AHB4 peripherals */
#define XSPI1               ((XSPI_TypeDef *) XSPI1_R_BASE)
#define DLYB_XSPI1          ((DLYB_TypeDef *) DLYB_XSPI1_BASE)

/** @addtogroup Hardware_Constant_Definition
  * @{
  */
#define LSI_STARTUP_TIME 260U /*!< LSI Maximum startup time in us */
/**
  * @}
  */

/**********************************************************************************************************************/
/*                                                                                                                    */
/*                                          Analog to Digital Converter (ADC)                                         */
/*                                                                                                                    */
/**********************************************************************************************************************/
#define ADC_INST_IN_COMMON_COUNT (2U) /*!< Number of ADC instances within ADC common instance
                                           Note: maximum number for all common instances (in case of multiple ADC
                                                 common instances, some may encompass less ADC instances). */
#define ADC_MULTIMODE_SUPPORT    (1U) /*!< ADC feature available only on specific devices: multimode available
                                        on devices with several ADC instances */

/* *************************************  Bit definition for ADC_ISR register  ************************************** */
#define ADC_ISR_ADRDY_Pos        (0U)
#define ADC_ISR_ADRDY_Msk        (0x1UL << ADC_ISR_ADRDY_Pos)          /*!< 0x00000001 */
#define ADC_ISR_ADRDY            ADC_ISR_ADRDY_Msk                     /*!< ADC ready */
#define ADC_ISR_EOSMP_Pos        (1U)
#define ADC_ISR_EOSMP_Msk        (0x1UL << ADC_ISR_EOSMP_Pos)          /*!< 0x00000002 */
#define ADC_ISR_EOSMP            ADC_ISR_EOSMP_Msk                     /*!< End of sampling flag */
#define ADC_ISR_EOC_Pos          (2U)
#define ADC_ISR_EOC_Msk          (0x1UL << ADC_ISR_EOC_Pos)            /*!< 0x00000004 */
#define ADC_ISR_EOC              ADC_ISR_EOC_Msk                       /*!< End of conversion flag */
#define ADC_ISR_EOS_Pos          (3U)
#define ADC_ISR_EOS_Msk          (0x1UL << ADC_ISR_EOS_Pos)            /*!< 0x00000008 */
#define ADC_ISR_EOS              ADC_ISR_EOS_Msk                       /*!< End of regular sequence flag */
#define ADC_ISR_OVR_Pos          (4U)
#define ADC_ISR_OVR_Msk          (0x1UL << ADC_ISR_OVR_Pos)            /*!< 0x00000010 */
#define ADC_ISR_OVR              ADC_ISR_OVR_Msk                       /*!< ADC overrun */
#define ADC_ISR_JEOC_Pos         (5U)
#define ADC_ISR_JEOC_Msk         (0x1UL << ADC_ISR_JEOC_Pos)           /*!< 0x00000020 */
#define ADC_ISR_JEOC             ADC_ISR_JEOC_Msk                      /*!< Injected channel end of conversion flag */
#define ADC_ISR_JEOS_Pos         (6U)
#define ADC_ISR_JEOS_Msk         (0x1UL << ADC_ISR_JEOS_Pos)           /*!< 0x00000040 */
#define ADC_ISR_JEOS             ADC_ISR_JEOS_Msk                      /*!< Injected channel end of sequence flag */
#define ADC_ISR_AWD1_Pos         (7U)
#define ADC_ISR_AWD1_Msk         (0x1UL << ADC_ISR_AWD1_Pos)           /*!< 0x00000080 */
#define ADC_ISR_AWD1             ADC_ISR_AWD1_Msk                      /*!< Analog watchdog 1 flag */
#define ADC_ISR_AWD2_Pos         (8U)
#define ADC_ISR_AWD2_Msk         (0x1UL << ADC_ISR_AWD2_Pos)           /*!< 0x00000100 */
#define ADC_ISR_AWD2             ADC_ISR_AWD2_Msk                      /*!< Analog watchdog 2 flag */
#define ADC_ISR_AWD3_Pos         (9U)
#define ADC_ISR_AWD3_Msk         (0x1UL << ADC_ISR_AWD3_Pos)           /*!< 0x00000200 */
#define ADC_ISR_AWD3             ADC_ISR_AWD3_Msk                      /*!< Analog watchdog 3 flag */
#define ADC_ISR_LDORDY_Pos       (12U)
#define ADC_ISR_LDORDY_Msk       (0x1UL << ADC_ISR_LDORDY_Pos)         /*!< 0x00001000 */
#define ADC_ISR_LDORDY           ADC_ISR_LDORDY_Msk                    /*!< ADC internal voltage regulator output ready
                                                                            flag */

/* *************************************  Bit definition for ADC_IER register  ************************************** */
#define ADC_IER_ADRDYIE_Pos      (0U)
#define ADC_IER_ADRDYIE_Msk      (0x1UL << ADC_IER_ADRDYIE_Pos)        /*!< 0x00000001 */
#define ADC_IER_ADRDYIE          ADC_IER_ADRDYIE_Msk                   /*!< ADC ready interrupt enable */
#define ADC_IER_EOSMPIE_Pos      (1U)
#define ADC_IER_EOSMPIE_Msk      (0x1UL << ADC_IER_EOSMPIE_Pos)        /*!< 0x00000002 */
#define ADC_IER_EOSMPIE          ADC_IER_EOSMPIE_Msk                   /*!< End of sampling flag interrupt enable for
                                                                            regular conversions */
#define ADC_IER_EOCIE_Pos        (2U)
#define ADC_IER_EOCIE_Msk        (0x1UL << ADC_IER_EOCIE_Pos)          /*!< 0x00000004 */
#define ADC_IER_EOCIE            ADC_IER_EOCIE_Msk                     /*!< End of regular conversion interrupt enable
                                                                            */
#define ADC_IER_EOSIE_Pos        (3U)
#define ADC_IER_EOSIE_Msk        (0x1UL << ADC_IER_EOSIE_Pos)          /*!< 0x00000008 */
#define ADC_IER_EOSIE            ADC_IER_EOSIE_Msk                     /*!< End of regular sequence of conversions
                                                                            interrupt enable */
#define ADC_IER_OVRIE_Pos        (4U)
#define ADC_IER_OVRIE_Msk        (0x1UL << ADC_IER_OVRIE_Pos)          /*!< 0x00000010 */
#define ADC_IER_OVRIE            ADC_IER_OVRIE_Msk                     /*!< Overrun interrupt enable */
#define ADC_IER_JEOCIE_Pos       (5U)
#define ADC_IER_JEOCIE_Msk       (0x1UL << ADC_IER_JEOCIE_Pos)         /*!< 0x00000020 */
#define ADC_IER_JEOCIE           ADC_IER_JEOCIE_Msk                    /*!< End of injected conversion interrupt enable
                                                                            */
#define ADC_IER_JEOSIE_Pos       (6U)
#define ADC_IER_JEOSIE_Msk       (0x1UL << ADC_IER_JEOSIE_Pos)         /*!< 0x00000040 */
#define ADC_IER_JEOSIE           ADC_IER_JEOSIE_Msk                    /*!< End of injected sequence of conversions
                                                                            interrupt enable */
#define ADC_IER_AWD1IE_Pos       (7U)
#define ADC_IER_AWD1IE_Msk       (0x1UL << ADC_IER_AWD1IE_Pos)         /*!< 0x00000080 */
#define ADC_IER_AWD1IE           ADC_IER_AWD1IE_Msk                    /*!< Analog watchdog 1 interrupt enable */
#define ADC_IER_AWD2IE_Pos       (8U)
#define ADC_IER_AWD2IE_Msk       (0x1UL << ADC_IER_AWD2IE_Pos)         /*!< 0x00000100 */
#define ADC_IER_AWD2IE           ADC_IER_AWD2IE_Msk                    /*!< Analog watchdog 2 interrupt enable */
#define ADC_IER_AWD3IE_Pos       (9U)
#define ADC_IER_AWD3IE_Msk       (0x1UL << ADC_IER_AWD3IE_Pos)         /*!< 0x00000200 */
#define ADC_IER_AWD3IE           ADC_IER_AWD3IE_Msk                    /*!< Analog watchdog 3 interrupt enable */
#define ADC_IER_LDORDYIE_Pos     (12U)
#define ADC_IER_LDORDYIE_Msk     (0x1UL << ADC_IER_LDORDYIE_Pos)       /*!< 0x00001000 */
#define ADC_IER_LDORDYIE         ADC_IER_LDORDYIE_Msk                  /*!< ADC internal voltage regulator interrupt
                                                                            enable */

/* **************************************  Bit definition for ADC_CR register  ************************************** */
#define ADC_CR_ADEN_Pos          (0U)
#define ADC_CR_ADEN_Msk          (0x1UL << ADC_CR_ADEN_Pos)            /*!< 0x00000001 */
#define ADC_CR_ADEN              ADC_CR_ADEN_Msk                       /*!< ADC enable control */
#define ADC_CR_ADDIS_Pos         (1U)
#define ADC_CR_ADDIS_Msk         (0x1UL << ADC_CR_ADDIS_Pos)           /*!< 0x00000002 */
#define ADC_CR_ADDIS             ADC_CR_ADDIS_Msk                      /*!< ADC disable command */
#define ADC_CR_ADSTART_Pos       (2U)
#define ADC_CR_ADSTART_Msk       (0x1UL << ADC_CR_ADSTART_Pos)         /*!< 0x00000004 */
#define ADC_CR_ADSTART           ADC_CR_ADSTART_Msk                    /*!< ADC start of regular conversion */
#define ADC_CR_JADSTART_Pos      (3U)
#define ADC_CR_JADSTART_Msk      (0x1UL << ADC_CR_JADSTART_Pos)        /*!< 0x00000008 */
#define ADC_CR_JADSTART          ADC_CR_JADSTART_Msk                   /*!< ADC start of injected conversion */
#define ADC_CR_ADSTP_Pos         (4U)
#define ADC_CR_ADSTP_Msk         (0x1UL << ADC_CR_ADSTP_Pos)           /*!< 0x00000010 */
#define ADC_CR_ADSTP             ADC_CR_ADSTP_Msk                      /*!< ADC stop of regular conversion command */
#define ADC_CR_JADSTP_Pos        (5U)
#define ADC_CR_JADSTP_Msk        (0x1UL << ADC_CR_JADSTP_Pos)          /*!< 0x00000020 */
#define ADC_CR_JADSTP            ADC_CR_JADSTP_Msk                     /*!< ADC stop of injected conversion command */
#define ADC_CR_ADVREGEN_Pos      (28U)
#define ADC_CR_ADVREGEN_Msk      (0x1UL << ADC_CR_ADVREGEN_Pos)        /*!< 0x10000000 */
#define ADC_CR_ADVREGEN          ADC_CR_ADVREGEN_Msk                   /*!< ADC internal voltage regulator enable */
#define ADC_CR_DEEPPWD_Pos       (29U)
#define ADC_CR_DEEPPWD_Msk       (0x1UL << ADC_CR_DEEPPWD_Pos)         /*!< 0x20000000 */
#define ADC_CR_DEEPPWD           ADC_CR_DEEPPWD_Msk                    /*!< Deep-power-down enable */
#define ADC_CR_ADCAL_Pos         (31U)
#define ADC_CR_ADCAL_Msk         (0x1UL << ADC_CR_ADCAL_Pos)           /*!< 0x80000000 */
#define ADC_CR_ADCAL             ADC_CR_ADCAL_Msk                      /*!< ADC calibration */

/* ************************************  Bit definition for ADC_CFGR1 register  ************************************* */
#define ADC_CFGR1_DMNGT_Pos      (0U)
#define ADC_CFGR1_DMNGT_Msk      (0x3UL << ADC_CFGR1_DMNGT_Pos)        /*!< 0x00000003 */
#define ADC_CFGR1_DMNGT          ADC_CFGR1_DMNGT_Msk                   /*!< Data management configuration */
#define ADC_CFGR1_DMNGT_0        (0x1UL << ADC_CFGR1_DMNGT_Pos)        /*!< 0x00000001 */
#define ADC_CFGR1_DMNGT_1        (0x2UL << ADC_CFGR1_DMNGT_Pos)        /*!< 0x00000002 */
#define ADC_CFGR1_RES_Pos        (2U)
#define ADC_CFGR1_RES_Msk        (0x3UL << ADC_CFGR1_RES_Pos)          /*!< 0x0000000C */
#define ADC_CFGR1_RES            ADC_CFGR1_RES_Msk                     /*!< Data resolution */
#define ADC_CFGR1_RES_0          (0x1UL << ADC_CFGR1_RES_Pos)          /*!< 0x00000004 */
#define ADC_CFGR1_RES_1          (0x2UL << ADC_CFGR1_RES_Pos)          /*!< 0x00000008 */
#define ADC_CFGR1_EXTSEL_Pos     (5U)
#define ADC_CFGR1_EXTSEL_Msk     (0x1FUL << ADC_CFGR1_EXTSEL_Pos)      /*!< 0x000003E0 */
#define ADC_CFGR1_EXTSEL         ADC_CFGR1_EXTSEL_Msk                  /*!< External trigger selection for regular group
                                                                            */
#define ADC_CFGR1_EXTSEL_0       (0x1UL << ADC_CFGR1_EXTSEL_Pos)       /*!< 0x00000020 */
#define ADC_CFGR1_EXTSEL_1       (0x2UL << ADC_CFGR1_EXTSEL_Pos)       /*!< 0x00000040 */
#define ADC_CFGR1_EXTSEL_2       (0x4UL << ADC_CFGR1_EXTSEL_Pos)       /*!< 0x00000080 */
#define ADC_CFGR1_EXTSEL_3       (0x8UL << ADC_CFGR1_EXTSEL_Pos)       /*!< 0x00000100 */
#define ADC_CFGR1_EXTSEL_4       (0x10UL << ADC_CFGR1_EXTSEL_Pos)      /*!< 0x00000200 */
#define ADC_CFGR1_EXTEN_Pos      (10U)
#define ADC_CFGR1_EXTEN_Msk      (0x3UL << ADC_CFGR1_EXTEN_Pos)        /*!< 0x00000C00 */
#define ADC_CFGR1_EXTEN          ADC_CFGR1_EXTEN_Msk                   /*!< External trigger enable and polarity
                                                                            selection for regular channels */
#define ADC_CFGR1_EXTEN_0        (0x1UL << ADC_CFGR1_EXTEN_Pos)        /*!< 0x00000400 */
#define ADC_CFGR1_EXTEN_1        (0x2UL << ADC_CFGR1_EXTEN_Pos)        /*!< 0x00000800 */
#define ADC_CFGR1_OVRMOD_Pos     (12U)
#define ADC_CFGR1_OVRMOD_Msk     (0x1UL << ADC_CFGR1_OVRMOD_Pos)       /*!< 0x00001000 */
#define ADC_CFGR1_OVRMOD         ADC_CFGR1_OVRMOD_Msk                  /*!< Overrun mode */
#define ADC_CFGR1_CONT_Pos       (13U)
#define ADC_CFGR1_CONT_Msk       (0x1UL << ADC_CFGR1_CONT_Pos)         /*!< 0x00002000 */
#define ADC_CFGR1_CONT           ADC_CFGR1_CONT_Msk                    /*!< Single / continuous conversion mode for
                                                                            regular conversions */
#define ADC_CFGR1_AUTDLY_Pos     (14U)
#define ADC_CFGR1_AUTDLY_Msk     (0x1UL << ADC_CFGR1_AUTDLY_Pos)       /*!< 0x00004000 */
#define ADC_CFGR1_AUTDLY         ADC_CFGR1_AUTDLY_Msk                  /*!< Delayed conversion mode */
#define ADC_CFGR1_DISCEN_Pos     (16U)
#define ADC_CFGR1_DISCEN_Msk     (0x1UL << ADC_CFGR1_DISCEN_Pos)       /*!< 0x00010000 */
#define ADC_CFGR1_DISCEN         ADC_CFGR1_DISCEN_Msk                  /*!< Discontinuous mode for regular channels */
#define ADC_CFGR1_DISCNUM_Pos    (17U)
#define ADC_CFGR1_DISCNUM_Msk    (0x7UL << ADC_CFGR1_DISCNUM_Pos)      /*!< 0x000E0000 */
#define ADC_CFGR1_DISCNUM        ADC_CFGR1_DISCNUM_Msk                 /*!< Discontinuous mode channel count */
#define ADC_CFGR1_DISCNUM_0      (0x1UL << ADC_CFGR1_DISCNUM_Pos)      /*!< 0x00020000 */
#define ADC_CFGR1_DISCNUM_1      (0x2UL << ADC_CFGR1_DISCNUM_Pos)      /*!< 0x00040000 */
#define ADC_CFGR1_DISCNUM_2      (0x4UL << ADC_CFGR1_DISCNUM_Pos)      /*!< 0x00080000 */
#define ADC_CFGR1_JDISCEN_Pos    (20U)
#define ADC_CFGR1_JDISCEN_Msk    (0x1UL << ADC_CFGR1_JDISCEN_Pos)      /*!< 0x00100000 */
#define ADC_CFGR1_JDISCEN        ADC_CFGR1_JDISCEN_Msk                 /*!< Discontinuous mode on injected channels */
#define ADC_CFGR1_AWD1SGL_Pos    (22U)
#define ADC_CFGR1_AWD1SGL_Msk    (0x1UL << ADC_CFGR1_AWD1SGL_Pos)      /*!< 0x00400000 */
#define ADC_CFGR1_AWD1SGL        ADC_CFGR1_AWD1SGL_Msk                 /*!< Enable the watchdog 1 on a single channel or
                                                                            on all channels */
#define ADC_CFGR1_AWD1EN_Pos     (23U)
#define ADC_CFGR1_AWD1EN_Msk     (0x1UL << ADC_CFGR1_AWD1EN_Pos)       /*!< 0x00800000 */
#define ADC_CFGR1_AWD1EN         ADC_CFGR1_AWD1EN_Msk                  /*!< Analog watchdog 1 enable on regular channels
                                                                            */
#define ADC_CFGR1_JAWD1EN_Pos    (24U)
#define ADC_CFGR1_JAWD1EN_Msk    (0x1UL << ADC_CFGR1_JAWD1EN_Pos)      /*!< 0x01000000 */
#define ADC_CFGR1_JAWD1EN        ADC_CFGR1_JAWD1EN_Msk                 /*!< Analog watchdog 1 enable on injected
                                                                            channels */
#define ADC_CFGR1_JAUTO_Pos      (25U)
#define ADC_CFGR1_JAUTO_Msk      (0x1UL << ADC_CFGR1_JAUTO_Pos)        /*!< 0x02000000 */
#define ADC_CFGR1_JAUTO          ADC_CFGR1_JAUTO_Msk                   /*!< Automatic injected group conversion */
#define ADC_CFGR1_AWD1CH_Pos     (26U)
#define ADC_CFGR1_AWD1CH_Msk     (0x1FUL << ADC_CFGR1_AWD1CH_Pos)      /*!< 0x7C000000 */
#define ADC_CFGR1_AWD1CH         ADC_CFGR1_AWD1CH_Msk                  /*!< Analog watchdog 1 channel selection */
#define ADC_CFGR1_AWD1CH_0       (0x1UL << ADC_CFGR1_AWD1CH_Pos)       /*!< 0x04000000 */
#define ADC_CFGR1_AWD1CH_1       (0x2UL << ADC_CFGR1_AWD1CH_Pos)       /*!< 0x08000000 */
#define ADC_CFGR1_AWD1CH_2       (0x4UL << ADC_CFGR1_AWD1CH_Pos)       /*!< 0x10000000 */
#define ADC_CFGR1_AWD1CH_3       (0x8UL << ADC_CFGR1_AWD1CH_Pos)       /*!< 0x20000000 */
#define ADC_CFGR1_AWD1CH_4       (0x10UL << ADC_CFGR1_AWD1CH_Pos)      /*!< 0x40000000 */

