MaJerle/stm32-usart-uart-dma-rx-tx/drivers/CMSIS/Device/ST/STM32C5xx/Include/stm32c593xx.h
/* ************************************  Bit definition for ETH_MACCR register  ************************************* */
#define ETH_MACCR_RE_Pos               (0U)
#define ETH_MACCR_RE_Msk               (0x1UL << ETH_MACCR_RE_Pos)                 /*!< 0x00000001 */
#define ETH_MACCR_RE                   ETH_MACCR_RE_Msk                            /*!< Receiver Enable */
#define ETH_MACCR_TE_Pos               (1U)
#define ETH_MACCR_TE_Msk               (0x1UL << ETH_MACCR_TE_Pos)                 /*!< 0x00000002 */
#define ETH_MACCR_TE                   ETH_MACCR_TE_Msk                            /*!< Transmitter Enable */
#define ETH_MACCR_PRELEN_Pos           (2U)
#define ETH_MACCR_PRELEN_Msk           (0x3UL << ETH_MACCR_PRELEN_Pos)             /*!< 0x0000000C */
#define ETH_MACCR_PRELEN               ETH_MACCR_PRELEN_Msk                        /*!< Preamble Length for Transmit
                                                                                        packets */
#define ETH_MACCR_DC_Pos               (4U)
#define ETH_MACCR_DC_Msk               (0x1UL << ETH_MACCR_DC_Pos)                 /*!< 0x00000010 */
#define ETH_MACCR_DC                   ETH_MACCR_DC_Msk                            /*!< Deferral Check */
#define ETH_MACCR_BL_Pos               (5U)
#define ETH_MACCR_BL_Msk               (0x3UL << ETH_MACCR_BL_Pos)                 /*!< 0x00000060 */
#define ETH_MACCR_BL                   ETH_MACCR_BL_Msk                            /*!< Back-Off Limit */
#define ETH_MACCR_DR_Pos               (8U)
#define ETH_MACCR_DR_Msk               (0x1UL << ETH_MACCR_DR_Pos)                 /*!< 0x00000100 */
#define ETH_MACCR_DR                   ETH_MACCR_DR_Msk                            /*!< Disable Retry */
#define ETH_MACCR_DCRS_Pos             (9U)
#define ETH_MACCR_DCRS_Msk             (0x1UL << ETH_MACCR_DCRS_Pos)               /*!< 0x00000200 */
#define ETH_MACCR_DCRS                 ETH_MACCR_DCRS_Msk                          /*!< Disable Carrier Sense During
                                                                                        Transmission */
#define ETH_MACCR_DO_Pos               (10U)
#define ETH_MACCR_DO_Msk               (0x1UL << ETH_MACCR_DO_Pos)                 /*!< 0x00000400 */
#define ETH_MACCR_DO                   ETH_MACCR_DO_Msk                            /*!< Disable Receive Own */
#define ETH_MACCR_ECRSFD_Pos           (11U)
#define ETH_MACCR_ECRSFD_Msk           (0x1UL << ETH_MACCR_ECRSFD_Pos)             /*!< 0x00000800 */
#define ETH_MACCR_ECRSFD               ETH_MACCR_ECRSFD_Msk                        /*!< Enable Carrier Sense Before
                                                                                        Transmission in Full-duplex mode
                                                                                        */
#define ETH_MACCR_LM_Pos               (12U)
#define ETH_MACCR_LM_Msk               (0x1UL << ETH_MACCR_LM_Pos)                 /*!< 0x00001000 */
#define ETH_MACCR_LM                   ETH_MACCR_LM_Msk                            /*!< Loopback Mode */
#define ETH_MACCR_DM_Pos               (13U)
#define ETH_MACCR_DM_Msk               (0x1UL << ETH_MACCR_DM_Pos)                 /*!< 0x00002000 */
#define ETH_MACCR_DM                   ETH_MACCR_DM_Msk                            /*!< Duplex Mode */
#define ETH_MACCR_FES_Pos              (14U)
#define ETH_MACCR_FES_Msk              (0x1UL << ETH_MACCR_FES_Pos)                /*!< 0x00004000 */
#define ETH_MACCR_FES                  ETH_MACCR_FES_Msk                           /*!< MAC Speed */
#define ETH_MACCR_JE_Pos               (16U)
#define ETH_MACCR_JE_Msk               (0x1UL << ETH_MACCR_JE_Pos)                 /*!< 0x00010000 */
#define ETH_MACCR_JE                   ETH_MACCR_JE_Msk                            /*!< Jumbo Packet Enable */
#define ETH_MACCR_JD_Pos               (17U)
#define ETH_MACCR_JD_Msk               (0x1UL << ETH_MACCR_JD_Pos)                 /*!< 0x00020000 */
#define ETH_MACCR_JD                   ETH_MACCR_JD_Msk                            /*!< Jabber Disable */
#define ETH_MACCR_WD_Pos               (19U)
#define ETH_MACCR_WD_Msk               (0x1UL << ETH_MACCR_WD_Pos)                 /*!< 0x00080000 */
#define ETH_MACCR_WD                   ETH_MACCR_WD_Msk                            /*!< Watchdog Disable */
#define ETH_MACCR_ACS_Pos              (20U)
#define ETH_MACCR_ACS_Msk              (0x1UL << ETH_MACCR_ACS_Pos)                /*!< 0x00100000 */
#define ETH_MACCR_ACS                  ETH_MACCR_ACS_Msk                           /*!< Automatic Pad or CRC Stripping
                                                                                        */
#define ETH_MACCR_CST_Pos              (21U)
#define ETH_MACCR_CST_Msk              (0x1UL << ETH_MACCR_CST_Pos)                /*!< 0x00200000 */
#define ETH_MACCR_CST                  ETH_MACCR_CST_Msk                           /*!< CRC stripping for Type packets
                                                                                        */
#define ETH_MACCR_S2KP_Pos             (22U)
#define ETH_MACCR_S2KP_Msk             (0x1UL << ETH_MACCR_S2KP_Pos)               /*!< 0x00400000 */
#define ETH_MACCR_S2KP                 ETH_MACCR_S2KP_Msk                          /*!< IEEE 802.3as Support for 2K
                                                                                        Packets */
#define ETH_MACCR_GPSLCE_Pos           (23U)
#define ETH_MACCR_GPSLCE_Msk           (0x1UL << ETH_MACCR_GPSLCE_Pos)             /*!< 0x00800000 */
#define ETH_MACCR_GPSLCE               ETH_MACCR_GPSLCE_Msk                        /*!< Giant Packet Size Limit Control
                                                                                        Enable */
#define ETH_MACCR_IPG_Pos              (24U)
#define ETH_MACCR_IPG_Msk              (0x7UL << ETH_MACCR_IPG_Pos)                /*!< 0x07000000 */
#define ETH_MACCR_IPG                  ETH_MACCR_IPG_Msk                           /*!< Inter-Packet Gap */
#define ETH_MACCR_IPC_Pos              (27U)
#define ETH_MACCR_IPC_Msk              (0x1UL << ETH_MACCR_IPC_Pos)                /*!< 0x08000000 */
#define ETH_MACCR_IPC                  ETH_MACCR_IPC_Msk                           /*!< Checksum Offload */
#define ETH_MACCR_SARC_Pos             (28U)
#define ETH_MACCR_SARC_Msk             (0x7UL << ETH_MACCR_SARC_Pos)               /*!< 0x70000000 */
#define ETH_MACCR_SARC                 ETH_MACCR_SARC_Msk                          /*!< Source Address Insertion or
                                                                                        Replacement Control */
#define ETH_MACCR_ARPEN_Pos            (31U)
#define ETH_MACCR_ARPEN_Msk            (0x1UL << ETH_MACCR_ARPEN_Pos)              /*!< 0x80000000 */
#define ETH_MACCR_ARPEN                ETH_MACCR_ARPEN_Msk                         /*!< ARP Offload Enable */

