MaJerle/stm32-usart-uart-dma-rx-tx/drivers/CMSIS/Device/ST/STM32C5xx/Include/stm32c593xx.h
/* ************************************  Bit definition for ETH_MACECR register  ************************************ */
#define ETH_MACECR_GPSL_Pos            (0U)
#define ETH_MACECR_GPSL_Msk            (0x3FFFUL << ETH_MACECR_GPSL_Pos)           /*!< 0x00003FFF */
#define ETH_MACECR_GPSL                ETH_MACECR_GPSL_Msk                         /*!< Giant Packet Size Limit */
#define ETH_MACECR_DCRCC_Pos           (16U)
#define ETH_MACECR_DCRCC_Msk           (0x1UL << ETH_MACECR_DCRCC_Pos)             /*!< 0x00010000 */
#define ETH_MACECR_DCRCC               ETH_MACECR_DCRCC_Msk                        /*!< Disable CRC Checking for
                                                                                        Received Packets */
#define ETH_MACECR_SPEN_Pos            (17U)
#define ETH_MACECR_SPEN_Msk            (0x1UL << ETH_MACECR_SPEN_Pos)              /*!< 0x00020000 */
#define ETH_MACECR_SPEN                ETH_MACECR_SPEN_Msk                         /*!< Slow Protocol Detection Enable
                                                                                        */
#define ETH_MACECR_USP_Pos             (18U)
#define ETH_MACECR_USP_Msk             (0x1UL << ETH_MACECR_USP_Pos)               /*!< 0x00040000 */
#define ETH_MACECR_USP                 ETH_MACECR_USP_Msk                          /*!< Unicast Slow Protocol Packet
                                                                                        Detect */
#define ETH_MACECR_EIPGEN_Pos          (24U)
#define ETH_MACECR_EIPGEN_Msk          (0x1UL << ETH_MACECR_EIPGEN_Pos)            /*!< 0x01000000 */
#define ETH_MACECR_EIPGEN              ETH_MACECR_EIPGEN_Msk                       /*!< Extended Inter-Packet Gap Enable
                                                                                        */
#define ETH_MACECR_EIPG_Pos            (25U)
#define ETH_MACECR_EIPG_Msk            (0x1FUL << ETH_MACECR_EIPG_Pos)             /*!< 0x3E000000 */
#define ETH_MACECR_EIPG                ETH_MACECR_EIPG_Msk                         /*!< Extended Inter-Packet Gap */
#define ETH_MACECR_APDIM_Pos           (30U)
#define ETH_MACECR_APDIM_Msk           (0x1UL << ETH_MACECR_APDIM_Pos)             /*!< 0x40000000 */
#define ETH_MACECR_APDIM               ETH_MACECR_APDIM_Msk                        /*!< ARP Packet Drop if IP Address
                                                                                        Mismatch */

/* ************************************  Bit definition for ETH_MACPFR register  ************************************ */
#define ETH_MACPFR_PR_Pos              (0U)
#define ETH_MACPFR_PR_Msk              (0x1UL << ETH_MACPFR_PR_Pos)                /*!< 0x00000001 */
#define ETH_MACPFR_PR                  ETH_MACPFR_PR_Msk                           /*!< Promiscuous Mode */
#define ETH_MACPFR_HUC_Pos             (1U)
#define ETH_MACPFR_HUC_Msk             (0x1UL << ETH_MACPFR_HUC_Pos)               /*!< 0x00000002 */
#define ETH_MACPFR_HUC                 ETH_MACPFR_HUC_Msk                          /*!< Hash Unicast */
#define ETH_MACPFR_HMC_Pos             (2U)
#define ETH_MACPFR_HMC_Msk             (0x1UL << ETH_MACPFR_HMC_Pos)               /*!< 0x00000004 */
#define ETH_MACPFR_HMC                 ETH_MACPFR_HMC_Msk                          /*!< Hash Multicast */
#define ETH_MACPFR_DAIF_Pos            (3U)
#define ETH_MACPFR_DAIF_Msk            (0x1UL << ETH_MACPFR_DAIF_Pos)              /*!< 0x00000008 */
#define ETH_MACPFR_DAIF                ETH_MACPFR_DAIF_Msk                         /*!< DA Inverse Filtering */
#define ETH_MACPFR_PM_Pos              (4U)
#define ETH_MACPFR_PM_Msk              (0x1UL << ETH_MACPFR_PM_Pos)                /*!< 0x00000010 */
#define ETH_MACPFR_PM                  ETH_MACPFR_PM_Msk                           /*!< Pass All Multicast */
#define ETH_MACPFR_DBF_Pos             (5U)
#define ETH_MACPFR_DBF_Msk             (0x1UL << ETH_MACPFR_DBF_Pos)               /*!< 0x00000020 */
#define ETH_MACPFR_DBF                 ETH_MACPFR_DBF_Msk                          /*!< Disable Broadcast Packets */
#define ETH_MACPFR_PCF_Pos             (6U)
#define ETH_MACPFR_PCF_Msk             (0x3UL << ETH_MACPFR_PCF_Pos)               /*!< 0x000000C0 */
#define ETH_MACPFR_PCF                 ETH_MACPFR_PCF_Msk                          /*!< Pass Control Packets */
#define ETH_MACPFR_SAIF_Pos            (8U)
#define ETH_MACPFR_SAIF_Msk            (0x1UL << ETH_MACPFR_SAIF_Pos)              /*!< 0x00000100 */
#define ETH_MACPFR_SAIF                ETH_MACPFR_SAIF_Msk                         /*!< SA Inverse Filtering */
#define ETH_MACPFR_SAF_Pos             (9U)
#define ETH_MACPFR_SAF_Msk             (0x1UL << ETH_MACPFR_SAF_Pos)               /*!< 0x00000200 */
#define ETH_MACPFR_SAF                 ETH_MACPFR_SAF_Msk                          /*!< Source Address Filter Enable */
#define ETH_MACPFR_HPF_Pos             (10U)
#define ETH_MACPFR_HPF_Msk             (0x1UL << ETH_MACPFR_HPF_Pos)               /*!< 0x00000400 */
#define ETH_MACPFR_HPF                 ETH_MACPFR_HPF_Msk                          /*!< Hash or Perfect Filter */
#define ETH_MACPFR_VTFE_Pos            (16U)
#define ETH_MACPFR_VTFE_Msk            (0x1UL << ETH_MACPFR_VTFE_Pos)              /*!< 0x00010000 */
#define ETH_MACPFR_VTFE                ETH_MACPFR_VTFE_Msk                         /*!< VLAN Tag Filter Enable */
#define ETH_MACPFR_IPFE_Pos            (20U)
#define ETH_MACPFR_IPFE_Msk            (0x1UL << ETH_MACPFR_IPFE_Pos)              /*!< 0x00100000 */
#define ETH_MACPFR_IPFE                ETH_MACPFR_IPFE_Msk                         /*!< Layer 3 and Layer 4 Filter
                                                                                        Enable */
#define ETH_MACPFR_DNTU_Pos            (21U)
#define ETH_MACPFR_DNTU_Msk            (0x1UL << ETH_MACPFR_DNTU_Pos)              /*!< 0x00200000 */
#define ETH_MACPFR_DNTU                ETH_MACPFR_DNTU_Msk                         /*!< Drop Non-TCP/UDP over IP Packets
                                                                                        */
#define ETH_MACPFR_RA_Pos              (31U)
#define ETH_MACPFR_RA_Msk              (0x1UL << ETH_MACPFR_RA_Pos)                /*!< 0x80000000 */
#define ETH_MACPFR_RA                  ETH_MACPFR_RA_Msk                           /*!< Receive All */

/* ***********************************  Bit definition for ETH_MACWJBTR register  *********************************** */
#define ETH_MACWJBTR_WTO_Pos           (0U)
#define ETH_MACWJBTR_WTO_Msk           (0xFUL << ETH_MACWJBTR_WTO_Pos)             /*!< 0x0000000F */
#define ETH_MACWJBTR_WTO               ETH_MACWJBTR_WTO_Msk                        /*!< Watchdog Timeout */
#define ETH_MACWJBTR_PWE_Pos           (8U)
#define ETH_MACWJBTR_PWE_Msk           (0x1UL << ETH_MACWJBTR_PWE_Pos)             /*!< 0x00000100 */
#define ETH_MACWJBTR_PWE               ETH_MACWJBTR_PWE_Msk                        /*!< Programmable Watchdog Enable */
#define ETH_MACWJBTR_JTO_Pos           (16U)
#define ETH_MACWJBTR_JTO_Msk           (0xFUL << ETH_MACWJBTR_JTO_Pos)             /*!< 0x000F0000 */
#define ETH_MACWJBTR_JTO               ETH_MACWJBTR_JTO_Msk                        /*!< Jabber Timeout */
#define ETH_MACWJBTR_PJE_Pos           (24U)
#define ETH_MACWJBTR_PJE_Msk           (0x1UL << ETH_MACWJBTR_PJE_Pos)             /*!< 0x01000000 */
#define ETH_MACWJBTR_PJE               ETH_MACWJBTR_PJE_Msk                        /*!< Programmable Jabber Enable */

/* ***********************************  Bit definition for ETH_MACHT0R register  ************************************ */
#define ETH_MACHT0R_HT31T0_Pos         (0U)
#define ETH_MACHT0R_HT31T0_Msk         (0xFFFFFFFFUL << ETH_MACHT0R_HT31T0_Pos)    /*!< 0xFFFFFFFF */
#define ETH_MACHT0R_HT31T0             ETH_MACHT0R_HT31T0_Msk                      /*!< MAC Hash Table First 32 Bits */

/* ***********************************  Bit definition for ETH_MACHT1R register  ************************************ */
#define ETH_MACHT1R_HT63T32_Pos        (0U)
#define ETH_MACHT1R_HT63T32_Msk        (0xFFFFFFFFUL << ETH_MACHT1R_HT63T32_Pos)   /*!< 0xFFFFFFFF */
#define ETH_MACHT1R_HT63T32            ETH_MACHT1R_HT63T32_Msk                     /*!< MAC Hash Table Second 32 Bits */

