MaJerle/stm32-usart-uart-dma-rx-tx/drivers/CMSIS/Device/ST/STM32C5xx/Include/stm32c593xx.h
/* ************************************  Bit definition for ETH_MACVTR register  ************************************ */
#define ETH_MACVTR_VL_Pos              (0U)
#define ETH_MACVTR_VL_Msk              (0xFFFFUL << ETH_MACVTR_VL_Pos)             /*!< 0x0000FFFF */
#define ETH_MACVTR_VL                  ETH_MACVTR_VL_Msk                           /*!< VLAN Tag Identifier for Receive
                                                                                        Packets */
#define ETH_MACVTR_ETV_Pos             (16U)
#define ETH_MACVTR_ETV_Msk             (0x1UL << ETH_MACVTR_ETV_Pos)               /*!< 0x00010000 */
#define ETH_MACVTR_ETV                 ETH_MACVTR_ETV_Msk                          /*!< Enable 12-Bit VLAN Tag
                                                                                        Comparison */
#define ETH_MACVTR_VTIM_Pos            (17U)
#define ETH_MACVTR_VTIM_Msk            (0x1UL << ETH_MACVTR_VTIM_Pos)              /*!< 0x00020000 */
#define ETH_MACVTR_VTIM                ETH_MACVTR_VTIM_Msk                         /*!< VLAN Tag Inverse Match Enable */
#define ETH_MACVTR_ESVL_Pos            (18U)
#define ETH_MACVTR_ESVL_Msk            (0x1UL << ETH_MACVTR_ESVL_Pos)              /*!< 0x00040000 */
#define ETH_MACVTR_ESVL                ETH_MACVTR_ESVL_Msk                         /*!< Enable S-VLAN */
#define ETH_MACVTR_ERSVLM_Pos          (19U)
#define ETH_MACVTR_ERSVLM_Msk          (0x1UL << ETH_MACVTR_ERSVLM_Pos)            /*!< 0x00080000 */
#define ETH_MACVTR_ERSVLM              ETH_MACVTR_ERSVLM_Msk                       /*!< Enable Receive S-VLAN Match */
#define ETH_MACVTR_DOVLTC_Pos          (20U)
#define ETH_MACVTR_DOVLTC_Msk          (0x1UL << ETH_MACVTR_DOVLTC_Pos)            /*!< 0x00100000 */
#define ETH_MACVTR_DOVLTC              ETH_MACVTR_DOVLTC_Msk                       /*!< Disable VLAN Type Check */
#define ETH_MACVTR_EVLS_Pos            (21U)
#define ETH_MACVTR_EVLS_Msk            (0x3UL << ETH_MACVTR_EVLS_Pos)              /*!< 0x00600000 */
#define ETH_MACVTR_EVLS                ETH_MACVTR_EVLS_Msk                         /*!< Enable VLAN Tag Stripping on
                                                                                        Receive */
#define ETH_MACVTR_EVLRXS_Pos          (24U)
#define ETH_MACVTR_EVLRXS_Msk          (0x1UL << ETH_MACVTR_EVLRXS_Pos)            /*!< 0x01000000 */
#define ETH_MACVTR_EVLRXS              ETH_MACVTR_EVLRXS_Msk                       /*!< Enable VLAN Tag in Rx status */
#define ETH_MACVTR_VTHM_Pos            (25U)
#define ETH_MACVTR_VTHM_Msk            (0x1UL << ETH_MACVTR_VTHM_Pos)              /*!< 0x02000000 */
#define ETH_MACVTR_VTHM                ETH_MACVTR_VTHM_Msk                         /*!< VLAN Tag Hash Table Match Enable
                                                                                        */
#define ETH_MACVTR_EDVLP_Pos           (26U)
#define ETH_MACVTR_EDVLP_Msk           (0x1UL << ETH_MACVTR_EDVLP_Pos)             /*!< 0x04000000 */
#define ETH_MACVTR_EDVLP               ETH_MACVTR_EDVLP_Msk                        /*!< Enable Double VLAN Processing */
#define ETH_MACVTR_ERIVLT_Pos          (27U)
#define ETH_MACVTR_ERIVLT_Msk          (0x1UL << ETH_MACVTR_ERIVLT_Pos)            /*!< 0x08000000 */
#define ETH_MACVTR_ERIVLT              ETH_MACVTR_ERIVLT_Msk                       /*!< Enable Inner VLAN Tag */
#define ETH_MACVTR_EIVLS_Pos           (28U)
#define ETH_MACVTR_EIVLS_Msk           (0x3UL << ETH_MACVTR_EIVLS_Pos)             /*!< 0x30000000 */
#define ETH_MACVTR_EIVLS               ETH_MACVTR_EIVLS_Msk                        /*!< Enable Inner VLAN Tag Stripping
                                                                                        on Receive */
#define ETH_MACVTR_EIVLRXS_Pos         (31U)
#define ETH_MACVTR_EIVLRXS_Msk         (0x1UL << ETH_MACVTR_EIVLRXS_Pos)           /*!< 0x80000000 */
#define ETH_MACVTR_EIVLRXS             ETH_MACVTR_EIVLRXS_Msk                      /*!< Enable Inner VLAN Tag in Rx
                                                                                        Status */

/* ***********************************  Bit definition for ETH_MACVHTR register  ************************************ */
#define ETH_MACVHTR_VLHT_Pos           (0U)
#define ETH_MACVHTR_VLHT_Msk           (0xFFFFUL << ETH_MACVHTR_VLHT_Pos)          /*!< 0x0000FFFF */
#define ETH_MACVHTR_VLHT               ETH_MACVHTR_VLHT_Msk                        /*!< VLAN Hash Table */

/* ************************************  Bit definition for ETH_MACVIR register  ************************************ */
#define ETH_MACVIR_VLT_Pos             (0U)
#define ETH_MACVIR_VLT_Msk             (0xFFFFUL << ETH_MACVIR_VLT_Pos)            /*!< 0x0000FFFF */
#define ETH_MACVIR_VLT                 ETH_MACVIR_VLT_Msk                          /*!< VLAN Tag for Transmit Packets */
#define ETH_MACVIR_VLC_Pos             (16U)
#define ETH_MACVIR_VLC_Msk             (0x3UL << ETH_MACVIR_VLC_Pos)               /*!< 0x00030000 */
#define ETH_MACVIR_VLC                 ETH_MACVIR_VLC_Msk                          /*!< VLAN Tag Control in Transmit
                                                                                        Packets */
#define ETH_MACVIR_VLP_Pos             (18U)
#define ETH_MACVIR_VLP_Msk             (0x1UL << ETH_MACVIR_VLP_Pos)               /*!< 0x00040000 */
#define ETH_MACVIR_VLP                 ETH_MACVIR_VLP_Msk                          /*!< VLAN Priority Control */
#define ETH_MACVIR_CSVL_Pos            (19U)
#define ETH_MACVIR_CSVL_Msk            (0x1UL << ETH_MACVIR_CSVL_Pos)              /*!< 0x00080000 */
#define ETH_MACVIR_CSVL                ETH_MACVIR_CSVL_Msk                         /*!< C-VLAN or S-VLAN */
#define ETH_MACVIR_VLTI_Pos            (20U)
#define ETH_MACVIR_VLTI_Msk            (0x1UL << ETH_MACVIR_VLTI_Pos)              /*!< 0x00100000 */
#define ETH_MACVIR_VLTI                ETH_MACVIR_VLTI_Msk                         /*!< VLAN Tag Input */

/* ***********************************  Bit definition for ETH_MACIVIR register  ************************************ */
#define ETH_MACIVIR_VLT_Pos            (0U)
#define ETH_MACIVIR_VLT_Msk            (0xFFFFUL << ETH_MACIVIR_VLT_Pos)           /*!< 0x0000FFFF */
#define ETH_MACIVIR_VLT                ETH_MACIVIR_VLT_Msk                         /*!< VLAN Tag for Transmit Packets */
#define ETH_MACIVIR_VLC_Pos            (16U)
#define ETH_MACIVIR_VLC_Msk            (0x3UL << ETH_MACIVIR_VLC_Pos)              /*!< 0x00030000 */
#define ETH_MACIVIR_VLC                ETH_MACIVIR_VLC_Msk                         /*!< VLAN Tag Control in Transmit
                                                                                        Packets */
#define ETH_MACIVIR_VLP_Pos            (18U)
#define ETH_MACIVIR_VLP_Msk            (0x1UL << ETH_MACIVIR_VLP_Pos)              /*!< 0x00040000 */
#define ETH_MACIVIR_VLP                ETH_MACIVIR_VLP_Msk                         /*!< VLAN Priority Control */
#define ETH_MACIVIR_CSVL_Pos           (19U)
#define ETH_MACIVIR_CSVL_Msk           (0x1UL << ETH_MACIVIR_CSVL_Pos)             /*!< 0x00080000 */
#define ETH_MACIVIR_CSVL               ETH_MACIVIR_CSVL_Msk                        /*!< C-VLAN or S-VLAN */
#define ETH_MACIVIR_VLTI_Pos           (20U)
#define ETH_MACIVIR_VLTI_Msk           (0x1UL << ETH_MACIVIR_VLTI_Pos)             /*!< 0x00100000 */
#define ETH_MACIVIR_VLTI               ETH_MACIVIR_VLTI_Msk                        /*!< VLAN Tag Input */

