MaJerle/stm32-usart-uart-dma-rx-tx/drivers/CMSIS/Device/ST/STM32C5xx/Include/stm32c593xx.h
/* **********************************  Bit definition for ETH_MACRXTXSR register  *********************************** */
#define ETH_MACRXTXSR_TJT_Pos          (0U)
#define ETH_MACRXTXSR_TJT_Msk          (0x1UL << ETH_MACRXTXSR_TJT_Pos)            /*!< 0x00000001 */
#define ETH_MACRXTXSR_TJT              ETH_MACRXTXSR_TJT_Msk                       /*!< Transmit Jabber Timeout */
#define ETH_MACRXTXSR_NCARR_Pos        (1U)
#define ETH_MACRXTXSR_NCARR_Msk        (0x1UL << ETH_MACRXTXSR_NCARR_Pos)          /*!< 0x00000002 */
#define ETH_MACRXTXSR_NCARR            ETH_MACRXTXSR_NCARR_Msk                     /*!< No Carrier */
#define ETH_MACRXTXSR_LCARR_Pos        (2U)
#define ETH_MACRXTXSR_LCARR_Msk        (0x1UL << ETH_MACRXTXSR_LCARR_Pos)          /*!< 0x00000004 */
#define ETH_MACRXTXSR_LCARR            ETH_MACRXTXSR_LCARR_Msk                     /*!< Loss of Carrier */
#define ETH_MACRXTXSR_EXDEF_Pos        (3U)
#define ETH_MACRXTXSR_EXDEF_Msk        (0x1UL << ETH_MACRXTXSR_EXDEF_Pos)          /*!< 0x00000008 */
#define ETH_MACRXTXSR_EXDEF            ETH_MACRXTXSR_EXDEF_Msk                     /*!< Excessive Deferral */
#define ETH_MACRXTXSR_LCOL_Pos         (4U)
#define ETH_MACRXTXSR_LCOL_Msk         (0x1UL << ETH_MACRXTXSR_LCOL_Pos)           /*!< 0x00000010 */
#define ETH_MACRXTXSR_LCOL             ETH_MACRXTXSR_LCOL_Msk                      /*!< Late Collision */
#define ETH_MACRXTXSR_EXCOL_Pos        (5U)
#define ETH_MACRXTXSR_EXCOL_Msk        (0x1UL << ETH_MACRXTXSR_EXCOL_Pos)          /*!< 0x00000020 */
#define ETH_MACRXTXSR_EXCOL            ETH_MACRXTXSR_EXCOL_Msk                     /*!< Excessive Collisions */
#define ETH_MACRXTXSR_RWT_Pos          (8U)
#define ETH_MACRXTXSR_RWT_Msk          (0x1UL << ETH_MACRXTXSR_RWT_Pos)            /*!< 0x00000100 */
#define ETH_MACRXTXSR_RWT              ETH_MACRXTXSR_RWT_Msk                       /*!< Receive Watchdog Timeout */

/* ***********************************  Bit definition for ETH_MACPCSR register  ************************************ */
#define ETH_MACPCSR_PWRDWN_Pos         (0U)
#define ETH_MACPCSR_PWRDWN_Msk         (0x1UL << ETH_MACPCSR_PWRDWN_Pos)           /*!< 0x00000001 */
#define ETH_MACPCSR_PWRDWN             ETH_MACPCSR_PWRDWN_Msk                      /*!< Power Down */
#define ETH_MACPCSR_MGKPKTEN_Pos       (1U)
#define ETH_MACPCSR_MGKPKTEN_Msk       (0x1UL << ETH_MACPCSR_MGKPKTEN_Pos)         /*!< 0x00000002 */
#define ETH_MACPCSR_MGKPKTEN           ETH_MACPCSR_MGKPKTEN_Msk                    /*!< Magic Packet Enable */
#define ETH_MACPCSR_RWKPKTEN_Pos       (2U)
#define ETH_MACPCSR_RWKPKTEN_Msk       (0x1UL << ETH_MACPCSR_RWKPKTEN_Pos)         /*!< 0x00000004 */
#define ETH_MACPCSR_RWKPKTEN           ETH_MACPCSR_RWKPKTEN_Msk                    /*!< Remote wake-up Packet Enable */
#define ETH_MACPCSR_MGKPRCVD_Pos       (5U)
#define ETH_MACPCSR_MGKPRCVD_Msk       (0x1UL << ETH_MACPCSR_MGKPRCVD_Pos)         /*!< 0x00000020 */
#define ETH_MACPCSR_MGKPRCVD           ETH_MACPCSR_MGKPRCVD_Msk                    /*!< Magic Packet Received */
#define ETH_MACPCSR_RWKPRCVD_Pos       (6U)
#define ETH_MACPCSR_RWKPRCVD_Msk       (0x1UL << ETH_MACPCSR_RWKPRCVD_Pos)         /*!< 0x00000040 */
#define ETH_MACPCSR_RWKPRCVD           ETH_MACPCSR_RWKPRCVD_Msk                    /*!< Remote wake-up Packet Received
                                                                                        */
#define ETH_MACPCSR_GLBLUCAST_Pos      (9U)
#define ETH_MACPCSR_GLBLUCAST_Msk      (0x1UL << ETH_MACPCSR_GLBLUCAST_Pos)        /*!< 0x00000200 */
#define ETH_MACPCSR_GLBLUCAST          ETH_MACPCSR_GLBLUCAST_Msk                   /*!< Global Unicast */
#define ETH_MACPCSR_RWKPFE_Pos         (10U)
#define ETH_MACPCSR_RWKPFE_Msk         (0x1UL << ETH_MACPCSR_RWKPFE_Pos)           /*!< 0x00000400 */
#define ETH_MACPCSR_RWKPFE             ETH_MACPCSR_RWKPFE_Msk                      /*!< Remote wake-up Packet Forwarding
                                                                                        Enable */
#define ETH_MACPCSR_RWKPTR_Pos         (24U)
#define ETH_MACPCSR_RWKPTR_Msk         (0x1FUL << ETH_MACPCSR_RWKPTR_Pos)          /*!< 0x1F000000 */
#define ETH_MACPCSR_RWKPTR             ETH_MACPCSR_RWKPTR_Msk                      /*!< Remote wake-up FIFO Pointer */
#define ETH_MACPCSR_RWKFILTRST_Pos     (31U)
#define ETH_MACPCSR_RWKFILTRST_Msk     (0x1UL << ETH_MACPCSR_RWKFILTRST_Pos)       /*!< 0x80000000 */
#define ETH_MACPCSR_RWKFILTRST         ETH_MACPCSR_RWKFILTRST_Msk                  /*!< Remote Wake-up Packet Filter
                                                                                        Register Pointer Reset */

/* **********************************  Bit definition for ETH_MACRWKPFR register  *********************************** */
#define ETH_MACRWKPFR_MACRWKPFR_Pos    (0U)
#define ETH_MACRWKPFR_MACRWKPFR_Msk    (0xFFFFFFFFUL << \
                                       ETH_MACRWKPFR_MACRWKPFR_Pos)                /*!< 0xFFFFFFFF */
#define ETH_MACRWKPFR_MACRWKPFR        ETH_MACRWKPFR_MACRWKPFR_Msk                 /*!< Remote wake-up packet filter */

/* ***********************************  Bit definition for ETH_MACLCSR register  ************************************ */
#define ETH_MACLCSR_TLPIEN_Pos         (0U)
#define ETH_MACLCSR_TLPIEN_Msk         (0x1UL << ETH_MACLCSR_TLPIEN_Pos)           /*!< 0x00000001 */
#define ETH_MACLCSR_TLPIEN             ETH_MACLCSR_TLPIEN_Msk                      /*!< Transmit LPI Entry */
#define ETH_MACLCSR_TLPIEX_Pos         (1U)
#define ETH_MACLCSR_TLPIEX_Msk         (0x1UL << ETH_MACLCSR_TLPIEX_Pos)           /*!< 0x00000002 */
#define ETH_MACLCSR_TLPIEX             ETH_MACLCSR_TLPIEX_Msk                      /*!< Transmit LPI Exit */
#define ETH_MACLCSR_RLPIEN_Pos         (2U)
#define ETH_MACLCSR_RLPIEN_Msk         (0x1UL << ETH_MACLCSR_RLPIEN_Pos)           /*!< 0x00000004 */
#define ETH_MACLCSR_RLPIEN             ETH_MACLCSR_RLPIEN_Msk                      /*!< Receive LPI Entry */
#define ETH_MACLCSR_RLPIEX_Pos         (3U)
#define ETH_MACLCSR_RLPIEX_Msk         (0x1UL << ETH_MACLCSR_RLPIEX_Pos)           /*!< 0x00000008 */
#define ETH_MACLCSR_RLPIEX             ETH_MACLCSR_RLPIEX_Msk                      /*!< Receive LPI Exit */
#define ETH_MACLCSR_TLPIST_Pos         (8U)
#define ETH_MACLCSR_TLPIST_Msk         (0x1UL << ETH_MACLCSR_TLPIST_Pos)           /*!< 0x00000100 */
#define ETH_MACLCSR_TLPIST             ETH_MACLCSR_TLPIST_Msk                      /*!< Transmit LPI State */
#define ETH_MACLCSR_RLPIST_Pos         (9U)
#define ETH_MACLCSR_RLPIST_Msk         (0x1UL << ETH_MACLCSR_RLPIST_Pos)           /*!< 0x00000200 */
#define ETH_MACLCSR_RLPIST             ETH_MACLCSR_RLPIST_Msk                      /*!< Receive LPI State */
#define ETH_MACLCSR_LPIEN_Pos          (16U)
#define ETH_MACLCSR_LPIEN_Msk          (0x1UL << ETH_MACLCSR_LPIEN_Pos)            /*!< 0x00010000 */
#define ETH_MACLCSR_LPIEN              ETH_MACLCSR_LPIEN_Msk                       /*!< LPI Enable */
#define ETH_MACLCSR_PLS_Pos            (17U)
#define ETH_MACLCSR_PLS_Msk            (0x1UL << ETH_MACLCSR_PLS_Pos)              /*!< 0x00020000 */
#define ETH_MACLCSR_PLS                ETH_MACLCSR_PLS_Msk                         /*!< PHY Link Status */
#define ETH_MACLCSR_LPITXA_Pos         (19U)
#define ETH_MACLCSR_LPITXA_Msk         (0x1UL << ETH_MACLCSR_LPITXA_Pos)           /*!< 0x00080000 */
#define ETH_MACLCSR_LPITXA             ETH_MACLCSR_LPITXA_Msk                      /*!< LPI Tx Automate */
#define ETH_MACLCSR_LPITE_Pos          (20U)
#define ETH_MACLCSR_LPITE_Msk          (0x1UL << ETH_MACLCSR_LPITE_Pos)            /*!< 0x00100000 */
#define ETH_MACLCSR_LPITE              ETH_MACLCSR_LPITE_Msk                       /*!< LPI Timer Enable */
#define ETH_MACLCSR_LPITCSE_Pos        (21U)
#define ETH_MACLCSR_LPITCSE_Msk        (0x1UL << ETH_MACLCSR_LPITCSE_Pos)          /*!< 0x00200000 */
#define ETH_MACLCSR_LPITCSE            ETH_MACLCSR_LPITCSE_Msk                     /*!< LPI Tx Clock Stop Enable */

/* ***********************************  Bit definition for ETH_MACLTCR register  ************************************ */
#define ETH_MACLTCR_TWT_Pos            (0U)
#define ETH_MACLTCR_TWT_Msk            (0xFFFFUL << ETH_MACLTCR_TWT_Pos)           /*!< 0x0000FFFF */
#define ETH_MACLTCR_TWT                ETH_MACLTCR_TWT_Msk                         /*!< LPI TW Timer */
#define ETH_MACLTCR_LST_Pos            (16U)
#define ETH_MACLTCR_LST_Msk            (0x3FFUL << ETH_MACLTCR_LST_Pos)            /*!< 0x03FF0000 */
#define ETH_MACLTCR_LST                ETH_MACLTCR_LST_Msk                         /*!< LPI LS Timer */

