MaJerle/stm32-usart-uart-dma-rx-tx/drivers/CMSIS/Device/ST/STM32C5xx/Include/stm32c593xx.h
/* ***********************************  Bit definition for ETH_MACLETR register  ************************************ */
#define ETH_MACLETR_LPIET_Pos          (0U)
#define ETH_MACLETR_LPIET_Msk          (0xFFFFFUL << ETH_MACLETR_LPIET_Pos)        /*!< 0x000FFFFF */
#define ETH_MACLETR_LPIET              ETH_MACLETR_LPIET_Msk                       /*!< LPI Entry Timer */

/* **********************************  Bit definition for ETH_MAC1USTCR register  *********************************** */
#define ETH_MAC1USTCR_TIC_1US_CNTR_Pos (0U)
#define ETH_MAC1USTCR_TIC_1US_CNTR_Msk (0xFFFUL << ETH_MAC1USTCR_TIC_1US_CNTR_Pos) /*!< 0x00000FFF */
#define ETH_MAC1USTCR_TIC_1US_CNTR     ETH_MAC1USTCR_TIC_1US_CNTR_Msk              /*!< 1 micro s tick Counter */

/* ************************************  Bit definition for ETH_MACVR register  ************************************* */
#define ETH_MACVR_SNPSVER_Pos          (0U)
#define ETH_MACVR_SNPSVER_Msk          (0xFFUL << ETH_MACVR_SNPSVER_Pos)           /*!< 0x000000FF */
#define ETH_MACVR_SNPSVER              ETH_MACVR_SNPSVER_Msk                       /*!< IP version */
#define ETH_MACVR_USERVER_Pos          (8U)
#define ETH_MACVR_USERVER_Msk          (0xFFUL << ETH_MACVR_USERVER_Pos)           /*!< 0x0000FF00 */
#define ETH_MACVR_USERVER              ETH_MACVR_USERVER_Msk                       /*!< ST-defined version */

/* ************************************  Bit definition for ETH_MACDR register  ************************************* */
#define ETH_MACDR_RPESTS_Pos           (0U)
#define ETH_MACDR_RPESTS_Msk           (0x1UL << ETH_MACDR_RPESTS_Pos)             /*!< 0x00000001 */
#define ETH_MACDR_RPESTS               ETH_MACDR_RPESTS_Msk                        /*!< MAC MII Receive Protocol Engine
                                                                                        Status */
#define ETH_MACDR_RFCFCSTS_Pos         (1U)
#define ETH_MACDR_RFCFCSTS_Msk         (0x3UL << ETH_MACDR_RFCFCSTS_Pos)           /*!< 0x00000006 */
#define ETH_MACDR_RFCFCSTS             ETH_MACDR_RFCFCSTS_Msk                      /*!< MAC Receive Packet Controller
                                                                                        FIFO Status */
#define ETH_MACDR_TPESTS_Pos           (16U)
#define ETH_MACDR_TPESTS_Msk           (0x1UL << ETH_MACDR_TPESTS_Pos)             /*!< 0x00010000 */
#define ETH_MACDR_TPESTS               ETH_MACDR_TPESTS_Msk                        /*!< MAC MII Transmit Protocol Engine
                                                                                        Status */
#define ETH_MACDR_TFCSTS_Pos           (17U)
#define ETH_MACDR_TFCSTS_Msk           (0x3UL << ETH_MACDR_TFCSTS_Pos)             /*!< 0x00060000 */
#define ETH_MACDR_TFCSTS               ETH_MACDR_TFCSTS_Msk                        /*!< MAC Transmit Packet Controller
                                                                                        Status */

/* ***********************************  Bit definition for ETH_MACHWF0R register  *********************************** */
#define ETH_MACHWF0R_MIISEL_Pos        (0U)
#define ETH_MACHWF0R_MIISEL_Msk        (0x1UL << ETH_MACHWF0R_MIISEL_Pos)          /*!< 0x00000001 */
#define ETH_MACHWF0R_MIISEL            ETH_MACHWF0R_MIISEL_Msk                     /*!< 10 or 100 Mbps Support */
#define ETH_MACHWF0R_GMIISEL_Pos       (1U)
#define ETH_MACHWF0R_GMIISEL_Msk       (0x1UL << ETH_MACHWF0R_GMIISEL_Pos)         /*!< 0x00000002 */
#define ETH_MACHWF0R_GMIISEL           ETH_MACHWF0R_GMIISEL_Msk                    /*!< 1000 Mbps Support */
#define ETH_MACHWF0R_HDSEL_Pos         (2U)
#define ETH_MACHWF0R_HDSEL_Msk         (0x1UL << ETH_MACHWF0R_HDSEL_Pos)           /*!< 0x00000004 */
#define ETH_MACHWF0R_HDSEL             ETH_MACHWF0R_HDSEL_Msk                      /*!< Half-duplex Support */
#define ETH_MACHWF0R_PCSSEL_Pos        (3U)
#define ETH_MACHWF0R_PCSSEL_Msk        (0x1UL << ETH_MACHWF0R_PCSSEL_Pos)          /*!< 0x00000008 */
#define ETH_MACHWF0R_PCSSEL            ETH_MACHWF0R_PCSSEL_Msk                     /*!< PCS Registers (TBI, SGMII, or
                                                                                        RTBI PHY interface) */
#define ETH_MACHWF0R_VLHASH_Pos        (4U)
#define ETH_MACHWF0R_VLHASH_Msk        (0x1UL << ETH_MACHWF0R_VLHASH_Pos)          /*!< 0x00000010 */
#define ETH_MACHWF0R_VLHASH            ETH_MACHWF0R_VLHASH_Msk                     /*!< VLAN Hash Filter Selected */
#define ETH_MACHWF0R_SMASEL_Pos        (5U)
#define ETH_MACHWF0R_SMASEL_Msk        (0x1UL << ETH_MACHWF0R_SMASEL_Pos)          /*!< 0x00000020 */
#define ETH_MACHWF0R_SMASEL            ETH_MACHWF0R_SMASEL_Msk                     /*!< SMA (MDIO) Interface */
#define ETH_MACHWF0R_RWKSEL_Pos        (6U)
#define ETH_MACHWF0R_RWKSEL_Msk        (0x1UL << ETH_MACHWF0R_RWKSEL_Pos)          /*!< 0x00000040 */
#define ETH_MACHWF0R_RWKSEL            ETH_MACHWF0R_RWKSEL_Msk                     /*!< PMT Remote Wake-up Packet Enable
                                                                                        */
#define ETH_MACHWF0R_MGKSEL_Pos        (7U)
#define ETH_MACHWF0R_MGKSEL_Msk        (0x1UL << ETH_MACHWF0R_MGKSEL_Pos)          /*!< 0x00000080 */
#define ETH_MACHWF0R_MGKSEL            ETH_MACHWF0R_MGKSEL_Msk                     /*!< PMT Magic Packet Enable */
#define ETH_MACHWF0R_MMCSEL_Pos        (8U)
#define ETH_MACHWF0R_MMCSEL_Msk        (0x1UL << ETH_MACHWF0R_MMCSEL_Pos)          /*!< 0x00000100 */
#define ETH_MACHWF0R_MMCSEL            ETH_MACHWF0R_MMCSEL_Msk                     /*!< RMON Module Enable */
#define ETH_MACHWF0R_ARPOFFSEL_Pos     (9U)
#define ETH_MACHWF0R_ARPOFFSEL_Msk     (0x1UL << ETH_MACHWF0R_ARPOFFSEL_Pos)       /*!< 0x00000200 */
#define ETH_MACHWF0R_ARPOFFSEL         ETH_MACHWF0R_ARPOFFSEL_Msk                  /*!< ARP Offload Enabled */
#define ETH_MACHWF0R_TSSEL_Pos         (12U)
#define ETH_MACHWF0R_TSSEL_Msk         (0x1UL << ETH_MACHWF0R_TSSEL_Pos)           /*!< 0x00001000 */
#define ETH_MACHWF0R_TSSEL             ETH_MACHWF0R_TSSEL_Msk                      /*!< IEEE 1588-2008 Timestamp Enabled
                                                                                        */
#define ETH_MACHWF0R_EEESEL_Pos        (13U)
#define ETH_MACHWF0R_EEESEL_Msk        (0x1UL << ETH_MACHWF0R_EEESEL_Pos)          /*!< 0x00002000 */
#define ETH_MACHWF0R_EEESEL            ETH_MACHWF0R_EEESEL_Msk                     /*!< Energy Efficient Ethernet
                                                                                        Enabled */
#define ETH_MACHWF0R_TXCOESEL_Pos      (14U)
#define ETH_MACHWF0R_TXCOESEL_Msk      (0x1UL << ETH_MACHWF0R_TXCOESEL_Pos)        /*!< 0x00004000 */
#define ETH_MACHWF0R_TXCOESEL          ETH_MACHWF0R_TXCOESEL_Msk                   /*!< Transmit Checksum Offload
                                                                                        Enabled */
#define ETH_MACHWF0R_RXCOESEL_Pos      (16U)
#define ETH_MACHWF0R_RXCOESEL_Msk      (0x1UL << ETH_MACHWF0R_RXCOESEL_Pos)        /*!< 0x00010000 */
#define ETH_MACHWF0R_RXCOESEL          ETH_MACHWF0R_RXCOESEL_Msk                   /*!< Receive Checksum Offload Enabled
                                                                                        */
#define ETH_MACHWF0R_ADDMACADRSEL_Pos  (18U)
#define ETH_MACHWF0R_ADDMACADRSEL_Msk  (0x1FUL << ETH_MACHWF0R_ADDMACADRSEL_Pos)   /*!< 0x007C0000 */
#define ETH_MACHWF0R_ADDMACADRSEL      ETH_MACHWF0R_ADDMACADRSEL_Msk               /*!< MAC Addresses 1-31 Selected */
#define ETH_MACHWF0R_MACADR32SEL_Pos   (23U)
#define ETH_MACHWF0R_MACADR32SEL_Msk   (0x1UL << ETH_MACHWF0R_MACADR32SEL_Pos)     /*!< 0x00800000 */
#define ETH_MACHWF0R_MACADR32SEL       ETH_MACHWF0R_MACADR32SEL_Msk                /*!< MAC Addresses 32-63 Selected */
#define ETH_MACHWF0R_MACADR64SEL_Pos   (24U)
#define ETH_MACHWF0R_MACADR64SEL_Msk   (0x1UL << ETH_MACHWF0R_MACADR64SEL_Pos)     /*!< 0x01000000 */
#define ETH_MACHWF0R_MACADR64SEL       ETH_MACHWF0R_MACADR64SEL_Msk                /*!< MAC Addresses 64-127 Selected */
#define ETH_MACHWF0R_TSSTSSEL_Pos      (25U)
#define ETH_MACHWF0R_TSSTSSEL_Msk      (0x3UL << ETH_MACHWF0R_TSSTSSEL_Pos)        /*!< 0x06000000 */
#define ETH_MACHWF0R_TSSTSSEL          ETH_MACHWF0R_TSSTSSEL_Msk                   /*!< Timestamp System Time Source */
#define ETH_MACHWF0R_SAVLANINS_Pos     (27U)
#define ETH_MACHWF0R_SAVLANINS_Msk     (0x1UL << ETH_MACHWF0R_SAVLANINS_Pos)       /*!< 0x08000000 */
#define ETH_MACHWF0R_SAVLANINS         ETH_MACHWF0R_SAVLANINS_Msk                  /*!< Source Address or VLAN Insertion
                                                                                        Enable */
#define ETH_MACHWF0R_ACTPHYSEL_Pos     (28U)
#define ETH_MACHWF0R_ACTPHYSEL_Msk     (0xFUL << ETH_MACHWF0R_ACTPHYSEL_Pos)       /*!< 0xF0000000 */
#define ETH_MACHWF0R_ACTPHYSEL         ETH_MACHWF0R_ACTPHYSEL_Msk                  /*!< Active PHY selected */

/* ***********************************  Bit definition for ETH_MACHWF1R register  *********************************** */
#define ETH_MACHWF1R_RXFIFOSIZE_Pos    (0U)
#define ETH_MACHWF1R_RXFIFOSIZE_Msk    (0x1FUL << ETH_MACHWF1R_RXFIFOSIZE_Pos)     /*!< 0x0000001F */
#define ETH_MACHWF1R_RXFIFOSIZE        ETH_MACHWF1R_RXFIFOSIZE_Msk                 /*!< MTL Receive FIFO Size */
#define ETH_MACHWF1R_SPRAM_Pos         (5U)
#define ETH_MACHWF1R_SPRAM_Msk         (0x1UL << ETH_MACHWF1R_SPRAM_Pos)           /*!< 0x00000020 */
#define ETH_MACHWF1R_SPRAM             ETH_MACHWF1R_SPRAM_Msk                      /*!< Single Port RAM Enable */
#define ETH_MACHWF1R_TXFIFOSIZE_Pos    (6U)
#define ETH_MACHWF1R_TXFIFOSIZE_Msk    (0x1FUL << ETH_MACHWF1R_TXFIFOSIZE_Pos)     /*!< 0x000007C0 */
#define ETH_MACHWF1R_TXFIFOSIZE        ETH_MACHWF1R_TXFIFOSIZE_Msk                 /*!< MTL Transmit FIFO Size */
#define ETH_MACHWF1R_OSTEN_Pos         (11U)
#define ETH_MACHWF1R_OSTEN_Msk         (0x1UL << ETH_MACHWF1R_OSTEN_Pos)           /*!< 0x00000800 */
#define ETH_MACHWF1R_OSTEN             ETH_MACHWF1R_OSTEN_Msk                      /*!< One-Step Timestamping Enable */
#define ETH_MACHWF1R_PTOEN_Pos         (12U)
#define ETH_MACHWF1R_PTOEN_Msk         (0x1UL << ETH_MACHWF1R_PTOEN_Pos)           /*!< 0x00001000 */
#define ETH_MACHWF1R_PTOEN             ETH_MACHWF1R_PTOEN_Msk                      /*!< PTP Offload Enable */
#define ETH_MACHWF1R_ADVTHWORD_Pos     (13U)
#define ETH_MACHWF1R_ADVTHWORD_Msk     (0x1UL << ETH_MACHWF1R_ADVTHWORD_Pos)       /*!< 0x00002000 */
#define ETH_MACHWF1R_ADVTHWORD         ETH_MACHWF1R_ADVTHWORD_Msk                  /*!< IEEE 1588 High Word Register
                                                                                        Enable */
#define ETH_MACHWF1R_ADDR64_Pos        (14U)
#define ETH_MACHWF1R_ADDR64_Msk        (0x3UL << ETH_MACHWF1R_ADDR64_Pos)          /*!< 0x0000C000 */
#define ETH_MACHWF1R_ADDR64            ETH_MACHWF1R_ADDR64_Msk                     /*!< Address width */
#define ETH_MACHWF1R_DCBEN_Pos         (16U)
#define ETH_MACHWF1R_DCBEN_Msk         (0x1UL << ETH_MACHWF1R_DCBEN_Pos)           /*!< 0x00010000 */
#define ETH_MACHWF1R_DCBEN             ETH_MACHWF1R_DCBEN_Msk                      /*!< DCB Feature Enable */
#define ETH_MACHWF1R_SPHEN_Pos         (17U)
#define ETH_MACHWF1R_SPHEN_Msk         (0x1UL << ETH_MACHWF1R_SPHEN_Pos)           /*!< 0x00020000 */
#define ETH_MACHWF1R_SPHEN             ETH_MACHWF1R_SPHEN_Msk                      /*!< Split Header Feature Enable */
#define ETH_MACHWF1R_TSOEN_Pos         (18U)
#define ETH_MACHWF1R_TSOEN_Msk         (0x1UL << ETH_MACHWF1R_TSOEN_Pos)           /*!< 0x00040000 */
#define ETH_MACHWF1R_TSOEN             ETH_MACHWF1R_TSOEN_Msk                      /*!< TCP Segmentation Offload Enable
                                                                                        */
#define ETH_MACHWF1R_DBGMEMA_Pos       (19U)
#define ETH_MACHWF1R_DBGMEMA_Msk       (0x1UL << ETH_MACHWF1R_DBGMEMA_Pos)         /*!< 0x00080000 */
#define ETH_MACHWF1R_DBGMEMA           ETH_MACHWF1R_DBGMEMA_Msk                    /*!< DMA Debug Registers Enable */
#define ETH_MACHWF1R_AVSEL_Pos         (20U)
#define ETH_MACHWF1R_AVSEL_Msk         (0x1UL << ETH_MACHWF1R_AVSEL_Pos)           /*!< 0x00100000 */
#define ETH_MACHWF1R_AVSEL             ETH_MACHWF1R_AVSEL_Msk                      /*!< AV Feature Enable */
#define ETH_MACHWF1R_RAVSEL_Pos        (21U)
#define ETH_MACHWF1R_RAVSEL_Msk        (0x1UL << ETH_MACHWF1R_RAVSEL_Pos)          /*!< 0x00200000 */
#define ETH_MACHWF1R_RAVSEL            ETH_MACHWF1R_RAVSEL_Msk                     /*!< Rx Side Only AV Feature Enable
                                                                                        */
#define ETH_MACHWF1R_POUOST_Pos        (23U)
#define ETH_MACHWF1R_POUOST_Msk        (0x1UL << ETH_MACHWF1R_POUOST_Pos)          /*!< 0x00800000 */
#define ETH_MACHWF1R_POUOST            ETH_MACHWF1R_POUOST_Msk                     /*!< One Step for PTP over UDP/IP
                                                                                        Feature Enable */
#define ETH_MACHWF1R_HASHTBLSZ_Pos     (24U)
#define ETH_MACHWF1R_HASHTBLSZ_Msk     (0x3UL << ETH_MACHWF1R_HASHTBLSZ_Pos)       /*!< 0x03000000 */
#define ETH_MACHWF1R_HASHTBLSZ         ETH_MACHWF1R_HASHTBLSZ_Msk                  /*!< Hash Table Size */
#define ETH_MACHWF1R_L3L4FNUM_Pos      (27U)
#define ETH_MACHWF1R_L3L4FNUM_Msk      (0xFUL << ETH_MACHWF1R_L3L4FNUM_Pos)        /*!< 0x78000000 */
#define ETH_MACHWF1R_L3L4FNUM          ETH_MACHWF1R_L3L4FNUM_Msk                   /*!< Total number of L3 or L4 Filters
                                                                                        */

/* ***********************************  Bit definition for ETH_MACHWF2R register  *********************************** */
#define ETH_MACHWF2R_RXQCNT_Pos        (0U)
#define ETH_MACHWF2R_RXQCNT_Msk        (0xFUL << ETH_MACHWF2R_RXQCNT_Pos)          /*!< 0x0000000F */
#define ETH_MACHWF2R_RXQCNT            ETH_MACHWF2R_RXQCNT_Msk                     /*!< Number of MTL Receive Queues */
#define ETH_MACHWF2R_TXQCNT_Pos        (6U)
#define ETH_MACHWF2R_TXQCNT_Msk        (0xFUL << ETH_MACHWF2R_TXQCNT_Pos)          /*!< 0x000003C0 */
#define ETH_MACHWF2R_TXQCNT            ETH_MACHWF2R_TXQCNT_Msk                     /*!< Number of MTL Transmit Queues */
#define ETH_MACHWF2R_RXCHCNT_Pos       (12U)
#define ETH_MACHWF2R_RXCHCNT_Msk       (0xFUL << ETH_MACHWF2R_RXCHCNT_Pos)         /*!< 0x0000F000 */
#define ETH_MACHWF2R_RXCHCNT           ETH_MACHWF2R_RXCHCNT_Msk                    /*!< Number of DMA Receive Channels
                                                                                        */
#define ETH_MACHWF2R_RDCSZ_Pos         (16U)
#define ETH_MACHWF2R_RDCSZ_Msk         (0x3UL << ETH_MACHWF2R_RDCSZ_Pos)           /*!< 0x00030000 */
#define ETH_MACHWF2R_RDCSZ             ETH_MACHWF2R_RDCSZ_Msk                      /*!< Rx DMA Descriptor Cache Size in
                                                                                        terms of 16-byte descriptors */
#define ETH_MACHWF2R_TXCHCNT_Pos       (18U)
#define ETH_MACHWF2R_TXCHCNT_Msk       (0xFUL << ETH_MACHWF2R_TXCHCNT_Pos)         /*!< 0x003C0000 */
#define ETH_MACHWF2R_TXCHCNT           ETH_MACHWF2R_TXCHCNT_Msk                    /*!< Number of DMA Transmit Channels
                                                                                        */
#define ETH_MACHWF2R_TDCSZ_Pos         (22U)
#define ETH_MACHWF2R_TDCSZ_Msk         (0x3UL << ETH_MACHWF2R_TDCSZ_Pos)           /*!< 0x00C00000 */
#define ETH_MACHWF2R_TDCSZ             ETH_MACHWF2R_TDCSZ_Msk                      /*!< Tx DMA Descriptor Cache Size in
                                                                                        terms of 16-byte descriptors */
#define ETH_MACHWF2R_PPSOUTNUM_Pos     (24U)
#define ETH_MACHWF2R_PPSOUTNUM_Msk     (0x7UL << ETH_MACHWF2R_PPSOUTNUM_Pos)       /*!< 0x07000000 */
#define ETH_MACHWF2R_PPSOUTNUM         ETH_MACHWF2R_PPSOUTNUM_Msk                  /*!< Number of PPS Outputs */
#define ETH_MACHWF2R_AUXSNAPNUM_Pos    (28U)
#define ETH_MACHWF2R_AUXSNAPNUM_Msk    (0x7UL << ETH_MACHWF2R_AUXSNAPNUM_Pos)      /*!< 0x70000000 */
#define ETH_MACHWF2R_AUXSNAPNUM        ETH_MACHWF2R_AUXSNAPNUM_Msk                 /*!< Number of Auxiliary Snapshot
                                                                                        Inputs */

/* ***********************************  Bit definition for ETH_MACHWF3R register  *********************************** */
#define ETH_MACHWF3R_NRVF_Pos          (0U)
#define ETH_MACHWF3R_NRVF_Msk          (0x7UL << ETH_MACHWF3R_NRVF_Pos)            /*!< 0x00000007 */
#define ETH_MACHWF3R_NRVF              ETH_MACHWF3R_NRVF_Msk                       /*!< Number of Extended VLAN Tag
                                                                                        Filters Enabled */
#define ETH_MACHWF3R_CBTISEL_Pos       (4U)
#define ETH_MACHWF3R_CBTISEL_Msk       (0x1UL << ETH_MACHWF3R_CBTISEL_Pos)         /*!< 0x00000010 */
#define ETH_MACHWF3R_CBTISEL           ETH_MACHWF3R_CBTISEL_Msk                    /*!< Queue/Channel based VLAN tag
                                                                                        insertion on Tx enable */
#define ETH_MACHWF3R_DVLAN_Pos         (5U)
#define ETH_MACHWF3R_DVLAN_Msk         (0x1UL << ETH_MACHWF3R_DVLAN_Pos)           /*!< 0x00000020 */
#define ETH_MACHWF3R_DVLAN             ETH_MACHWF3R_DVLAN_Msk                      /*!< Double VLAN processing enable */
#define ETH_MACHWF3R_PDUPSEL_Pos       (9U)
#define ETH_MACHWF3R_PDUPSEL_Msk       (0x1UL << ETH_MACHWF3R_PDUPSEL_Pos)         /*!< 0x00000200 */
#define ETH_MACHWF3R_PDUPSEL           ETH_MACHWF3R_PDUPSEL_Msk                    /*!< Broadcast/Multicast Packet
                                                                                        Duplication */
#define ETH_MACHWF3R_FRPSEL_Pos        (10U)
#define ETH_MACHWF3R_FRPSEL_Msk        (0x1UL << ETH_MACHWF3R_FRPSEL_Pos)          /*!< 0x00000400 */
#define ETH_MACHWF3R_FRPSEL            ETH_MACHWF3R_FRPSEL_Msk                     /*!< Flexible Receive Parser Selected
                                                                                        */
#define ETH_MACHWF3R_FRPBS_Pos         (11U)
#define ETH_MACHWF3R_FRPBS_Msk         (0x3UL << ETH_MACHWF3R_FRPBS_Pos)           /*!< 0x00001800 */
#define ETH_MACHWF3R_FRPBS             ETH_MACHWF3R_FRPBS_Msk                      /*!< Flexible Receive Parser Buffer
                                                                                        size */
#define ETH_MACHWF3R_FRPES_Pos         (13U)
#define ETH_MACHWF3R_FRPES_Msk         (0x3UL << ETH_MACHWF3R_FRPES_Pos)           /*!< 0x00006000 */
#define ETH_MACHWF3R_FRPES             ETH_MACHWF3R_FRPES_Msk                      /*!< Flexible Receive Parser Table
                                                                                        Entries size */
#define ETH_MACHWF3R_ESTSEL_Pos        (16U)
#define ETH_MACHWF3R_ESTSEL_Msk        (0x1UL << ETH_MACHWF3R_ESTSEL_Pos)          /*!< 0x00010000 */
#define ETH_MACHWF3R_ESTSEL            ETH_MACHWF3R_ESTSEL_Msk                     /*!< Enhancements to Scheduled
                                                                                        Traffic Enable */
#define ETH_MACHWF3R_ESTDEP_Pos        (17U)
#define ETH_MACHWF3R_ESTDEP_Msk        (0x7UL << ETH_MACHWF3R_ESTDEP_Pos)          /*!< 0x000E0000 */
#define ETH_MACHWF3R_ESTDEP            ETH_MACHWF3R_ESTDEP_Msk                     /*!< Depth of the Gate Control List
                                                                                        */
#define ETH_MACHWF3R_ESTWID_Pos        (20U)
#define ETH_MACHWF3R_ESTWID_Msk        (0x3UL << ETH_MACHWF3R_ESTWID_Pos)          /*!< 0x00300000 */
#define ETH_MACHWF3R_ESTWID            ETH_MACHWF3R_ESTWID_Msk                     /*!< Width of the Time Interval field
                                                                                        in the Gate Control List */
#define ETH_MACHWF3R_FPESEL_Pos        (26U)
#define ETH_MACHWF3R_FPESEL_Msk        (0x1UL << ETH_MACHWF3R_FPESEL_Pos)          /*!< 0x04000000 */
#define ETH_MACHWF3R_FPESEL            ETH_MACHWF3R_FPESEL_Msk                     /*!< Frame Preemption Enable */
#define ETH_MACHWF3R_TBSSEL_Pos        (27U)
#define ETH_MACHWF3R_TBSSEL_Msk        (0x1UL << ETH_MACHWF3R_TBSSEL_Pos)          /*!< 0x08000000 */
#define ETH_MACHWF3R_TBSSEL            ETH_MACHWF3R_TBSSEL_Msk                     /*!< Time-based scheduling Enable */
#define ETH_MACHWF3R_ASP_Pos           (28U)
#define ETH_MACHWF3R_ASP_Msk           (0x3UL << ETH_MACHWF3R_ASP_Pos)             /*!< 0x30000000 */
#define ETH_MACHWF3R_ASP               ETH_MACHWF3R_ASP_Msk                        /*!< Automotive Safety Package */

/* **********************************  Bit definition for ETH_MACMDIOAR register  *********************************** */
#define ETH_MACMDIOAR_MB_Pos           (0U)
#define ETH_MACMDIOAR_MB_Msk           (0x1UL << ETH_MACMDIOAR_MB_Pos)             /*!< 0x00000001 */
#define ETH_MACMDIOAR_MB               ETH_MACMDIOAR_MB_Msk                        /*!< MII Busy */
#define ETH_MACMDIOAR_C45E_Pos         (1U)
#define ETH_MACMDIOAR_C45E_Msk         (0x1UL << ETH_MACMDIOAR_C45E_Pos)           /*!< 0x00000002 */
#define ETH_MACMDIOAR_C45E             ETH_MACMDIOAR_C45E_Msk                      /*!< Clause 45 PHY Enable */
#define ETH_MACMDIOAR_GOC_Pos          (2U)
#define ETH_MACMDIOAR_GOC_Msk          (0x3UL << ETH_MACMDIOAR_GOC_Pos)            /*!< 0x0000000C */
#define ETH_MACMDIOAR_GOC              ETH_MACMDIOAR_GOC_Msk                       /*!< MII Operation Command */
#define ETH_MACMDIOAR_SKAP_Pos         (4U)
#define ETH_MACMDIOAR_SKAP_Msk         (0x1UL << ETH_MACMDIOAR_SKAP_Pos)           /*!< 0x00000010 */
#define ETH_MACMDIOAR_SKAP             ETH_MACMDIOAR_SKAP_Msk                      /*!< Skip Address Packet */
#define ETH_MACMDIOAR_CR_Pos           (8U)
#define ETH_MACMDIOAR_CR_Msk           (0xFUL << ETH_MACMDIOAR_CR_Pos)             /*!< 0x00000F00 */
#define ETH_MACMDIOAR_CR               ETH_MACMDIOAR_CR_Msk                        /*!< CSR Clock Range */
#define ETH_MACMDIOAR_NTC_Pos          (12U)
#define ETH_MACMDIOAR_NTC_Msk          (0x7UL << ETH_MACMDIOAR_NTC_Pos)            /*!< 0x00007000 */
#define ETH_MACMDIOAR_NTC              ETH_MACMDIOAR_NTC_Msk                       /*!< Number of Training Clocks */
#define ETH_MACMDIOAR_RDA_Pos          (16U)
#define ETH_MACMDIOAR_RDA_Msk          (0x1FUL << ETH_MACMDIOAR_RDA_Pos)           /*!< 0x001F0000 */
#define ETH_MACMDIOAR_RDA              ETH_MACMDIOAR_RDA_Msk                       /*!< Register/Device Address */
#define ETH_MACMDIOAR_PA_Pos           (21U)
#define ETH_MACMDIOAR_PA_Msk           (0x1FUL << ETH_MACMDIOAR_PA_Pos)            /*!< 0x03E00000 */
#define ETH_MACMDIOAR_PA               ETH_MACMDIOAR_PA_Msk                        /*!< Physical Layer Address */
#define ETH_MACMDIOAR_BTB_Pos          (26U)
#define ETH_MACMDIOAR_BTB_Msk          (0x1UL << ETH_MACMDIOAR_BTB_Pos)            /*!< 0x04000000 */
#define ETH_MACMDIOAR_BTB              ETH_MACMDIOAR_BTB_Msk                       /*!< Back to Back transactions */
#define ETH_MACMDIOAR_PSE_Pos          (27U)
#define ETH_MACMDIOAR_PSE_Msk          (0x1UL << ETH_MACMDIOAR_PSE_Pos)            /*!< 0x08000000 */
#define ETH_MACMDIOAR_PSE              ETH_MACMDIOAR_PSE_Msk                       /*!< Preamble Suppression Enable */

