MaJerle/stm32-usart-uart-dma-rx-tx/drivers/CMSIS/Device/ST/STM32C5xx/Include/stm32c593xx.h
/* ***********************************  Bit definition for ETH_MACA3LR register  ************************************ */
#define ETH_MACA3LR_ADDRLO_Pos         (0U)
#define ETH_MACA3LR_ADDRLO_Msk         (0xFFFFFFFFUL << ETH_MACA3LR_ADDRLO_Pos)    /*!< 0xFFFFFFFF */
#define ETH_MACA3LR_ADDRLO             ETH_MACA3LR_ADDRLO_Msk                      /*!< MAC Address x [31:0] */

/* *********************************  Bit definition for ETH_MMC_CONTROL register  ********************************** */
#define ETH_MMC_CONTROL_CNTRST_Pos     (0U)
#define ETH_MMC_CONTROL_CNTRST_Msk     (0x1UL << ETH_MMC_CONTROL_CNTRST_Pos)       /*!< 0x00000001 */
#define ETH_MMC_CONTROL_CNTRST         ETH_MMC_CONTROL_CNTRST_Msk                  /*!< Counters Reset */
#define ETH_MMC_CONTROL_CNTSTOPRO_Pos  (1U)
#define ETH_MMC_CONTROL_CNTSTOPRO_Msk  (0x1UL << ETH_MMC_CONTROL_CNTSTOPRO_Pos)    /*!< 0x00000002 */
#define ETH_MMC_CONTROL_CNTSTOPRO      ETH_MMC_CONTROL_CNTSTOPRO_Msk               /*!< Counter Stop Rollover */
#define ETH_MMC_CONTROL_RSTONRD_Pos    (2U)
#define ETH_MMC_CONTROL_RSTONRD_Msk    (0x1UL << ETH_MMC_CONTROL_RSTONRD_Pos)      /*!< 0x00000004 */
#define ETH_MMC_CONTROL_RSTONRD        ETH_MMC_CONTROL_RSTONRD_Msk                 /*!< Reset on Read */
#define ETH_MMC_CONTROL_CNTFREEZ_Pos   (3U)
#define ETH_MMC_CONTROL_CNTFREEZ_Msk   (0x1UL << ETH_MMC_CONTROL_CNTFREEZ_Pos)     /*!< 0x00000008 */
#define ETH_MMC_CONTROL_CNTFREEZ       ETH_MMC_CONTROL_CNTFREEZ_Msk                /*!< MMC Counter Freeze */
#define ETH_MMC_CONTROL_CNTPRST_Pos    (4U)
#define ETH_MMC_CONTROL_CNTPRST_Msk    (0x1UL << ETH_MMC_CONTROL_CNTPRST_Pos)      /*!< 0x00000010 */
#define ETH_MMC_CONTROL_CNTPRST        ETH_MMC_CONTROL_CNTPRST_Msk                 /*!< Counters Preset */
#define ETH_MMC_CONTROL_CNTPRSTLVL_Pos (5U)
#define ETH_MMC_CONTROL_CNTPRSTLVL_Msk (0x1UL << ETH_MMC_CONTROL_CNTPRSTLVL_Pos)   /*!< 0x00000020 */
#define ETH_MMC_CONTROL_CNTPRSTLVL     ETH_MMC_CONTROL_CNTPRSTLVL_Msk              /*!< Full-Half Preset */
#define ETH_MMC_CONTROL_UCDBC_Pos      (8U)
#define ETH_MMC_CONTROL_UCDBC_Msk      (0x1UL << ETH_MMC_CONTROL_UCDBC_Pos)        /*!< 0x00000100 */
#define ETH_MMC_CONTROL_UCDBC          ETH_MMC_CONTROL_UCDBC_Msk                   /*!< Update MMC Counters for Dropped
                                                                                        Broadcast Packets */

/* *******************************  Bit definition for ETH_MMC_RX_INTERRUPT register  ******************************* */
#define ETH_MMC_RX_INTERRUPT_RXCRCERPIS_Pos                   (5U)
#define ETH_MMC_RX_INTERRUPT_RXCRCERPIS_Msk                   (0x1UL << ETH_MMC_RX_INTERRUPT_RXCRCERPIS_Pos)                     /*!< 0x00000020 */
#define ETH_MMC_RX_INTERRUPT_RXCRCERPIS                       ETH_MMC_RX_INTERRUPT_RXCRCERPIS_Msk                                /*!< MMC Receive CRC Error Packet Counter Interrupt Status */
#define ETH_MMC_RX_INTERRUPT_RXALGNERPIS_Pos                  (6U)
#define ETH_MMC_RX_INTERRUPT_RXALGNERPIS_Msk                  (0x1UL << ETH_MMC_RX_INTERRUPT_RXALGNERPIS_Pos)                    /*!< 0x00000040 */
#define ETH_MMC_RX_INTERRUPT_RXALGNERPIS                      ETH_MMC_RX_INTERRUPT_RXALGNERPIS_Msk                               /*!< MMC Receive Alignment Error Packet Counter Interrupt Status */
#define ETH_MMC_RX_INTERRUPT_RXUCGPIS_Pos                     (17U)
#define ETH_MMC_RX_INTERRUPT_RXUCGPIS_Msk                     (0x1UL << ETH_MMC_RX_INTERRUPT_RXUCGPIS_Pos)                       /*!< 0x00020000 */
#define ETH_MMC_RX_INTERRUPT_RXUCGPIS                         ETH_MMC_RX_INTERRUPT_RXUCGPIS_Msk                                  /*!< MMC Receive Unicast Good Packet Counter Interrupt Status */
#define ETH_MMC_RX_INTERRUPT_RXLPIUSCIS_Pos                   (26U)
#define ETH_MMC_RX_INTERRUPT_RXLPIUSCIS_Msk                   (0x1UL << ETH_MMC_RX_INTERRUPT_RXLPIUSCIS_Pos)                     /*!< 0x04000000 */
#define ETH_MMC_RX_INTERRUPT_RXLPIUSCIS                       ETH_MMC_RX_INTERRUPT_RXLPIUSCIS_Msk                                /*!< MMC Receive LPI microsecond counter interrupt status */
#define ETH_MMC_RX_INTERRUPT_RXLPITRCIS_Pos                   (27U)
#define ETH_MMC_RX_INTERRUPT_RXLPITRCIS_Msk                   (0x1UL << ETH_MMC_RX_INTERRUPT_RXLPITRCIS_Pos)                     /*!< 0x08000000 */
#define ETH_MMC_RX_INTERRUPT_RXLPITRCIS                       ETH_MMC_RX_INTERRUPT_RXLPITRCIS_Msk                                /*!< MMC Receive LPI transition counter interrupt status */

/* *******************************  Bit definition for ETH_MMC_TX_INTERRUPT register  ******************************* */
#define ETH_MMC_TX_INTERRUPT_TXSCOLGPIS_Pos                   (14U)
#define ETH_MMC_TX_INTERRUPT_TXSCOLGPIS_Msk                   (0x1UL << ETH_MMC_TX_INTERRUPT_TXSCOLGPIS_Pos)                     /*!< 0x00004000 */
#define ETH_MMC_TX_INTERRUPT_TXSCOLGPIS                       ETH_MMC_TX_INTERRUPT_TXSCOLGPIS_Msk                                /*!< MMC Transmit Single Collision Good Packet Counter Interrupt Status */
#define ETH_MMC_TX_INTERRUPT_TXMCOLGPIS_Pos                   (15U)
#define ETH_MMC_TX_INTERRUPT_TXMCOLGPIS_Msk                   (0x1UL << ETH_MMC_TX_INTERRUPT_TXMCOLGPIS_Pos)                     /*!< 0x00008000 */
#define ETH_MMC_TX_INTERRUPT_TXMCOLGPIS                       ETH_MMC_TX_INTERRUPT_TXMCOLGPIS_Msk                                /*!< MMC Transmit Multiple Collision Good Packet Counter Interrupt Status */
#define ETH_MMC_TX_INTERRUPT_TXGPKTIS_Pos                     (21U)
#define ETH_MMC_TX_INTERRUPT_TXGPKTIS_Msk                     (0x1UL << ETH_MMC_TX_INTERRUPT_TXGPKTIS_Pos)                       /*!< 0x00200000 */
#define ETH_MMC_TX_INTERRUPT_TXGPKTIS                         ETH_MMC_TX_INTERRUPT_TXGPKTIS_Msk                                  /*!< MMC Transmit Good Packet Counter Interrupt Status */
#define ETH_MMC_TX_INTERRUPT_TXLPIUSCIS_Pos                   (26U)
#define ETH_MMC_TX_INTERRUPT_TXLPIUSCIS_Msk                   (0x1UL << ETH_MMC_TX_INTERRUPT_TXLPIUSCIS_Pos)                     /*!< 0x04000000 */
#define ETH_MMC_TX_INTERRUPT_TXLPIUSCIS                       ETH_MMC_TX_INTERRUPT_TXLPIUSCIS_Msk                                /*!< MMC Transmit LPI microsecond counter interrupt status */
#define ETH_MMC_TX_INTERRUPT_TXLPITRCIS_Pos                   (27U)
#define ETH_MMC_TX_INTERRUPT_TXLPITRCIS_Msk                   (0x1UL << ETH_MMC_TX_INTERRUPT_TXLPITRCIS_Pos)                     /*!< 0x08000000 */
#define ETH_MMC_TX_INTERRUPT_TXLPITRCIS                       ETH_MMC_TX_INTERRUPT_TXLPITRCIS_Msk                                /*!< MMC Transmit LPI transition counter interrupt status */

/* ****************************  Bit definition for ETH_MMC_RX_INTERRUPT_MASK register  ***************************** */
#define ETH_MMC_RX_INTERRUPT_MASK_RXCRCERPIM_Pos              (5U)
#define ETH_MMC_RX_INTERRUPT_MASK_RXCRCERPIM_Msk              (0x1UL << ETH_MMC_RX_INTERRUPT_MASK_RXCRCERPIM_Pos)                /*!< 0x00000020 */
#define ETH_MMC_RX_INTERRUPT_MASK_RXCRCERPIM                  ETH_MMC_RX_INTERRUPT_MASK_RXCRCERPIM_Msk                           /*!< MMC Receive CRC Error Packet Counter Interrupt Mask */
#define ETH_MMC_RX_INTERRUPT_MASK_RXALGNERPIM_Pos             (6U)
#define ETH_MMC_RX_INTERRUPT_MASK_RXALGNERPIM_Msk             (0x1UL << ETH_MMC_RX_INTERRUPT_MASK_RXALGNERPIM_Pos)               /*!< 0x00000040 */
#define ETH_MMC_RX_INTERRUPT_MASK_RXALGNERPIM                 ETH_MMC_RX_INTERRUPT_MASK_RXALGNERPIM_Msk                          /*!< MMC Receive Alignment Error Packet Counter Interrupt Mask */
#define ETH_MMC_RX_INTERRUPT_MASK_RXUCGPIM_Pos                (17U)
#define ETH_MMC_RX_INTERRUPT_MASK_RXUCGPIM_Msk                (0x1UL << ETH_MMC_RX_INTERRUPT_MASK_RXUCGPIM_Pos)                  /*!< 0x00020000 */
#define ETH_MMC_RX_INTERRUPT_MASK_RXUCGPIM                    ETH_MMC_RX_INTERRUPT_MASK_RXUCGPIM_Msk                             /*!< MMC Receive Unicast Good Packet Counter Interrupt Mask */
#define ETH_MMC_RX_INTERRUPT_MASK_RXLPIUSCIM_Pos              (26U)
#define ETH_MMC_RX_INTERRUPT_MASK_RXLPIUSCIM_Msk              (0x1UL << ETH_MMC_RX_INTERRUPT_MASK_RXLPIUSCIM_Pos)                /*!< 0x04000000 */
#define ETH_MMC_RX_INTERRUPT_MASK_RXLPIUSCIM                  ETH_MMC_RX_INTERRUPT_MASK_RXLPIUSCIM_Msk                           /*!< MMC Receive LPI microsecond counter interrupt Mask */
#define ETH_MMC_RX_INTERRUPT_MASK_RXLPITRCIM_Pos              (27U)
#define ETH_MMC_RX_INTERRUPT_MASK_RXLPITRCIM_Msk              (0x1UL << ETH_MMC_RX_INTERRUPT_MASK_RXLPITRCIM_Pos)                /*!< 0x08000000 */
#define ETH_MMC_RX_INTERRUPT_MASK_RXLPITRCIM                  ETH_MMC_RX_INTERRUPT_MASK_RXLPITRCIM_Msk                           /*!< MMC Receive LPI transition counter interrupt Mask */

/* ****************************  Bit definition for ETH_MMC_TX_INTERRUPT_MASK register  ***************************** */
#define ETH_MMC_TX_INTERRUPT_MASK_TXSCOLGPIM_Pos              (14U)
#define ETH_MMC_TX_INTERRUPT_MASK_TXSCOLGPIM_Msk              (0x1UL << ETH_MMC_TX_INTERRUPT_MASK_TXSCOLGPIM_Pos)                /*!< 0x00004000 */
#define ETH_MMC_TX_INTERRUPT_MASK_TXSCOLGPIM                  ETH_MMC_TX_INTERRUPT_MASK_TXSCOLGPIM_Msk                           /*!< MMC Transmit Single Collision Good Packet Counter Interrupt Mask */
#define ETH_MMC_TX_INTERRUPT_MASK_TXMCOLGPIM_Pos              (15U)
#define ETH_MMC_TX_INTERRUPT_MASK_TXMCOLGPIM_Msk              (0x1UL << ETH_MMC_TX_INTERRUPT_MASK_TXMCOLGPIM_Pos)                /*!< 0x00008000 */
#define ETH_MMC_TX_INTERRUPT_MASK_TXMCOLGPIM                  ETH_MMC_TX_INTERRUPT_MASK_TXMCOLGPIM_Msk                           /*!< MMC Transmit Multiple Collision Good Packet Counter Interrupt Mask */
#define ETH_MMC_TX_INTERRUPT_MASK_TXGPKTIM_Pos                (21U)
#define ETH_MMC_TX_INTERRUPT_MASK_TXGPKTIM_Msk                (0x1UL << ETH_MMC_TX_INTERRUPT_MASK_TXGPKTIM_Pos)                  /*!< 0x00200000 */
#define ETH_MMC_TX_INTERRUPT_MASK_TXGPKTIM                    ETH_MMC_TX_INTERRUPT_MASK_TXGPKTIM_Msk                             /*!< MMC Transmit Good Packet Counter Interrupt Mask */
#define ETH_MMC_TX_INTERRUPT_MASK_TXLPIUSCIM_Pos              (26U)
#define ETH_MMC_TX_INTERRUPT_MASK_TXLPIUSCIM_Msk              (0x1UL << ETH_MMC_TX_INTERRUPT_MASK_TXLPIUSCIM_Pos)                /*!< 0x04000000 */
#define ETH_MMC_TX_INTERRUPT_MASK_TXLPIUSCIM                  ETH_MMC_TX_INTERRUPT_MASK_TXLPIUSCIM_Msk                           /*!< MMC Transmit LPI microsecond counter interrupt Mask */
#define ETH_MMC_TX_INTERRUPT_MASK_TXLPITRCIM_Pos              (27U)
#define ETH_MMC_TX_INTERRUPT_MASK_TXLPITRCIM_Msk              (0x1UL << ETH_MMC_TX_INTERRUPT_MASK_TXLPITRCIM_Pos)                /*!< 0x08000000 */
#define ETH_MMC_TX_INTERRUPT_MASK_TXLPITRCIM                  ETH_MMC_TX_INTERRUPT_MASK_TXLPITRCIM_Msk                           /*!< MMC Transmit LPI transition counter interrupt Mask */

/* ***********************  Bit definition for ETH_TX_SINGLE_COLLISION_GOOD_PACKETS register  *********************** */
#define ETH_TX_SINGLE_COLLISION_GOOD_PACKETS_TXSNGLCOLG_Pos   (0U)
#define ETH_TX_SINGLE_COLLISION_GOOD_PACKETS_TXSNGLCOLG_Msk   (0xFFFFFFFFUL << \
                                                              ETH_TX_SINGLE_COLLISION_GOOD_PACKETS_TXSNGLCOLG_Pos)               /*!< 0xFFFFFFFF */
#define ETH_TX_SINGLE_COLLISION_GOOD_PACKETS_TXSNGLCOLG       ETH_TX_SINGLE_COLLISION_GOOD_PACKETS_TXSNGLCOLG_Msk                /*!< Tx Single Collision Good Packets */

/* **********************  Bit definition for ETH_TX_MULTIPLE_COLLISION_GOOD_PACKETS register  ********************** */
#define ETH_TX_MULTIPLE_COLLISION_GOOD_PACKETS_TXMULTCOLG_Pos (0U)
#define ETH_TX_MULTIPLE_COLLISION_GOOD_PACKETS_TXMULTCOLG_Msk (0xFFFFFFFFUL << \
                                                              ETH_TX_MULTIPLE_COLLISION_GOOD_PACKETS_TXMULTCOLG_Pos)             /*!< 0xFFFFFFFF */
#define ETH_TX_MULTIPLE_COLLISION_GOOD_PACKETS_TXMULTCOLG     ETH_TX_MULTIPLE_COLLISION_GOOD_PACKETS_TXMULTCOLG_Msk              /*!< Tx Multiple Collision Good Packets */

/* *****************************  Bit definition for ETH_TX_PACKET_COUNT_GOOD register  ***************************** */
#define ETH_TX_PACKET_COUNT_GOOD_TXPKTG_Pos                   (0U)
#define ETH_TX_PACKET_COUNT_GOOD_TXPKTG_Msk                   (0xFFFFFFFFUL << ETH_TX_PACKET_COUNT_GOOD_TXPKTG_Pos)              /*!< 0xFFFFFFFF */
#define ETH_TX_PACKET_COUNT_GOOD_TXPKTG                       ETH_TX_PACKET_COUNT_GOOD_TXPKTG_Msk                                /*!< Tx Packet Count Good */

/* *****************************  Bit definition for ETH_RX_CRC_ERROR_PACKETS register  ***************************** */
#define ETH_RX_CRC_ERROR_PACKETS_RXCRCERR_Pos                 (0U)
#define ETH_RX_CRC_ERROR_PACKETS_RXCRCERR_Msk                 (0xFFFFFFFFUL << ETH_RX_CRC_ERROR_PACKETS_RXCRCERR_Pos)            /*!< 0xFFFFFFFF */
#define ETH_RX_CRC_ERROR_PACKETS_RXCRCERR                     ETH_RX_CRC_ERROR_PACKETS_RXCRCERR_Msk                              /*!< Rx CRC Error Packets */

