MaJerle/stm32-usart-uart-dma-rx-tx/drivers/CMSIS/Device/ST/STM32C5xx/Include/stm32c593xx.h
/* **********************************  Bit definition for ETH_MACL3A11R register  *********************************** */
#define ETH_MACL3A11R_L3A11_Pos        (0U)
#define ETH_MACL3A11R_L3A11_Msk        (0xFFFFFFFFUL << ETH_MACL3A11R_L3A11_Pos)   /*!< 0xFFFFFFFF */
#define ETH_MACL3A11R_L3A11            ETH_MACL3A11R_L3A11_Msk                     /*!< Layer 3 Address 1 Field */

/* **********************************  Bit definition for ETH_MACL3A21R register  *********************************** */
#define ETH_MACL3A21R_L3A21_Pos        (0U)
#define ETH_MACL3A21R_L3A21_Msk        (0xFFFFFFFFUL << ETH_MACL3A21R_L3A21_Pos)   /*!< 0xFFFFFFFF */
#define ETH_MACL3A21R_L3A21            ETH_MACL3A21R_L3A21_Msk                     /*!< Layer 3 Address 2 Field */

/* **********************************  Bit definition for ETH_MACL3A31R register  *********************************** */
#define ETH_MACL3A31R_L3A31_Pos        (0U)
#define ETH_MACL3A31R_L3A31_Msk        (0xFFFFFFFFUL << ETH_MACL3A31R_L3A31_Pos)   /*!< 0xFFFFFFFF */
#define ETH_MACL3A31R_L3A31            ETH_MACL3A31R_L3A31_Msk                     /*!< Layer 3 Address 3 Field */

/* ***********************************  Bit definition for ETH_MAC_IACR register  *********************************** */
#define ETH_MAC_IACR_OB_Pos            (0U)
#define ETH_MAC_IACR_OB_Msk            (0x1UL << ETH_MAC_IACR_OB_Pos)              /*!< 0x00000001 */
#define ETH_MAC_IACR_OB                ETH_MAC_IACR_OB_Msk                         /*!< Operation Busy. */
#define ETH_MAC_IACR_COM_Pos           (1U)
#define ETH_MAC_IACR_COM_Msk           (0x1UL << ETH_MAC_IACR_COM_Pos)             /*!< 0x00000002 */
#define ETH_MAC_IACR_COM               ETH_MAC_IACR_COM_Msk                        /*!< Command type */
#define ETH_MAC_IACR_AUTO_Pos          (5U)
#define ETH_MAC_IACR_AUTO_Msk          (0x1UL << ETH_MAC_IACR_AUTO_Pos)            /*!< 0x00000020 */
#define ETH_MAC_IACR_AUTO              ETH_MAC_IACR_AUTO_Msk                       /*!< Auto-increment */
#define ETH_MAC_IACR_AOFF_Pos          (8U)
#define ETH_MAC_IACR_AOFF_Msk          (0xFFUL << ETH_MAC_IACR_AOFF_Pos)           /*!< 0x0000FF00 */
#define ETH_MAC_IACR_AOFF              ETH_MAC_IACR_AOFF_Msk                       /*!< Address Offset */
#define ETH_MAC_IACR_MSEL_Pos          (16U)
#define ETH_MAC_IACR_MSEL_Msk          (0xFUL << ETH_MAC_IACR_MSEL_Pos)            /*!< 0x000F0000 */
#define ETH_MAC_IACR_MSEL              ETH_MAC_IACR_MSEL_Msk                       /*!< Mode Select */

/* **********************************  Bit definition for ETH_MAC_TMRQR register  *********************************** */
#define ETH_MAC_TMRQR_TYP_Pos          (0U)
#define ETH_MAC_TMRQR_TYP_Msk          (0xFFFFUL << ETH_MAC_TMRQR_TYP_Pos)         /*!< 0x0000FFFF */
#define ETH_MAC_TMRQR_TYP              ETH_MAC_TMRQR_TYP_Msk                       /*!< Type field Value */
#define ETH_MAC_TMRQR_TMRQ_Pos         (16U)
#define ETH_MAC_TMRQR_TMRQ_Msk         (0x7UL << ETH_MAC_TMRQR_TMRQ_Pos)           /*!< 0x00070000 */
#define ETH_MAC_TMRQR_TMRQ             ETH_MAC_TMRQR_TMRQ_Msk                      /*!< Type Match Rx Queue Number */

/* ***********************************  Bit definition for ETH_MACTSCR register  ************************************ */
#define ETH_MACTSCR_TSENA_Pos          (0U)
#define ETH_MACTSCR_TSENA_Msk          (0x1UL << ETH_MACTSCR_TSENA_Pos)            /*!< 0x00000001 */
#define ETH_MACTSCR_TSENA              ETH_MACTSCR_TSENA_Msk                       /*!< Enable Timestamp */
#define ETH_MACTSCR_TSCFUPDT_Pos       (1U)
#define ETH_MACTSCR_TSCFUPDT_Msk       (0x1UL << ETH_MACTSCR_TSCFUPDT_Pos)         /*!< 0x00000002 */
#define ETH_MACTSCR_TSCFUPDT           ETH_MACTSCR_TSCFUPDT_Msk                    /*!< Fine or Coarse Timestamp Update
                                                                                        */
#define ETH_MACTSCR_TSINIT_Pos         (2U)
#define ETH_MACTSCR_TSINIT_Msk         (0x1UL << ETH_MACTSCR_TSINIT_Pos)           /*!< 0x00000004 */
#define ETH_MACTSCR_TSINIT             ETH_MACTSCR_TSINIT_Msk                      /*!< Initialize Timestamp */
#define ETH_MACTSCR_TSUPDT_Pos         (3U)
#define ETH_MACTSCR_TSUPDT_Msk         (0x1UL << ETH_MACTSCR_TSUPDT_Pos)           /*!< 0x00000008 */
#define ETH_MACTSCR_TSUPDT             ETH_MACTSCR_TSUPDT_Msk                      /*!< Update Timestamp */
#define ETH_MACTSCR_TSADDREG_Pos       (5U)
#define ETH_MACTSCR_TSADDREG_Msk       (0x1UL << ETH_MACTSCR_TSADDREG_Pos)         /*!< 0x00000020 */
#define ETH_MACTSCR_TSADDREG           ETH_MACTSCR_TSADDREG_Msk                    /*!< Update Addend Register */
#define ETH_MACTSCR_PTGE_Pos           (6U)
#define ETH_MACTSCR_PTGE_Msk           (0x1UL << ETH_MACTSCR_PTGE_Pos)             /*!< 0x00000040 */
#define ETH_MACTSCR_PTGE               ETH_MACTSCR_PTGE_Msk                        /*!< Presentation Time Generation
                                                                                        Enable */
#define ETH_MACTSCR_TSENALL_Pos        (8U)
#define ETH_MACTSCR_TSENALL_Msk        (0x1UL << ETH_MACTSCR_TSENALL_Pos)          /*!< 0x00000100 */
#define ETH_MACTSCR_TSENALL            ETH_MACTSCR_TSENALL_Msk                     /*!< Enable Timestamp for All Packets
                                                                                        */
#define ETH_MACTSCR_TSCTRLSSR_Pos      (9U)
#define ETH_MACTSCR_TSCTRLSSR_Msk      (0x1UL << ETH_MACTSCR_TSCTRLSSR_Pos)        /*!< 0x00000200 */
#define ETH_MACTSCR_TSCTRLSSR          ETH_MACTSCR_TSCTRLSSR_Msk                   /*!< Timestamp Digital or Binary
                                                                                        Rollover Control */
#define ETH_MACTSCR_TSVER2ENA_Pos      (10U)
#define ETH_MACTSCR_TSVER2ENA_Msk      (0x1UL << ETH_MACTSCR_TSVER2ENA_Pos)        /*!< 0x00000400 */
#define ETH_MACTSCR_TSVER2ENA          ETH_MACTSCR_TSVER2ENA_Msk                   /*!< Enable PTP Packet Processing for
                                                                                        Version 2 Format */
#define ETH_MACTSCR_TSIPENA_Pos        (11U)
#define ETH_MACTSCR_TSIPENA_Msk        (0x1UL << ETH_MACTSCR_TSIPENA_Pos)          /*!< 0x00000800 */
#define ETH_MACTSCR_TSIPENA            ETH_MACTSCR_TSIPENA_Msk                     /*!< Enable Processing of PTP over
                                                                                        Ethernet Packets */
#define ETH_MACTSCR_TSIPV6ENA_Pos      (12U)
#define ETH_MACTSCR_TSIPV6ENA_Msk      (0x1UL << ETH_MACTSCR_TSIPV6ENA_Pos)        /*!< 0x00001000 */
#define ETH_MACTSCR_TSIPV6ENA          ETH_MACTSCR_TSIPV6ENA_Msk                   /*!< Enable Processing of PTP Packets
                                                                                        Sent over IPv6-UDP */
#define ETH_MACTSCR_TSIPV4ENA_Pos      (13U)
#define ETH_MACTSCR_TSIPV4ENA_Msk      (0x1UL << ETH_MACTSCR_TSIPV4ENA_Pos)        /*!< 0x00002000 */
#define ETH_MACTSCR_TSIPV4ENA          ETH_MACTSCR_TSIPV4ENA_Msk                   /*!< Enable Processing of PTP Packets
                                                                                        Sent over IPv4-UDP */
#define ETH_MACTSCR_TSEVNTENA_Pos      (14U)
#define ETH_MACTSCR_TSEVNTENA_Msk      (0x1UL << ETH_MACTSCR_TSEVNTENA_Pos)        /*!< 0x00004000 */
#define ETH_MACTSCR_TSEVNTENA          ETH_MACTSCR_TSEVNTENA_Msk                   /*!< Enable Timestamp Snapshot for
                                                                                        Event Messages */
#define ETH_MACTSCR_TSMSTRENA_Pos      (15U)
#define ETH_MACTSCR_TSMSTRENA_Msk      (0x1UL << ETH_MACTSCR_TSMSTRENA_Pos)        /*!< 0x00008000 */
#define ETH_MACTSCR_TSMSTRENA          ETH_MACTSCR_TSMSTRENA_Msk                   /*!< Enable Snapshot for Messages
                                                                                        Relevant to Master */
#define ETH_MACTSCR_SNAPTYPSEL_Pos     (16U)
#define ETH_MACTSCR_SNAPTYPSEL_Msk     (0x3UL << ETH_MACTSCR_SNAPTYPSEL_Pos)       /*!< 0x00030000 */
#define ETH_MACTSCR_SNAPTYPSEL         ETH_MACTSCR_SNAPTYPSEL_Msk                  /*!< Select PTP packets for Taking
                                                                                        Snapshots */
#define ETH_MACTSCR_TSENMACADDR_Pos    (18U)
#define ETH_MACTSCR_TSENMACADDR_Msk    (0x1UL << ETH_MACTSCR_TSENMACADDR_Pos)      /*!< 0x00040000 */
#define ETH_MACTSCR_TSENMACADDR        ETH_MACTSCR_TSENMACADDR_Msk                 /*!< Enable MAC Address for PTP
                                                                                        Packet Filtering */
#define ETH_MACTSCR_TXTSSTSM_Pos       (24U)
#define ETH_MACTSCR_TXTSSTSM_Msk       (0x1UL << ETH_MACTSCR_TXTSSTSM_Pos)         /*!< 0x01000000 */
#define ETH_MACTSCR_TXTSSTSM           ETH_MACTSCR_TXTSSTSM_Msk                    /*!< Transmit Timestamp Status Mode
                                                                                        */
#define ETH_MACTSCR_EPCSL_Pos          (25U)
#define ETH_MACTSCR_EPCSL_Msk          (0x1UL << ETH_MACTSCR_EPCSL_Pos)            /*!< 0x02000000 */
#define ETH_MACTSCR_EPCSL              ETH_MACTSCR_EPCSL_Msk                       /*!< Enable PCS latencies */
#define ETH_MACTSCR_ECPD_Pos           (26U)
#define ETH_MACTSCR_ECPD_Msk           (0x1UL << ETH_MACTSCR_ECPD_Pos)             /*!< 0x04000000 */
#define ETH_MACTSCR_ECPD               ETH_MACTSCR_ECPD_Msk                        /*!< Enable Timestamp Capturing in
                                                                                        PTP Clock Domain */
#define ETH_MACTSCR_LITA_Pos           (27U)
#define ETH_MACTSCR_LITA_Msk           (0x1UL << ETH_MACTSCR_LITA_Pos)             /*!< 0x08000000 */
#define ETH_MACTSCR_LITA               ETH_MACTSCR_LITA_Msk                        /*!< Latency Input Based Timestamp
                                                                                        Accuracy Disable */
#define ETH_MACTSCR_AV8021ASMEN_Pos    (28U)
#define ETH_MACTSCR_AV8021ASMEN_Msk    (0x1UL << ETH_MACTSCR_AV8021ASMEN_Pos)      /*!< 0x10000000 */
#define ETH_MACTSCR_AV8021ASMEN        ETH_MACTSCR_AV8021ASMEN_Msk                 /*!< AV 802.1AS Mode Enable */

/* ***********************************  Bit definition for ETH_MACSSIR register  ************************************ */
#define ETH_MACSSIR_SSINC_Pos          (16U)
#define ETH_MACSSIR_SSINC_Msk          (0xFFUL << ETH_MACSSIR_SSINC_Pos)           /*!< 0x00FF0000 */
#define ETH_MACSSIR_SSINC              ETH_MACSSIR_SSINC_Msk                       /*!< Subsecond Increment Value */

/* ***********************************  Bit definition for ETH_MACSTSR register  ************************************ */
#define ETH_MACSTSR_TSS_Pos            (0U)
#define ETH_MACSTSR_TSS_Msk            (0xFFFFFFFFUL << ETH_MACSTSR_TSS_Pos)       /*!< 0xFFFFFFFF */
#define ETH_MACSTSR_TSS                ETH_MACSTSR_TSS_Msk                         /*!< Timestamp Second */

/* ***********************************  Bit definition for ETH_MACSTNR register  ************************************ */
#define ETH_MACSTNR_TSSS_Pos           (0U)
#define ETH_MACSTNR_TSSS_Msk           (0x7FFFFFFFUL << ETH_MACSTNR_TSSS_Pos)      /*!< 0x7FFFFFFF */
#define ETH_MACSTNR_TSSS               ETH_MACSTNR_TSSS_Msk                        /*!< Timestamp subseconds */

/* ***********************************  Bit definition for ETH_MACSTSUR register  *********************************** */
#define ETH_MACSTSUR_TSS_Pos           (0U)
#define ETH_MACSTSUR_TSS_Msk           (0xFFFFFFFFUL << ETH_MACSTSUR_TSS_Pos)      /*!< 0xFFFFFFFF */
#define ETH_MACSTSUR_TSS               ETH_MACSTSUR_TSS_Msk                        /*!< Timestamp Seconds */

/* ***********************************  Bit definition for ETH_MACSTNUR register  *********************************** */
#define ETH_MACSTNUR_TSSS_Pos          (0U)
#define ETH_MACSTNUR_TSSS_Msk          (0x7FFFFFFFUL << ETH_MACSTNUR_TSSS_Pos)     /*!< 0x7FFFFFFF */
#define ETH_MACSTNUR_TSSS              ETH_MACSTNUR_TSSS_Msk                       /*!< Timestamp subseconds */
#define ETH_MACSTNUR_ADDSUB_Pos        (31U)
#define ETH_MACSTNUR_ADDSUB_Msk        (0x1UL << ETH_MACSTNUR_ADDSUB_Pos)          /*!< 0x80000000 */
#define ETH_MACSTNUR_ADDSUB            ETH_MACSTNUR_ADDSUB_Msk                     /*!< Add or Subtract Time */

/* ***********************************  Bit definition for ETH_MACTSAR register  ************************************ */
#define ETH_MACTSAR_TSAR_Pos           (0U)
#define ETH_MACTSAR_TSAR_Msk           (0xFFFFFFFFUL << ETH_MACTSAR_TSAR_Pos)      /*!< 0xFFFFFFFF */
#define ETH_MACTSAR_TSAR               ETH_MACTSAR_TSAR_Msk                        /*!< Timestamp Addend Register */

/* ***********************************  Bit definition for ETH_MACTSSR register  ************************************ */
#define ETH_MACTSSR_TSSOVF_Pos         (0U)
#define ETH_MACTSSR_TSSOVF_Msk         (0x1UL << ETH_MACTSSR_TSSOVF_Pos)           /*!< 0x00000001 */
#define ETH_MACTSSR_TSSOVF             ETH_MACTSSR_TSSOVF_Msk                      /*!< Timestamp Seconds Overflow */
#define ETH_MACTSSR_TSTARGT0_Pos       (1U)
#define ETH_MACTSSR_TSTARGT0_Msk       (0x1UL << ETH_MACTSSR_TSTARGT0_Pos)         /*!< 0x00000002 */
#define ETH_MACTSSR_TSTARGT0           ETH_MACTSSR_TSTARGT0_Msk                    /*!< Timestamp Target Time Reached */
#define ETH_MACTSSR_AUXTSTRIG_Pos      (2U)
#define ETH_MACTSSR_AUXTSTRIG_Msk      (0x1UL << ETH_MACTSSR_AUXTSTRIG_Pos)        /*!< 0x00000004 */
#define ETH_MACTSSR_AUXTSTRIG          ETH_MACTSSR_AUXTSTRIG_Msk                   /*!< Auxiliary Timestamp Trigger
                                                                                        Snapshot */
#define ETH_MACTSSR_TSTRGTERR0_Pos     (3U)
#define ETH_MACTSSR_TSTRGTERR0_Msk     (0x1UL << ETH_MACTSSR_TSTRGTERR0_Pos)       /*!< 0x00000008 */
#define ETH_MACTSSR_TSTRGTERR0         ETH_MACTSSR_TSTRGTERR0_Msk                  /*!< Timestamp Target Time Error */
#define ETH_MACTSSR_TXTSSIS_Pos        (15U)
#define ETH_MACTSSR_TXTSSIS_Msk        (0x1UL << ETH_MACTSSR_TXTSSIS_Pos)          /*!< 0x00008000 */
#define ETH_MACTSSR_TXTSSIS            ETH_MACTSSR_TXTSSIS_Msk                     /*!< Tx Timestamp Status Interrupt
                                                                                        Status */
#define ETH_MACTSSR_ATSSTN_Pos         (16U)
#define ETH_MACTSSR_ATSSTN_Msk         (0xFUL << ETH_MACTSSR_ATSSTN_Pos)           /*!< 0x000F0000 */
#define ETH_MACTSSR_ATSSTN             ETH_MACTSSR_ATSSTN_Msk                      /*!< Auxiliary Timestamp Snapshot
                                                                                        Trigger Identifier */
#define ETH_MACTSSR_ATSSTM_Pos         (24U)
#define ETH_MACTSSR_ATSSTM_Msk         (0x1UL << ETH_MACTSSR_ATSSTM_Pos)           /*!< 0x01000000 */
#define ETH_MACTSSR_ATSSTM             ETH_MACTSSR_ATSSTM_Msk                      /*!< Auxiliary Timestamp Snapshot
                                                                                        Trigger Missed */
#define ETH_MACTSSR_ATSNS_Pos          (25U)
#define ETH_MACTSSR_ATSNS_Msk          (0x1FUL << ETH_MACTSSR_ATSNS_Pos)           /*!< 0x3E000000 */
#define ETH_MACTSSR_ATSNS              ETH_MACTSSR_ATSNS_Msk                       /*!< Number of Auxiliary Timestamp
                                                                                        Snapshots */

/* ***********************************  Bit definition for ETH_MACRXDTI register  *********************************** */
#define ETH_MACRXDTI_RXNS_Pos          (16U)
#define ETH_MACRXDTI_RXNS_Msk          (0xFFFFUL << ETH_MACRXDTI_RXNS_Pos)         /*!< 0xFFFF0000 */
#define ETH_MACRXDTI_RXNS              ETH_MACRXDTI_RXNS_Msk                       /*!< Receive domain time increment
                                                                                        value in nanoseconds */

/* ***********************************  Bit definition for ETH_MACTXDTI register  *********************************** */
#define ETH_MACTXDTI_TXNS_Pos          (16U)
#define ETH_MACTXDTI_TXNS_Msk          (0xFFFFUL << ETH_MACTXDTI_TXNS_Pos)         /*!< 0xFFFF0000 */
#define ETH_MACTXDTI_TXNS              ETH_MACTXDTI_TXNS_Msk                       /*!< Transmit domain time increment
                                                                                        value in nanoseconds */

/* **********************************  Bit definition for ETH_MACTXTSSNR register  ********************************** */
#define ETH_MACTXTSSNR_TXTSSLO_Pos     (0U)
#define ETH_MACTXTSSNR_TXTSSLO_Msk     (0x7FFFFFFFUL << \
                                       ETH_MACTXTSSNR_TXTSSLO_Pos)                 /*!< 0x7FFFFFFF */
#define ETH_MACTXTSSNR_TXTSSLO         ETH_MACTXTSSNR_TXTSSLO_Msk                  /*!< Transmit Timestamp Status Low */
#define ETH_MACTXTSSNR_TXTSSMIS_Pos    (31U)
#define ETH_MACTXTSSNR_TXTSSMIS_Msk    (0x1UL << ETH_MACTXTSSNR_TXTSSMIS_Pos)      /*!< 0x80000000 */
#define ETH_MACTXTSSNR_TXTSSMIS        ETH_MACTXTSSNR_TXTSSMIS_Msk                 /*!< Transmit Timestamp Status Missed
                                                                                        */

/* **********************************  Bit definition for ETH_MACTXTSSSR register  ********************************** */
#define ETH_MACTXTSSSR_TXTSSHI_Pos     (0U)
#define ETH_MACTXTSSSR_TXTSSHI_Msk     (0xFFFFFFFFUL << \
                                       ETH_MACTXTSSSR_TXTSSHI_Pos)                 /*!< 0xFFFFFFFF */
#define ETH_MACTXTSSSR_TXTSSHI         ETH_MACTXTSSSR_TXTSSHI_Msk                  /*!< Transmit Timestamp Status High
                                                                                        */

/* ************************************  Bit definition for ETH_MACACR register  ************************************ */
#define ETH_MACACR_ATSFC_Pos           (0U)
#define ETH_MACACR_ATSFC_Msk           (0x1UL << ETH_MACACR_ATSFC_Pos)             /*!< 0x00000001 */
#define ETH_MACACR_ATSFC               ETH_MACACR_ATSFC_Msk                        /*!< Auxiliary Snapshot FIFO Clear */
#define ETH_MACACR_ATSEN0_Pos          (4U)
#define ETH_MACACR_ATSEN0_Msk          (0x1UL << ETH_MACACR_ATSEN0_Pos)            /*!< 0x00000010 */
#define ETH_MACACR_ATSEN0              ETH_MACACR_ATSEN0_Msk                       /*!< Auxiliary Snapshot 0 Enable */
#define ETH_MACACR_ATSEN1_Pos          (5U)
#define ETH_MACACR_ATSEN1_Msk          (0x1UL << ETH_MACACR_ATSEN1_Pos)            /*!< 0x00000020 */
#define ETH_MACACR_ATSEN1              ETH_MACACR_ATSEN1_Msk                       /*!< Auxiliary Snapshot 1 Enable */
#define ETH_MACACR_ATSEN2_Pos          (6U)
#define ETH_MACACR_ATSEN2_Msk          (0x1UL << ETH_MACACR_ATSEN2_Pos)            /*!< 0x00000040 */
#define ETH_MACACR_ATSEN2              ETH_MACACR_ATSEN2_Msk                       /*!< Auxiliary Snapshot 2 Enable */
#define ETH_MACACR_ATSEN3_Pos          (7U)
#define ETH_MACACR_ATSEN3_Msk          (0x1UL << ETH_MACACR_ATSEN3_Pos)            /*!< 0x00000080 */
#define ETH_MACACR_ATSEN3              ETH_MACACR_ATSEN3_Msk                       /*!< Auxiliary Snapshot 3 Enable */

/* ***********************************  Bit definition for ETH_MACATSNR register  *********************************** */
#define ETH_MACATSNR_AUXTSLO_Pos       (0U)
#define ETH_MACATSNR_AUXTSLO_Msk       (0x7FFFFFFFUL << ETH_MACATSNR_AUXTSLO_Pos)  /*!< 0x7FFFFFFF */
#define ETH_MACATSNR_AUXTSLO           ETH_MACATSNR_AUXTSLO_Msk                    /*!< Auxiliary Timestamp */

