MaJerle/stm32-usart-uart-dma-rx-tx/drivers/CMSIS/Device/ST/STM32C5xx/Include/stm32c593xx.h
/* **********************************  Bit definition for ETH_DMACRXDLAR register  ********************************** */
#define ETH_DMACRXDLAR_RDESLA_Pos      (0U)
#define ETH_DMACRXDLAR_RDESLA_Msk      (0xFFFFFFFFUL << ETH_DMACRXDLAR_RDESLA_Pos) /*!< 0xFFFFFFFF */
#define ETH_DMACRXDLAR_RDESLA          ETH_DMACRXDLAR_RDESLA_Msk                   /*!< Start of Receive List */

/* **********************************  Bit definition for ETH_DMACTXDTPR register  ********************************** */
#define ETH_DMACTXDTPR_TDT_Pos         (0U)
#define ETH_DMACTXDTPR_TDT_Msk         (0xFFFFFFFFUL << ETH_DMACTXDTPR_TDT_Pos)    /*!< 0xFFFFFFFF */
#define ETH_DMACTXDTPR_TDT             ETH_DMACTXDTPR_TDT_Msk                      /*!< Transmit Descriptor Tail Pointer
                                                                                        */

/* **********************************  Bit definition for ETH_DMACRXDTPR register  ********************************** */
#define ETH_DMACRXDTPR_RDT_Pos         (0U)
#define ETH_DMACRXDTPR_RDT_Msk         (0xFFFFFFFFUL << ETH_DMACRXDTPR_RDT_Pos)    /*!< 0xFFFFFFFF */
#define ETH_DMACRXDTPR_RDT             ETH_DMACRXDTPR_RDT_Msk                      /*!< Receive Descriptor Tail Pointer
                                                                                        */

/* **********************************  Bit definition for ETH_DMACTXRLR register  *********************************** */
#define ETH_DMACTXRLR_TDRL_Pos         (0U)
#define ETH_DMACTXRLR_TDRL_Msk         (0x3FFUL << ETH_DMACTXRLR_TDRL_Pos)         /*!< 0x000003FF */
#define ETH_DMACTXRLR_TDRL             ETH_DMACTXRLR_TDRL_Msk                      /*!< Transmit Descriptor Ring Length
                                                                                        */

/* **********************************  Bit definition for ETH_DMACRXRLR register  *********************************** */
#define ETH_DMACRXRLR_RDRL_Pos         (0U)
#define ETH_DMACRXRLR_RDRL_Msk         (0x3FFUL << ETH_DMACRXRLR_RDRL_Pos)         /*!< 0x000003FF */
#define ETH_DMACRXRLR_RDRL             ETH_DMACRXRLR_RDRL_Msk                      /*!< Receive Descriptor Ring Length
                                                                                        */
#define ETH_DMACRXRLR_ARBS_Pos         (16U)
#define ETH_DMACRXRLR_ARBS_Msk         (0xFFUL << ETH_DMACRXRLR_ARBS_Pos)          /*!< 0x00FF0000 */
#define ETH_DMACRXRLR_ARBS             ETH_DMACRXRLR_ARBS_Msk                      /*!< Alternate Receive Buffer Size */

/* ***********************************  Bit definition for ETH_DMACIER register  ************************************ */
#define ETH_DMACIER_TIE_Pos            (0U)
#define ETH_DMACIER_TIE_Msk            (0x1UL << ETH_DMACIER_TIE_Pos)              /*!< 0x00000001 */
#define ETH_DMACIER_TIE                ETH_DMACIER_TIE_Msk                         /*!< Transmit Interrupt Enable */
#define ETH_DMACIER_TXSE_Pos           (1U)
#define ETH_DMACIER_TXSE_Msk           (0x1UL << ETH_DMACIER_TXSE_Pos)             /*!< 0x00000002 */
#define ETH_DMACIER_TXSE               ETH_DMACIER_TXSE_Msk                        /*!< Transmit Stopped Enable */
#define ETH_DMACIER_TBUE_Pos           (2U)
#define ETH_DMACIER_TBUE_Msk           (0x1UL << ETH_DMACIER_TBUE_Pos)             /*!< 0x00000004 */
#define ETH_DMACIER_TBUE               ETH_DMACIER_TBUE_Msk                        /*!< Transmit Buffer Unavailable
                                                                                        Enable */
#define ETH_DMACIER_RIE_Pos            (6U)
#define ETH_DMACIER_RIE_Msk            (0x1UL << ETH_DMACIER_RIE_Pos)              /*!< 0x00000040 */
#define ETH_DMACIER_RIE                ETH_DMACIER_RIE_Msk                         /*!< Receive Interrupt Enable */
#define ETH_DMACIER_RBUE_Pos           (7U)
#define ETH_DMACIER_RBUE_Msk           (0x1UL << ETH_DMACIER_RBUE_Pos)             /*!< 0x00000080 */
#define ETH_DMACIER_RBUE               ETH_DMACIER_RBUE_Msk                        /*!< Receive Buffer Unavailable
                                                                                        Enable */
#define ETH_DMACIER_RSE_Pos            (8U)
#define ETH_DMACIER_RSE_Msk            (0x1UL << ETH_DMACIER_RSE_Pos)              /*!< 0x00000100 */
#define ETH_DMACIER_RSE                ETH_DMACIER_RSE_Msk                         /*!< Receive Stopped Enable */
#define ETH_DMACIER_RWTE_Pos           (9U)
#define ETH_DMACIER_RWTE_Msk           (0x1UL << ETH_DMACIER_RWTE_Pos)             /*!< 0x00000200 */
#define ETH_DMACIER_RWTE               ETH_DMACIER_RWTE_Msk                        /*!< Receive Watchdog Timeout Enable
                                                                                        */
#define ETH_DMACIER_ETIE_Pos           (10U)
#define ETH_DMACIER_ETIE_Msk           (0x1UL << ETH_DMACIER_ETIE_Pos)             /*!< 0x00000400 */
#define ETH_DMACIER_ETIE               ETH_DMACIER_ETIE_Msk                        /*!< Early Transmit Interrupt Enable
                                                                                        */
#define ETH_DMACIER_ERIE_Pos           (11U)
#define ETH_DMACIER_ERIE_Msk           (0x1UL << ETH_DMACIER_ERIE_Pos)             /*!< 0x00000800 */
#define ETH_DMACIER_ERIE               ETH_DMACIER_ERIE_Msk                        /*!< Early receive interrupt Enable
                                                                                        */
#define ETH_DMACIER_FBEE_Pos           (12U)
#define ETH_DMACIER_FBEE_Msk           (0x1UL << ETH_DMACIER_FBEE_Pos)             /*!< 0x00001000 */
#define ETH_DMACIER_FBEE               ETH_DMACIER_FBEE_Msk                        /*!< Fatal Bus Error Enable */
#define ETH_DMACIER_CDEE_Pos           (13U)
#define ETH_DMACIER_CDEE_Msk           (0x1UL << ETH_DMACIER_CDEE_Pos)             /*!< 0x00002000 */
#define ETH_DMACIER_CDEE               ETH_DMACIER_CDEE_Msk                        /*!< Context Descriptor Error Enable
                                                                                        */
#define ETH_DMACIER_AIE_Pos            (14U)
#define ETH_DMACIER_AIE_Msk            (0x1UL << ETH_DMACIER_AIE_Pos)              /*!< 0x00004000 */
#define ETH_DMACIER_AIE                ETH_DMACIER_AIE_Msk                         /*!< Abnormal Interrupt Summary
                                                                                        Enable */
#define ETH_DMACIER_NIE_Pos            (15U)
#define ETH_DMACIER_NIE_Msk            (0x1UL << ETH_DMACIER_NIE_Pos)              /*!< 0x00008000 */
#define ETH_DMACIER_NIE                ETH_DMACIER_NIE_Msk                         /*!< Normal Interrupt Summary Enable
                                                                                        */

/* **********************************  Bit definition for ETH_DMACRXIWTR register  ********************************** */
#define ETH_DMACRXIWTR_RWT_Pos         (0U)
#define ETH_DMACRXIWTR_RWT_Msk         (0xFFUL << ETH_DMACRXIWTR_RWT_Pos)          /*!< 0x000000FF */
#define ETH_DMACRXIWTR_RWT             ETH_DMACRXIWTR_RWT_Msk                      /*!< Receive Interrupt Watchdog Timer
                                                                                        Count */
#define ETH_DMACRXIWTR_ITW_Pos         (8U)
#define ETH_DMACRXIWTR_ITW_Msk         (0x1FUL << ETH_DMACRXIWTR_ITW_Pos)          /*!< 0x00001F00 */
#define ETH_DMACRXIWTR_ITW             ETH_DMACRXIWTR_ITW_Msk                      /*!< Rx Idle Timer Window */
#define ETH_DMACRXIWTR_RWTU_Pos        (16U)
#define ETH_DMACRXIWTR_RWTU_Msk        (0x3UL << ETH_DMACRXIWTR_RWTU_Pos)          /*!< 0x00030000 */
#define ETH_DMACRXIWTR_RWTU            ETH_DMACRXIWTR_RWTU_Msk                     /*!< Receive Interrupt Watchdog Timer
                                                                                        Count Units */
#define ETH_DMACRXIWTR_ITCU_Pos        (18U)
#define ETH_DMACRXIWTR_ITCU_Msk        (0x3UL << ETH_DMACRXIWTR_ITCU_Pos)          /*!< 0x000C0000 */
#define ETH_DMACRXIWTR_ITCU            ETH_DMACRXIWTR_ITCU_Msk                     /*!< Rx Idle Timer Count Units */
#define ETH_DMACRXIWTR_RBCT_Pos        (20U)
#define ETH_DMACRXIWTR_RBCT_Msk        (0x3FFUL << ETH_DMACRXIWTR_RBCT_Pos)        /*!< 0x3FF00000 */
#define ETH_DMACRXIWTR_RBCT            ETH_DMACRXIWTR_RBCT_Msk                     /*!< Receive Byte Count Threshold */
#define ETH_DMACRXIWTR_PSEL_Pos        (31U)
#define ETH_DMACRXIWTR_PSEL_Msk        (0x1UL << ETH_DMACRXIWTR_PSEL_Pos)          /*!< 0x80000000 */
#define ETH_DMACRXIWTR_PSEL            ETH_DMACRXIWTR_PSEL_Msk                     /*!< Packet Count Interrupt Select */

/* **********************************  Bit definition for ETH_DMACCATXDR register  ********************************** */
#define ETH_DMACCATXDR_CURTDESAPTR_Pos (0U)
#define ETH_DMACCATXDR_CURTDESAPTR_Msk (0xFFFFFFFFUL << \
                                       ETH_DMACCATXDR_CURTDESAPTR_Pos)             /*!< 0xFFFFFFFF */
#define ETH_DMACCATXDR_CURTDESAPTR     ETH_DMACCATXDR_CURTDESAPTR_Msk              /*!< Application Transmit Descriptor
                                                                                        Address Pointer */

