MaJerle/stm32-usart-uart-dma-rx-tx/drivers/CMSIS/Device/ST/STM32C5xx/Include/stm32c593xx.h
/* ************************************  Bit definition for EXTI_EMR2 register  ************************************* */
#define EXTI_EMR2_EM32_Pos        (0U)
#define EXTI_EMR2_EM32_Msk        (0x1UL << EXTI_EMR2_EM32_Pos)          /*!< 0x00000001 */
#define EXTI_EMR2_EM32            EXTI_EMR2_EM32_Msk                     /*!< CPU wake-up with event generation mask on
                                                                              event input 32 */
#define EXTI_EMR2_EM33_Pos        (1U)
#define EXTI_EMR2_EM33_Msk        (0x1UL << EXTI_EMR2_EM33_Pos)          /*!< 0x00000002 */
#define EXTI_EMR2_EM33            EXTI_EMR2_EM33_Msk                     /*!< CPU wake-up with event generation mask on
                                                                              event input 33 */
#define EXTI_EMR2_EM34_Pos        (2U)
#define EXTI_EMR2_EM34_Msk        (0x1UL << EXTI_EMR2_EM34_Pos)          /*!< 0x00000004 */
#define EXTI_EMR2_EM34            EXTI_EMR2_EM34_Msk                     /*!< CPU wake-up with event generation mask on
                                                                              event input 34 */
#define EXTI_EMR2_EM35_Pos        (3U)
#define EXTI_EMR2_EM35_Msk        (0x1UL << EXTI_EMR2_EM35_Pos)          /*!< 0x00000008 */
#define EXTI_EMR2_EM35            EXTI_EMR2_EM35_Msk                     /*!< CPU wake-up with event generation mask on
                                                                              event input 35 */
#define EXTI_EMR2_EM37_Pos        (5U)
#define EXTI_EMR2_EM37_Msk        (0x1UL << EXTI_EMR2_EM37_Pos)          /*!< 0x00000020 */
#define EXTI_EMR2_EM37            EXTI_EMR2_EM37_Msk                     /*!< CPU wake-up with event generation mask on
                                                                              event input 37 */
#define EXTI_EMR2_EM38_Pos        (6U)
#define EXTI_EMR2_EM38_Msk        (0x1UL << EXTI_EMR2_EM38_Pos)          /*!< 0x00000040 */
#define EXTI_EMR2_EM38            EXTI_EMR2_EM38_Msk                     /*!< CPU wake-up with event generation mask on
                                                                              event input 38 */
#define EXTI_EMR2_EM39_Pos        (7U)
#define EXTI_EMR2_EM39_Msk        (0x1UL << EXTI_EMR2_EM39_Pos)          /*!< 0x00000080 */
#define EXTI_EMR2_EM39            EXTI_EMR2_EM39_Msk                     /*!< CPU wake-up with event generation mask on
                                                                              event input 39 */

/******************************************************************************/
/*                                                                            */
/*                 Flexible Datarate Controller Area Network                  */
/*                                                                            */
/******************************************************************************/
/*!<FDCAN control and status registers */
/*****************  Bit definition for FDCAN_CREL register  *******************/
#define FDCAN_CREL_DAY_Pos                  (0U)
#define FDCAN_CREL_DAY_Msk                  (0xFFUL << FDCAN_CREL_DAY_Pos)          /*!< 0x000000FF */
#define FDCAN_CREL_DAY                      FDCAN_CREL_DAY_Msk                      /*!<Timestamp Day                           */
#define FDCAN_CREL_MON_Pos                  (8U)
#define FDCAN_CREL_MON_Msk                  (0xFFUL << FDCAN_CREL_MON_Pos)          /*!< 0x0000FF00 */
#define FDCAN_CREL_MON                      FDCAN_CREL_MON_Msk                      /*!<Timestamp Month                         */
#define FDCAN_CREL_YEAR_Pos                 (16U)
#define FDCAN_CREL_YEAR_Msk                 (0xFUL << FDCAN_CREL_YEAR_Pos)          /*!< 0x000F0000 */
#define FDCAN_CREL_YEAR                     FDCAN_CREL_YEAR_Msk                     /*!<Timestamp Year                          */
#define FDCAN_CREL_SUBSTEP_Pos              (20U)
#define FDCAN_CREL_SUBSTEP_Msk              (0xFUL << FDCAN_CREL_SUBSTEP_Pos)       /*!< 0x00F00000 */
#define FDCAN_CREL_SUBSTEP                  FDCAN_CREL_SUBSTEP_Msk                  /*!<Sub-step of Core release                */
#define FDCAN_CREL_STEP_Pos                 (24U)
#define FDCAN_CREL_STEP_Msk                 (0xFUL << FDCAN_CREL_STEP_Pos)          /*!< 0x0F000000 */
#define FDCAN_CREL_STEP                     FDCAN_CREL_STEP_Msk                     /*!<Step of Core release                    */
#define FDCAN_CREL_REL_Pos                  (28U)
#define FDCAN_CREL_REL_Msk                  (0xFUL << FDCAN_CREL_REL_Pos)           /*!< 0xF0000000 */
#define FDCAN_CREL_REL                      FDCAN_CREL_REL_Msk                      /*!<Core release                            */

/*****************  Bit definition for FDCAN_ENDN register  *******************/
#define FDCAN_ENDN_ETV_Pos                  (0U)
#define FDCAN_ENDN_ETV_Msk                  (0xFFFFFFFFUL << FDCAN_ENDN_ETV_Pos)    /*!< 0xFFFFFFFF */
#define FDCAN_ENDN_ETV                      FDCAN_ENDN_ETV_Msk                      /*!<Endianness Test Value                    */

/*****************  Bit definition for FDCAN_DBTP register  *******************/
#define FDCAN_DBTP_DSJW_Pos                 (0U)
#define FDCAN_DBTP_DSJW_Msk                 (0xFUL << FDCAN_DBTP_DSJW_Pos)          /*!< 0x0000000F */
#define FDCAN_DBTP_DSJW                     FDCAN_DBTP_DSJW_Msk                     /*!<Synchronization Jump Width              */
#define FDCAN_DBTP_DTSEG2_Pos               (4U)
#define FDCAN_DBTP_DTSEG2_Msk               (0xFUL << FDCAN_DBTP_DTSEG2_Pos)        /*!< 0x000000F0 */
#define FDCAN_DBTP_DTSEG2                   FDCAN_DBTP_DTSEG2_Msk                   /*!<Data time segment after sample point    */
#define FDCAN_DBTP_DTSEG1_Pos               (8U)
#define FDCAN_DBTP_DTSEG1_Msk               (0x1FUL << FDCAN_DBTP_DTSEG1_Pos)       /*!< 0x00001F00 */
#define FDCAN_DBTP_DTSEG1                   FDCAN_DBTP_DTSEG1_Msk                   /*!<Data time segment before sample point   */
#define FDCAN_DBTP_DBRP_Pos                 (16U)
#define FDCAN_DBTP_DBRP_Msk                 (0x1FUL << FDCAN_DBTP_DBRP_Pos)         /*!< 0x001F0000 */
#define FDCAN_DBTP_DBRP                     FDCAN_DBTP_DBRP_Msk                     /*!<Data BIt Rate Prescaler                 */
#define FDCAN_DBTP_TDC_Pos                  (23U)
#define FDCAN_DBTP_TDC_Msk                  (0x1UL << FDCAN_DBTP_TDC_Pos)           /*!< 0x00800000 */
#define FDCAN_DBTP_TDC                      FDCAN_DBTP_TDC_Msk                      /*!<Transceiver Delay Compensation          */

