MaJerle/stm32-usart-uart-dma-rx-tx/drivers/CMSIS/Device/ST/STM32C5xx/Include/stm32c593xx.h
/* ************************************  Bit definition for FLASH_ACR register  ************************************* */
#define FLASH_ACR_LATENCY_Pos               (0U)
#define FLASH_ACR_LATENCY_Msk               (0xFUL << FLASH_ACR_LATENCY_Pos)                 /*!< 0x0000000F */
#define FLASH_ACR_LATENCY                   FLASH_ACR_LATENCY_Msk                            /*!< Read latency */
#define FLASH_ACR_LATENCY_0                 (0x1UL << FLASH_ACR_LATENCY_Pos)
#define FLASH_ACR_LATENCY_1                 (0x2UL << FLASH_ACR_LATENCY_Pos)
#define FLASH_ACR_LATENCY_2                 (0x3UL << FLASH_ACR_LATENCY_Pos)
#define FLASH_ACR_LATENCY_3                 (0x4UL << FLASH_ACR_LATENCY_Pos)
#define FLASH_ACR_LATENCY_4                 (0x5UL << FLASH_ACR_LATENCY_Pos)
#define FLASH_ACR_LATENCY_5                 (0x6UL << FLASH_ACR_LATENCY_Pos)
#define FLASH_ACR_LATENCY_6                 (0x7UL << FLASH_ACR_LATENCY_Pos)
#define FLASH_ACR_LATENCY_7                 (0x8UL << FLASH_ACR_LATENCY_Pos)
#define FLASH_ACR_LATENCY_8                 (0x9UL << FLASH_ACR_LATENCY_Pos)
#define FLASH_ACR_LATENCY_9                 (0xAUL << FLASH_ACR_LATENCY_Pos)
#define FLASH_ACR_LATENCY_10                (0xBUL << FLASH_ACR_LATENCY_Pos)
#define FLASH_ACR_LATENCY_11                (0xCUL << FLASH_ACR_LATENCY_Pos)
#define FLASH_ACR_LATENCY_12                (0xDUL << FLASH_ACR_LATENCY_Pos)
#define FLASH_ACR_LATENCY_13                (0xEUL << FLASH_ACR_LATENCY_Pos)
#define FLASH_ACR_LATENCY_14                (0xFUL << FLASH_ACR_LATENCY_Pos)
#define FLASH_ACR_WRHIGHFREQ_Pos            (4U)
#define FLASH_ACR_WRHIGHFREQ_Msk            (0x3UL << FLASH_ACR_WRHIGHFREQ_Pos)              /*!< 0x00000030 */
#define FLASH_ACR_WRHIGHFREQ                FLASH_ACR_WRHIGHFREQ_Msk                         /*!< FLASH signal delay */
#define FLASH_ACR_WRHIGHFREQ_0              (0x1UL << FLASH_ACR_WRHIGHFREQ_Pos)              /*!< 0x00000010 */
#define FLASH_ACR_WRHIGHFREQ_1              (0x2UL << FLASH_ACR_WRHIGHFREQ_Pos)              /*!< 0x00000020 */
#define FLASH_ACR_PRFTEN_Pos                (8U)
#define FLASH_ACR_PRFTEN_Msk                (0x1UL << FLASH_ACR_PRFTEN_Pos)                  /*!< 0x00000100 */
#define FLASH_ACR_PRFTEN                    FLASH_ACR_PRFTEN_Msk                             /*!< Prefetch enable */
#define FLASH_ACR_EMPTY_Pos                 (16U)
#define FLASH_ACR_EMPTY_Msk                 (0x1UL << FLASH_ACR_EMPTY_Pos)                   /*!< 0x00010000 */
#define FLASH_ACR_EMPTY                     FLASH_ACR_EMPTY_Msk                              /*!< Main Flash memory area
                                                                                                  empty (not reset by
                                                                                                  system reset) */

/* ************************************  Bit definition for FLASH_KEYR register  ************************************ */
#define FLASH_KEYR_KEY_Pos                  (0U)
#define FLASH_KEYR_KEY_Msk                  (0xFFFFFFFFUL << FLASH_KEYR_KEY_Pos)             /*!< 0xFFFFFFFF */
#define FLASH_KEYR_KEY                      FLASH_KEYR_KEY_Msk                               /*!< Non-volatile
                                                                                                  memoryconfiguration
                                                                                                  access unlock key */

/* **********************************  Bit definition for FLASH_OPTKEYR register  *********************************** */
#define FLASH_OPTKEYR_OPTKEY_Pos            (0U)
#define FLASH_OPTKEYR_OPTKEY_Msk            (0xFFFFFFFFUL << FLASH_OPTKEYR_OPTKEY_Pos)       /*!< 0xFFFFFFFF */
#define FLASH_OPTKEYR_OPTKEY                FLASH_OPTKEYR_OPTKEY_Msk                         /*!< FLASH option-byte
                                                                                                  control access unlock
                                                                                                  key */

/* ************************************  Bit definition for FLASH_OPSR register  ************************************ */
#define FLASH_OPSR_ADDR_OP_Pos              (0U)
#define FLASH_OPSR_ADDR_OP_Msk              (0xFFFFUL << FLASH_OPSR_ADDR_OP_Pos)             /*!< 0x0000FFFF */
#define FLASH_OPSR_ADDR_OP                  FLASH_OPSR_ADDR_OP_Msk                           /*!< Interrupted operation
                                                                                                  address */
#define FLASH_OPSR_DATA_OP_Pos              (21U)
#define FLASH_OPSR_DATA_OP_Msk              (0x1UL << FLASH_OPSR_DATA_OP_Pos)                /*!< 0x00200000 */
#define FLASH_OPSR_DATA_OP                  FLASH_OPSR_DATA_OP_Msk                           /*!< Flash data area
                                                                                                  operation interrupted
                                                                                                  */
#define FLASH_OPSR_BK_OP_Pos                (22U)
#define FLASH_OPSR_BK_OP_Msk                (0x1UL << FLASH_OPSR_BK_OP_Pos)                  /*!< 0x00400000 */
#define FLASH_OPSR_BK_OP                    FLASH_OPSR_BK_OP_Msk                             /*!< Interrupted operation
                                                                                                  bank */
#define FLASH_OPSR_OTP_OP_Pos               (24U)
#define FLASH_OPSR_OTP_OP_Msk               (0x1UL << FLASH_OPSR_OTP_OP_Pos)                 /*!< 0x01000000 */
#define FLASH_OPSR_OTP_OP                   FLASH_OPSR_OTP_OP_Msk                            /*!< OTP operation
                                                                                                  interrupted */
#define FLASH_OPSR_CODE_OP_Pos              (29U)
#define FLASH_OPSR_CODE_OP_Msk              (0x7UL << FLASH_OPSR_CODE_OP_Pos)                /*!< 0xE0000000 */
#define FLASH_OPSR_CODE_OP                  FLASH_OPSR_CODE_OP_Msk                           /*!< Flash memory operation
                                                                                                  code */
#define FLASH_OPSR_CODE_OP_0                (0x1UL << FLASH_OPSR_CODE_OP_Pos)                /*!< 0x20000000 */
#define FLASH_OPSR_CODE_OP_1                (0x2UL << FLASH_OPSR_CODE_OP_Pos)                /*!< 0x40000000 */
#define FLASH_OPSR_CODE_OP_2                (0x4UL << FLASH_OPSR_CODE_OP_Pos)                /*!< 0x80000000 */

/* ***********************************  Bit definition for FLASH_OPTCR register  ************************************ */
#define FLASH_OPTCR_OPTLOCK_Pos             (0U)
#define FLASH_OPTCR_OPTLOCK_Msk             (0x1UL << FLASH_OPTCR_OPTLOCK_Pos)               /*!< 0x00000001 */
#define FLASH_OPTCR_OPTLOCK                 FLASH_OPTCR_OPTLOCK_Msk                          /*!< FLASH_OPTCR lock
                                                                                                  option configuration
                                                                                                  bit */
#define FLASH_OPTCR_OPTSTRT_Pos             (1U)
#define FLASH_OPTCR_OPTSTRT_Msk             (0x1UL << FLASH_OPTCR_OPTSTRT_Pos)               /*!< 0x00000002 */
#define FLASH_OPTCR_OPTSTRT                 FLASH_OPTCR_OPTSTRT_Msk                          /*!< Option-byte start
                                                                                                  change option
                                                                                                  configuration bit */
#define FLASH_OPTCR_SWAP_BANK_Pos           (31U)
#define FLASH_OPTCR_SWAP_BANK_Msk           (0x1UL << FLASH_OPTCR_SWAP_BANK_Pos)             /*!< 0x80000000 */
#define FLASH_OPTCR_SWAP_BANK               FLASH_OPTCR_SWAP_BANK_Msk                        /*!< Bank swapping option
                                                                                                  configuration bit */

