MaJerle/stm32-usart-uart-dma-rx-tx/drivers/CMSIS/Device/ST/STM32C5xx/Include/stm32c593xx.h
/* *************************************  Bit definition for GPIO_BRR register  ************************************* */
#define GPIO_BRR_BR0_Pos           (0U)
#define GPIO_BRR_BR0_Msk           (0x1UL << GPIO_BRR_BR0_Pos)           /*!< 0x00000001 */
#define GPIO_BRR_BR0               GPIO_BRR_BR0_Msk                      /*!< Port x reset IO pin y */
#define GPIO_BRR_BR1_Pos           (1U)
#define GPIO_BRR_BR1_Msk           (0x1UL << GPIO_BRR_BR1_Pos)           /*!< 0x00000002 */
#define GPIO_BRR_BR1               GPIO_BRR_BR1_Msk                      /*!< Port x reset IO pin y */
#define GPIO_BRR_BR2_Pos           (2U)
#define GPIO_BRR_BR2_Msk           (0x1UL << GPIO_BRR_BR2_Pos)           /*!< 0x00000004 */
#define GPIO_BRR_BR2               GPIO_BRR_BR2_Msk                      /*!< Port x reset IO pin y */
#define GPIO_BRR_BR3_Pos           (3U)
#define GPIO_BRR_BR3_Msk           (0x1UL << GPIO_BRR_BR3_Pos)           /*!< 0x00000008 */
#define GPIO_BRR_BR3               GPIO_BRR_BR3_Msk                      /*!< Port x reset IO pin y */
#define GPIO_BRR_BR4_Pos           (4U)
#define GPIO_BRR_BR4_Msk           (0x1UL << GPIO_BRR_BR4_Pos)           /*!< 0x00000010 */
#define GPIO_BRR_BR4               GPIO_BRR_BR4_Msk                      /*!< Port x reset IO pin y */
#define GPIO_BRR_BR5_Pos           (5U)
#define GPIO_BRR_BR5_Msk           (0x1UL << GPIO_BRR_BR5_Pos)           /*!< 0x00000020 */
#define GPIO_BRR_BR5               GPIO_BRR_BR5_Msk                      /*!< Port x reset IO pin y */
#define GPIO_BRR_BR6_Pos           (6U)
#define GPIO_BRR_BR6_Msk           (0x1UL << GPIO_BRR_BR6_Pos)           /*!< 0x00000040 */
#define GPIO_BRR_BR6               GPIO_BRR_BR6_Msk                      /*!< Port x reset IO pin y */
#define GPIO_BRR_BR7_Pos           (7U)
#define GPIO_BRR_BR7_Msk           (0x1UL << GPIO_BRR_BR7_Pos)           /*!< 0x00000080 */
#define GPIO_BRR_BR7               GPIO_BRR_BR7_Msk                      /*!< Port x reset IO pin y */
#define GPIO_BRR_BR8_Pos           (8U)
#define GPIO_BRR_BR8_Msk           (0x1UL << GPIO_BRR_BR8_Pos)           /*!< 0x00000100 */
#define GPIO_BRR_BR8               GPIO_BRR_BR8_Msk                      /*!< Port x reset IO pin y */
#define GPIO_BRR_BR9_Pos           (9U)
#define GPIO_BRR_BR9_Msk           (0x1UL << GPIO_BRR_BR9_Pos)           /*!< 0x00000200 */
#define GPIO_BRR_BR9               GPIO_BRR_BR9_Msk                      /*!< Port x reset IO pin y */
#define GPIO_BRR_BR10_Pos          (10U)
#define GPIO_BRR_BR10_Msk          (0x1UL << GPIO_BRR_BR10_Pos)          /*!< 0x00000400 */
#define GPIO_BRR_BR10              GPIO_BRR_BR10_Msk                     /*!< Port x reset IO pin y */
#define GPIO_BRR_BR11_Pos          (11U)
#define GPIO_BRR_BR11_Msk          (0x1UL << GPIO_BRR_BR11_Pos)          /*!< 0x00000800 */
#define GPIO_BRR_BR11              GPIO_BRR_BR11_Msk                     /*!< Port x reset IO pin y */
#define GPIO_BRR_BR12_Pos          (12U)
#define GPIO_BRR_BR12_Msk          (0x1UL << GPIO_BRR_BR12_Pos)          /*!< 0x00001000 */
#define GPIO_BRR_BR12              GPIO_BRR_BR12_Msk                     /*!< Port x reset IO pin y */
#define GPIO_BRR_BR13_Pos          (13U)
#define GPIO_BRR_BR13_Msk          (0x1UL << GPIO_BRR_BR13_Pos)          /*!< 0x00002000 */
#define GPIO_BRR_BR13              GPIO_BRR_BR13_Msk                     /*!< Port x reset IO pin y */
#define GPIO_BRR_BR14_Pos          (14U)
#define GPIO_BRR_BR14_Msk          (0x1UL << GPIO_BRR_BR14_Pos)          /*!< 0x00004000 */
#define GPIO_BRR_BR14              GPIO_BRR_BR14_Msk                     /*!< Port x reset IO pin y */
#define GPIO_BRR_BR15_Pos          (15U)
#define GPIO_BRR_BR15_Msk          (0x1UL << GPIO_BRR_BR15_Pos)          /*!< 0x00008000 */
#define GPIO_BRR_BR15              GPIO_BRR_BR15_Msk                     /*!< Port x reset IO pin y */

/* ****************************************************************************************************************** */
/*                                                                                                                    */
/*                                               Hash processor (HASH)                                                */
/*                                                                                                                    */
/* ****************************************************************************************************************** */
#define HASH_CSR_REGISTERS_NUMBER                     103U  /*!< Number of Context Swap Registers */
#define HASH_SHA1_SHA2256_CSR_REGISTER_NUMBER         38U   /*!< Number of context swap register in case of HASH SHA-1
                                                                 or SHA2-256 */
#define HASH_HMAC_SHA1_SHA2256_CSR_REGISTER_NUMBER    54U   /*!< Number of context swap register in case of HASH-HMAC
                                                                 SHA-1 or SHA2-256 */
#define HASH_SHA2384_SHA2512_CSR_REGISTER_NUMBER      91U   /*!< Number of context swap register in case of HASH
                                                                 SHA2-384 or SHA2-512 */
#define HASH_HMAC_SHA2384_SHA2512_CSR_REGISTER_NUMBER 103U  /*!< Number of context swap register in case of HASH-HMAC
                                                                 SHA2-384 or SHA2-512 */

/* *************************************  Bit definition for HASH_CR register  ************************************** */
#define HASH_CR_INIT_Pos     (2U)
#define HASH_CR_INIT_Msk     (0x1UL << HASH_CR_INIT_Pos)       /*!< 0x00000004 */
#define HASH_CR_INIT         HASH_CR_INIT_Msk                  /*!< Initialize message digest calculation */
#define HASH_CR_DMAE_Pos     (3U)
#define HASH_CR_DMAE_Msk     (0x1UL << HASH_CR_DMAE_Pos)       /*!< 0x00000008 */
#define HASH_CR_DMAE         HASH_CR_DMAE_Msk                  /*!< DMA enable */
#define HASH_CR_DATATYPE_Pos (4U)
#define HASH_CR_DATATYPE_Msk (0x3UL << HASH_CR_DATATYPE_Pos)   /*!< 0x00000030 */
#define HASH_CR_DATATYPE     HASH_CR_DATATYPE_Msk              /*!< Data type selection */
#define HASH_CR_DATATYPE_0   (0x1UL << HASH_CR_DATATYPE_Pos)   /*!< 0x00000010 */
#define HASH_CR_DATATYPE_1   (0x2UL << HASH_CR_DATATYPE_Pos)   /*!< 0x00000020 */
#define HASH_CR_MODE_Pos     (6U)
#define HASH_CR_MODE_Msk     (0x1UL << HASH_CR_MODE_Pos)       /*!< 0x00000040 */
#define HASH_CR_MODE         HASH_CR_MODE_Msk                  /*!< Mode selection */
#define HASH_CR_NBW_Pos      (8U)
#define HASH_CR_NBW_Msk      (0xFUL << HASH_CR_NBW_Pos)        /*!< 0x00000F00 */
#define HASH_CR_NBW          HASH_CR_NBW_Msk                   /*!< Number of words already pushed */
#define HASH_CR_NBW_0        (0x1UL << HASH_CR_NBW_Pos)        /*!< 0x00000100 */
#define HASH_CR_NBW_1        (0x2UL << HASH_CR_NBW_Pos)        /*!< 0x00000200 */
#define HASH_CR_NBW_2        (0x4UL << HASH_CR_NBW_Pos)        /*!< 0x00000400 */
#define HASH_CR_NBW_3        (0x8UL << HASH_CR_NBW_Pos)        /*!< 0x00000800 */
#define HASH_CR_DINNE_Pos    (12U)
#define HASH_CR_DINNE_Msk    (0x1UL << HASH_CR_DINNE_Pos)      /*!< 0x00001000 */
#define HASH_CR_DINNE        HASH_CR_DINNE_Msk                 /*!< DIN not empty */
#define HASH_CR_MDMAT_Pos    (13U)
#define HASH_CR_MDMAT_Msk    (0x1UL << HASH_CR_MDMAT_Pos)      /*!< 0x00002000 */
#define HASH_CR_MDMAT        HASH_CR_MDMAT_Msk                 /*!< Multiple DMA transfers */
#define HASH_CR_LKEY_Pos     (16U)
#define HASH_CR_LKEY_Msk     (0x1UL << HASH_CR_LKEY_Pos)       /*!< 0x00010000 */
#define HASH_CR_LKEY         HASH_CR_LKEY_Msk                  /*!< Long key selection */
#define HASH_CR_ALGO_Pos     (17U)
#define HASH_CR_ALGO_Msk     (0xFUL << HASH_CR_ALGO_Pos)       /*!< 0x001E0000 */
#define HASH_CR_ALGO         HASH_CR_ALGO_Msk                  /*!< Algorithm selection */
#define HASH_CR_ALGO_0       (0x1UL << HASH_CR_ALGO_Pos)       /*!< 0x00020000 */
#define HASH_CR_ALGO_1       (0x2UL << HASH_CR_ALGO_Pos)       /*!< 0x00040000 */
#define HASH_CR_ALGO_2       (0x4UL << HASH_CR_ALGO_Pos)       /*!< 0x00080000 */
#define HASH_CR_ALGO_3       (0x8UL << HASH_CR_ALGO_Pos)       /*!< 0x00100000 */

/* *************************************  Bit definition for HASH_DIN register  ************************************* */
#define HASH_DIN_DATAIN_Pos  (0U)
#define HASH_DIN_DATAIN_Msk  (0xFFFFFFFFUL << HASH_DIN_DATAIN_Pos)  /*!< 0xFFFFFFFF */
#define HASH_DIN_DATAIN      HASH_DIN_DATAIN_Msk                    /*!< Data input */

