MaJerle/stm32-usart-uart-dma-rx-tx/drivers/CMSIS/Device/ST/STM32C5xx/Include/stm32c593xx.h
/* **********************************  Bit definition for SBS_NEXTHDPLCR register  ********************************** */
#define SBS_NEXTHDPLCR_NEXTHDPL_Pos            (0U)
#define SBS_NEXTHDPLCR_NEXTHDPL_Msk            (0x3UL << SBS_NEXTHDPLCR_NEXTHDPL_Pos)              /*!< 0x00000003 */
#define SBS_NEXTHDPLCR_NEXTHDPL                SBS_NEXTHDPLCR_NEXTHDPL_Msk                         /*!< Index to point
                                                                                                        to a higher HDPL
                                                                                                        than the current
                                                                                                        one */
#define SBS_NEXTHDPLCR_NEXTHDPL_0              (0x1UL << SBS_NEXTHDPLCR_NEXTHDPL_Pos)              /*!< 0x00000001 */
#define SBS_NEXTHDPLCR_NEXTHDPL_1              (0x2UL << SBS_NEXTHDPLCR_NEXTHDPL_Pos)              /*!< 0x00000002 */

/* *************************************  Bit definition for SBS_PMCR register  ************************************* */
#define SBS_PMCR_ETH1_SEL_PHY_Pos              (24U)
#define SBS_PMCR_ETH1_SEL_PHY_Msk              (0xFUL << SBS_PMCR_ETH1_SEL_PHY_Pos)                /*!< 0x0F000000 */
#define SBS_PMCR_ETH1_SEL_PHY                  SBS_PMCR_ETH1_SEL_PHY_Msk                           /*!< Ethernet PHY
                                                                                                        interface
                                                                                                        selection */
#define SBS_PMCR_ETH1_SEL_PHY_0                (0x1UL << SBS_PMCR_ETH1_SEL_PHY_Pos)                /*!< 0x01000000 */
#define SBS_PMCR_ETH1_SEL_PHY_1                (0x2UL << SBS_PMCR_ETH1_SEL_PHY_Pos)                /*!< 0x02000000 */
#define SBS_PMCR_ETH1_SEL_PHY_2                (0x4UL << SBS_PMCR_ETH1_SEL_PHY_Pos)                /*!< 0x04000000 */
#define SBS_PMCR_ETH1_SEL_PHY_3                (0x8UL << SBS_PMCR_ETH1_SEL_PHY_Pos)                /*!< 0x08000000 */
#define SBS_PMCR_ETH1INTPOL_Pos                (28U)
#define SBS_PMCR_ETH1INTPOL_Msk                (0x1UL << SBS_PMCR_ETH1INTPOL_Pos)                  /*!< 0x10000000 */
#define SBS_PMCR_ETH1INTPOL                    SBS_PMCR_ETH1INTPOL_Msk                             /*!< Ethernet
                                                                                                        external PHY
                                                                                                        interrupt
                                                                                                        polarity
                                                                                                        configuration */
#define SBS_PMCR_ETH1PDACK_Pos                 (29U)
#define SBS_PMCR_ETH1PDACK_Msk                 (0x1UL << SBS_PMCR_ETH1PDACK_Pos)                   /*!< 0x20000000 */
#define SBS_PMCR_ETH1PDACK                     SBS_PMCR_ETH1PDACK_Msk                              /*!< Ethernet
                                                                                                        power-down
                                                                                                        acknowledge */
#define SBS_PMCR_ETH1TXLPI_Pos                 (30U)
#define SBS_PMCR_ETH1TXLPI_Msk                 (0x1UL << SBS_PMCR_ETH1TXLPI_Pos)                   /*!< 0x40000000 */
#define SBS_PMCR_ETH1TXLPI                     SBS_PMCR_ETH1TXLPI_Msk                              /*!< Ethernet TxLPI
                                                                                                        status */

/* ************************************  Bit definition for SBS_FPUIMR register  ************************************ */
#define SBS_FPUIMR_FPU_IE_Pos                  (0U)
#define SBS_FPUIMR_FPU_IE_Msk                  (0x3FUL << SBS_FPUIMR_FPU_IE_Pos)                   /*!< 0x0000003F */
#define SBS_FPUIMR_FPU_IE                      SBS_FPUIMR_FPU_IE_Msk                               /*!< FPU interrupt
                                                                                                        enable */
#define SBS_FPUIMR_FPU_IE_0                    (0x1UL << SBS_FPUIMR_FPU_IE_Pos)                    /*!< 0x00000001 */
#define SBS_FPUIMR_FPU_IE_1                    (0x2UL << SBS_FPUIMR_FPU_IE_Pos)                    /*!< 0x00000002 */
#define SBS_FPUIMR_FPU_IE_2                    (0x4UL << SBS_FPUIMR_FPU_IE_Pos)                    /*!< 0x00000004 */
#define SBS_FPUIMR_FPU_IE_3                    (0x8UL << SBS_FPUIMR_FPU_IE_Pos)                    /*!< 0x00000008 */
#define SBS_FPUIMR_FPU_IE_4                    (0x10UL << SBS_FPUIMR_FPU_IE_Pos)                   /*!< 0x00000010 */
#define SBS_FPUIMR_FPU_IE_5                    (0x20UL << SBS_FPUIMR_FPU_IE_Pos)                   /*!< 0x00000020 */

/* *************************************  Bit definition for SBS_MESR register  ************************************* */
#define SBS_MESR_MCLR_Pos                      (0U)
#define SBS_MESR_MCLR_Msk                      (0x1UL << SBS_MESR_MCLR_Pos)                        /*!< 0x00000001 */
#define SBS_MESR_MCLR                          SBS_MESR_MCLR_Msk                                   /*!< Device memories
                                                                                                        erase status */
#define SBS_MESR_IPMEE_Pos                     (16U)
#define SBS_MESR_IPMEE_Msk                     (0x1UL << SBS_MESR_IPMEE_Pos)                       /*!< 0x00010000 */
#define SBS_MESR_IPMEE                         SBS_MESR_IPMEE_Msk                                  /*!< ICACHE erase
                                                                                                        status */

/* ************************************  Bit definition for SBS_CCCSR register  ************************************* */
#define SBS_CCCSR_EN1_Pos                      (0U)
#define SBS_CCCSR_EN1_Msk                      (0x1UL << SBS_CCCSR_EN1_Pos)                        /*!< 0x00000001 */
#define SBS_CCCSR_EN1                          SBS_CCCSR_EN1_Msk                                   /*!< Enable
                                                                                                        compensation
                                                                                                        cell for VDDIO
                                                                                                        power rail */
#define SBS_CCCSR_CS1_Pos                      (1U)
#define SBS_CCCSR_CS1_Msk                      (0x1UL << SBS_CCCSR_CS1_Pos)                        /*!< 0x00000002 */
#define SBS_CCCSR_CS1                          SBS_CCCSR_CS1_Msk                                   /*!< Code selection
                                                                                                        for VDDIO power
                                                                                                        rail (reset
                                                                                                        value set to 1)
                                                                                                        */
#define SBS_CCCSR_RDY1_Pos                     (8U)
#define SBS_CCCSR_RDY1_Msk                     (0x1UL << SBS_CCCSR_RDY1_Pos)                       /*!< 0x00000100 */
#define SBS_CCCSR_RDY1                         SBS_CCCSR_RDY1_Msk                                  /*!< VDDIO
                                                                                                        compensation
                                                                                                        cell ready flag
                                                                                                        */

/* ************************************  Bit definition for SBS_CCVALR register  ************************************ */
#define SBS_CCVALR_ANSRC1_Pos                  (0U)
#define SBS_CCVALR_ANSRC1_Msk                  (0xFUL << SBS_CCVALR_ANSRC1_Pos)                    /*!< 0x0000000F */
#define SBS_CCVALR_ANSRC1                      SBS_CCVALR_ANSRC1_Msk                               /*!< Compensation
                                                                                                        value for the
                                                                                                        NMOS transistor
                                                                                                        */
#define SBS_CCVALR_APSRC1_Pos                  (4U)
#define SBS_CCVALR_APSRC1_Msk                  (0xFUL << SBS_CCVALR_APSRC1_Pos)                    /*!< 0x000000F0 */
#define SBS_CCVALR_APSRC1                      SBS_CCVALR_APSRC1_Msk                               /*!< Compensation
                                                                                                        value for the
                                                                                                        PMOS transistor
                                                                                                        */

