MaJerle/stm32-usart-uart-dma-rx-tx/drivers/CMSIS/Device/ST/STM32C5xx/Include/stm32c593xx.h
/********************  Bits definition for TAMP_SR register  *****************/
#define TAMP_SR_TAMP1F_Pos                  (0U)
#define TAMP_SR_TAMP1F_Msk                  (0x1UL << TAMP_SR_TAMP1F_Pos)           /*!< 0x00000001 */
#define TAMP_SR_TAMP1F                      TAMP_SR_TAMP1F_Msk                      /*!< TAMP1 detection flag */
#define TAMP_SR_TAMP2F_Pos                  (1U)
#define TAMP_SR_TAMP2F_Msk                  (0x1UL << TAMP_SR_TAMP2F_Pos)           /*!< 0x00000002 */
#define TAMP_SR_TAMP2F                      TAMP_SR_TAMP2F_Msk                      /*!< TAMP2 detection flag */
#define TAMP_SR_TAMP3F_Pos                  (2U)
#define TAMP_SR_TAMP3F_Msk                  (0x1UL << TAMP_SR_TAMP3F_Pos)           /*!< 0x00000004 */
#define TAMP_SR_TAMP3F                      TAMP_SR_TAMP3F_Msk                      /*!< TAMP3 detection flag */
#define TAMP_SR_ITAMP3F_Pos                 (18U)
#define TAMP_SR_ITAMP3F_Msk                 (0x1UL << TAMP_SR_ITAMP3F_Pos)          /*!< 0x00040000 */
#define TAMP_SR_ITAMP3F                     TAMP_SR_ITAMP3F_Msk                     /*!< Internal tamper 3 flag */
#define TAMP_SR_ITAMP4F_Pos                 (19U)
#define TAMP_SR_ITAMP4F_Msk                 (0x1UL << TAMP_SR_ITAMP4F_Pos)          /*!< 0x00080000 */
#define TAMP_SR_ITAMP4F                     TAMP_SR_ITAMP4F_Msk                     /*!< Internal tamper 4 flag */
#define TAMP_SR_ITAMP5F_Pos                 (20U)
#define TAMP_SR_ITAMP5F_Msk                 (0x1UL << TAMP_SR_ITAMP5F_Pos)          /*!< 0x00100000 */
#define TAMP_SR_ITAMP5F                     TAMP_SR_ITAMP5F_Msk                     /*!< Internal tamper 5 flag */
#define TAMP_SR_ITAMP6F_Pos                 (21U)
#define TAMP_SR_ITAMP6F_Msk                 (0x1UL << TAMP_SR_ITAMP6F_Pos)          /*!< 0x00200000 */
#define TAMP_SR_ITAMP6F                     TAMP_SR_ITAMP6F_Msk                     /*!< Internal tamper 6 flag */
#define TAMP_SR_ITAMP9F_Pos                 (24U)
#define TAMP_SR_ITAMP9F_Msk                 (0x1UL << TAMP_SR_ITAMP9F_Pos)          /*!< 0x01000000 */
#define TAMP_SR_ITAMP9F                     TAMP_SR_ITAMP9F_Msk                     /*!< Internal tamper 9 flag */
#define TAMP_SR_ITAMP11F_Pos                (26U)
#define TAMP_SR_ITAMP11F_Msk                (0x1UL << TAMP_SR_ITAMP11F_Pos)         /*!< 0x04000000 */
#define TAMP_SR_ITAMP11F                    TAMP_SR_ITAMP11F_Msk                    /*!< Internal tamper 11 flag */

/********************  Bits definition for TAMP_MISR register  ****************/
#define TAMP_MISR_TAMP1MF_Pos               (0U)
#define TAMP_MISR_TAMP1MF_Msk               (0x1UL << TAMP_MISR_TAMP1MF_Pos)        /*!< 0x00000001 */
#define TAMP_MISR_TAMP1MF                   TAMP_MISR_TAMP1MF_Msk                   /*!< TAMP1 interrupt masked flag */
#define TAMP_MISR_TAMP2MF_Pos               (1U)
#define TAMP_MISR_TAMP2MF_Msk               (0x1UL << TAMP_MISR_TAMP2MF_Pos)        /*!< 0x00000002 */
#define TAMP_MISR_TAMP2MF                   TAMP_MISR_TAMP2MF_Msk                   /*!< TAMP2 interrupt masked flag */
#define TAMP_MISR_TAMP3MF_Pos               (2U)
#define TAMP_MISR_TAMP3MF_Msk               (0x1UL << TAMP_MISR_TAMP3MF_Pos)        /*!< 0x00000004 */
#define TAMP_MISR_TAMP3MF                   TAMP_MISR_TAMP3MF_Msk                   /*!< TAMP3 interrupt masked flag */
#define TAMP_MISR_ITAMP3MF_Pos              (18U)
#define TAMP_MISR_ITAMP3MF_Msk              (0x1UL << TAMP_MISR_ITAMP3MF_Pos)       /*!< 0x00040000 */
#define TAMP_MISR_ITAMP3MF                  TAMP_MISR_ITAMP3MF_Msk                  /*!< Internal tamper 3  interrupt masked flag */
#define TAMP_MISR_ITAMP4MF_Pos              (19U)
#define TAMP_MISR_ITAMP4MF_Msk              (0x1UL << TAMP_MISR_ITAMP4MF_Pos)       /*!< 0x00080000 */
#define TAMP_MISR_ITAMP4MF                  TAMP_MISR_ITAMP4MF_Msk                  /*!< Internal tamper 4  interrupt masked flag */
#define TAMP_MISR_ITAMP5MF_Pos              (20U)
#define TAMP_MISR_ITAMP5MF_Msk              (0x1UL << TAMP_MISR_ITAMP5MF_Pos)       /*!< 0x00100000 */
#define TAMP_MISR_ITAMP5MF                  TAMP_MISR_ITAMP5MF_Msk                  /*!< Internal tamper 5  interrupt masked flag */
#define TAMP_MISR_ITAMP6MF_Pos              (21U)
#define TAMP_MISR_ITAMP6MF_Msk              (0x1UL << TAMP_MISR_ITAMP6MF_Pos)       /*!< 0x00200000 */
#define TAMP_MISR_ITAMP6MF                  TAMP_MISR_ITAMP6MF_Msk                  /*!< Internal tamper 6  interrupt masked flag */
#define TAMP_MISR_ITAMP9MF_Pos              (24U)
#define TAMP_MISR_ITAMP9MF_Msk              (0x1UL << TAMP_MISR_ITAMP9MF_Pos)       /*!< 0x01000000 */
#define TAMP_MISR_ITAMP9MF                  TAMP_MISR_ITAMP9MF_Msk                  /*!< internal tamper 9 interrupt masked flag */
#define TAMP_MISR_ITAMP11MF_Pos             (26U)
#define TAMP_MISR_ITAMP11MF_Msk             (0x1UL << TAMP_MISR_ITAMP11MF_Pos)      /*!< 0x04000000 */
#define TAMP_MISR_ITAMP11MF                 TAMP_MISR_ITAMP11MF_Msk                 /*!< internal tamper 11 interrupt masked flag */

/********************  Bits definition for TAMP_SCR register  *****************/
#define TAMP_SCR_CTAMP1F_Pos                (0U)
#define TAMP_SCR_CTAMP1F_Msk                (0x1UL << TAMP_SCR_CTAMP1F_Pos)         /*!< 0x00000001 */
#define TAMP_SCR_CTAMP1F                    TAMP_SCR_CTAMP1F_Msk                    /*!< Clear TAMP1 detection flag */
#define TAMP_SCR_CTAMP2F_Pos                (1U)
#define TAMP_SCR_CTAMP2F_Msk                (0x1UL << TAMP_SCR_CTAMP2F_Pos)         /*!< 0x00000002 */
#define TAMP_SCR_CTAMP2F                    TAMP_SCR_CTAMP2F_Msk                    /*!< Clear TAMP2 detection flag */
#define TAMP_SCR_CTAMP3F_Pos                (2U)
#define TAMP_SCR_CTAMP3F_Msk                (0x1UL << TAMP_SCR_CTAMP3F_Pos)         /*!< 0x00000004 */
#define TAMP_SCR_CTAMP3F                    TAMP_SCR_CTAMP3F_Msk                    /*!< Clear TAMP3 detection flag */
#define TAMP_SCR_CITAMP3F_Pos               (18U)
#define TAMP_SCR_CITAMP3F_Msk               (0x1UL << TAMP_SCR_CITAMP3F_Pos)        /*!< 0x00040000 */
#define TAMP_SCR_CITAMP3F                   TAMP_SCR_CITAMP3F_Msk                   /*!< Clear ITAMP3 detection flag */
#define TAMP_SCR_CITAMP4F_Pos               (19U)
#define TAMP_SCR_CITAMP4F_Msk               (0x1UL << TAMP_SCR_CITAMP4F_Pos)        /*!< 0x00080000 */
#define TAMP_SCR_CITAMP4F                   TAMP_SCR_CITAMP4F_Msk                   /*!< Clear ITAMP4 detection flag */
#define TAMP_SCR_CITAMP5F_Pos               (20U)
#define TAMP_SCR_CITAMP5F_Msk               (0x1UL << TAMP_SCR_CITAMP5F_Pos)        /*!< 0x00100000 */
#define TAMP_SCR_CITAMP5F                   TAMP_SCR_CITAMP5F_Msk                   /*!< Clear ITAMP5 detection flag */
#define TAMP_SCR_CITAMP6F_Pos               (21U)
#define TAMP_SCR_CITAMP6F_Msk               (0x1UL << TAMP_SCR_CITAMP6F_Pos)        /*!< 0x00200000 */
#define TAMP_SCR_CITAMP6F                   TAMP_SCR_CITAMP6F_Msk                   /*!< Clear ITAMP6 detection flag */
#define TAMP_SCR_CITAMP9F_Pos               (24U)
#define TAMP_SCR_CITAMP9F_Msk               (0x1UL << TAMP_SCR_CITAMP9F_Pos)        /*!< 0x01000000 */
#define TAMP_SCR_CITAMP9F                   TAMP_SCR_CITAMP9F_Msk                   /*!< Clear ITAMP9 detection flag */
#define TAMP_SCR_CITAMP11F_Pos              (26U)
#define TAMP_SCR_CITAMP11F_Msk              (0x1UL << TAMP_SCR_CITAMP11F_Pos)       /*!< 0x04000000 */
#define TAMP_SCR_CITAMP11F                  TAMP_SCR_CITAMP11F_Msk                  /*!< Clear ITAMP11 detection flag */

/********************  Bits definition for TAMP_OR register  ***************/
#define TAMP_OR_IN2_RMP_Pos                (0U)
#define TAMP_OR_IN2_RMP_Msk                (0x1UL << TAMP_OR_IN2_RMP_Pos)          /*!< 0x00000001 */
#define TAMP_OR_IN2_RMP                    TAMP_OR_IN2_RMP_Msk                     /*!< TAMP_IN2 pin select */
#define TAMP_OR_IN3_RMP_Pos                (2U)
#define TAMP_OR_IN3_RMP_Msk                (0x1UL << TAMP_OR_IN3_RMP_Pos)          /*!< 0x00000004 */
#define TAMP_OR_IN3_RMP                    TAMP_OR_IN3_RMP_Msk                     /*!< TAMP_IN3 pin select */

/********************  Bits definition for TAMP_BKP0R register  ****************/
#define TAMP_BKP0R_BKP_Pos                 (0U)
#define TAMP_BKP0R_BKP_Msk                 (0xFFFFFFFFUL << TAMP_BKP0R_BKP_Pos)    /*!< 0xFFFFFFFF */
#define TAMP_BKP0R_BKP                     TAMP_BKP0R_BKP_Msk                      /*!< The application can write or read data to and from these registers. */

/********************  Bits definition for TAMP_BKP1R register  ****************/
#define TAMP_BKP1R_BKP_Pos                 (0U)
#define TAMP_BKP1R_BKP_Msk                 (0xFFFFFFFFUL << TAMP_BKP1R_BKP_Pos)    /*!< 0xFFFFFFFF */
#define TAMP_BKP1R_BKP                     TAMP_BKP1R_BKP_Msk                      /*!< The application can write or read data to and from these registers. */

/********************  Bits definition for TAMP_BKP2R register  ****************/
#define TAMP_BKP2R_BKP_Pos                 (0U)
#define TAMP_BKP2R_BKP_Msk                 (0xFFFFFFFFUL << TAMP_BKP2R_BKP_Pos)    /*!< 0xFFFFFFFF */
#define TAMP_BKP2R_BKP                     TAMP_BKP2R_BKP_Msk                      /*!< The application can write or read data to and from these registers. */

/********************  Bits definition for TAMP_BKP3R register  ****************/
#define TAMP_BKP3R_BKP_Pos                 (0U)
#define TAMP_BKP3R_BKP_Msk                 (0xFFFFFFFFUL << TAMP_BKP3R_BKP_Pos)    /*!< 0xFFFFFFFF */
#define TAMP_BKP3R_BKP                     TAMP_BKP3R_BKP_Msk                      /*!< The application can write or read data to and from these registers. */

/********************  Bits definition for TAMP_BKP4R register  ****************/
#define TAMP_BKP4R_BKP_Pos                 (0U)
#define TAMP_BKP4R_BKP_Msk                 (0xFFFFFFFFUL << TAMP_BKP4R_BKP_Pos)    /*!< 0xFFFFFFFF */
#define TAMP_BKP4R_BKP                     TAMP_BKP4R_BKP_Msk                      /*!< The application can write or read data to and from these registers. */

/********************  Bits definition for TAMP_BKP5R register  ****************/
#define TAMP_BKP5R_BKP_Pos                 (0U)
#define TAMP_BKP5R_BKP_Msk                 (0xFFFFFFFFUL << TAMP_BKP5R_BKP_Pos)    /*!< 0xFFFFFFFF */
#define TAMP_BKP5R_BKP                     TAMP_BKP5R_BKP_Msk                      /*!< The application can write or read data to and from these registers. */

/********************  Bits definition for TAMP_BKP6R register  ****************/
#define TAMP_BKP6R_BKP_Pos                 (0U)
#define TAMP_BKP6R_BKP_Msk                 (0xFFFFFFFFUL << TAMP_BKP6R_BKP_Pos)    /*!< 0xFFFFFFFF */
#define TAMP_BKP6R_BKP                     TAMP_BKP6R_BKP_Msk                      /*!< The application can write or read data to and from these registers. */

/********************  Bits definition for TAMP_BKP7R register  ****************/
#define TAMP_BKP7R_BKP_Pos                 (0U)
#define TAMP_BKP7R_BKP_Msk                 (0xFFFFFFFFUL << TAMP_BKP7R_BKP_Pos)    /*!< 0xFFFFFFFF */
#define TAMP_BKP7R_BKP                     TAMP_BKP7R_BKP_Msk                      /*!< The application can write or read data to and from these registers. */

