MaJerle/stm32-usart-uart-dma-rx-tx/drivers/CMSIS/Device/ST/STM32C5xx/Include/stm32c593xx.h
/* ************************************  Bit definition for XSPI_DCR1 register  ************************************* */
#define XSPI_DCR1_CKMODE_Pos      (0U)
#define XSPI_DCR1_CKMODE_Msk      (0x1UL << XSPI_DCR1_CKMODE_Pos)        /*!< 0x00000001 */
#define XSPI_DCR1_CKMODE          XSPI_DCR1_CKMODE_Msk                   /*!< Clock mode 0 */
#define XSPI_DCR1_FRCK_Pos        (1U)
#define XSPI_DCR1_FRCK_Msk        (0x1UL << XSPI_DCR1_FRCK_Pos)          /*!< 0x00000002 */
#define XSPI_DCR1_FRCK            XSPI_DCR1_FRCK_Msk                     /*!< Free running clock */
#define XSPI_DCR1_DLYBYP_Pos      (3U)
#define XSPI_DCR1_DLYBYP_Msk      (0x1UL << XSPI_DCR1_DLYBYP_Pos)        /*!< 0x00000008 */
#define XSPI_DCR1_DLYBYP          XSPI_DCR1_DLYBYP_Msk                   /*!< Delay block bypass */
#define XSPI_DCR1_CSHT_Pos        (8U)
#define XSPI_DCR1_CSHT_Msk        (0x3FUL << XSPI_DCR1_CSHT_Pos)         /*!< 0x00003F00 */
#define XSPI_DCR1_CSHT            XSPI_DCR1_CSHT_Msk                     /*!< Chip-select high time */
#define XSPI_DCR1_DEVSIZE_Pos     (16U)
#define XSPI_DCR1_DEVSIZE_Msk     (0x1FUL << XSPI_DCR1_DEVSIZE_Pos)      /*!< 0x001F0000 */
#define XSPI_DCR1_DEVSIZE         XSPI_DCR1_DEVSIZE_Msk                  /*!< Device size */
#define XSPI_DCR1_EXTENDMEM_Pos   (21U)
#define XSPI_DCR1_EXTENDMEM_Msk   (0x1UL << XSPI_DCR1_EXTENDMEM_Pos)     /*!< 0x00200000 */
#define XSPI_DCR1_EXTENDMEM       XSPI_DCR1_EXTENDMEM_Msk                /*!< Extended memory support */
#define XSPI_DCR1_MTYP_Pos        (24U)
#define XSPI_DCR1_MTYP_Msk        (0x7UL << XSPI_DCR1_MTYP_Pos)          /*!< 0x07000000 */
#define XSPI_DCR1_MTYP            XSPI_DCR1_MTYP_Msk                     /*!< Memory type */
#define XSPI_DCR1_MTYP_0          (0x1UL << XSPI_DCR1_MTYP_Pos)          /*!< 0x01000000 */
#define XSPI_DCR1_MTYP_1          (0x2UL << XSPI_DCR1_MTYP_Pos)          /*!< 0x02000000 */
#define XSPI_DCR1_MTYP_2          (0x4UL << XSPI_DCR1_MTYP_Pos)          /*!< 0x04000000 */

/* ************************************  Bit definition for XSPI_DCR2 register  ************************************* */
#define XSPI_DCR2_PRESCALER_Pos   (0U)
#define XSPI_DCR2_PRESCALER_Msk   (0xFFUL << XSPI_DCR2_PRESCALER_Pos)    /*!< 0x000000FF */
#define XSPI_DCR2_PRESCALER       XSPI_DCR2_PRESCALER_Msk                /*!< Clock prescaler */
#define XSPI_DCR2_WRAPSIZE_Pos    (16U)
#define XSPI_DCR2_WRAPSIZE_Msk    (0x7UL << XSPI_DCR2_WRAPSIZE_Pos)      /*!< 0x00070000 */
#define XSPI_DCR2_WRAPSIZE        XSPI_DCR2_WRAPSIZE_Msk                 /*!< Wrap size */
#define XSPI_DCR2_WRAPSIZE_0      (0x1UL << XSPI_DCR2_WRAPSIZE_Pos)      /*!< 0x00010000 */
#define XSPI_DCR2_WRAPSIZE_1      (0x2UL << XSPI_DCR2_WRAPSIZE_Pos)      /*!< 0x00020000 */
#define XSPI_DCR2_WRAPSIZE_2      (0x4UL << XSPI_DCR2_WRAPSIZE_Pos)      /*!< 0x00040000 */

/* ************************************  Bit definition for XSPI_DCR3 register  ************************************* */
#define XSPI_DCR3_CSBOUND_Pos     (16U)
#define XSPI_DCR3_CSBOUND_Msk     (0x1FUL << XSPI_DCR3_CSBOUND_Pos)      /*!< 0x001F0000 */
#define XSPI_DCR3_CSBOUND         XSPI_DCR3_CSBOUND_Msk                  /*!< NCS boundary */

/* ************************************  Bit definition for XSPI_DCR4 register  ************************************* */
#define XSPI_DCR4_REFRESH_Pos     (0U)
#define XSPI_DCR4_REFRESH_Msk     (0xFFFFFFFFUL << XSPI_DCR4_REFRESH_Pos) /*!< 0xFFFFFFFF */
#define XSPI_DCR4_REFRESH         XSPI_DCR4_REFRESH_Msk                   /*!< Refresh rate */

/* *************************************  Bit definition for XSPI_SR register  ************************************** */
#define XSPI_SR_TEF_Pos           (0U)
#define XSPI_SR_TEF_Msk           (0x1UL << XSPI_SR_TEF_Pos)             /*!< 0x00000001 */
#define XSPI_SR_TEF               XSPI_SR_TEF_Msk                        /*!< Transfer error flag */
#define XSPI_SR_TCF_Pos           (1U)
#define XSPI_SR_TCF_Msk           (0x1UL << XSPI_SR_TCF_Pos)             /*!< 0x00000002 */
#define XSPI_SR_TCF               XSPI_SR_TCF_Msk                        /*!< Transfer complete flag */
#define XSPI_SR_FTF_Pos           (2U)
#define XSPI_SR_FTF_Msk           (0x1UL << XSPI_SR_FTF_Pos)             /*!< 0x00000004 */
#define XSPI_SR_FTF               XSPI_SR_FTF_Msk                        /*!< FIFO threshold flag */
#define XSPI_SR_SMF_Pos           (3U)
#define XSPI_SR_SMF_Msk           (0x1UL << XSPI_SR_SMF_Pos)             /*!< 0x00000008 */
#define XSPI_SR_SMF               XSPI_SR_SMF_Msk                        /*!< Status match flag */
#define XSPI_SR_TOF_Pos           (4U)
#define XSPI_SR_TOF_Msk           (0x1UL << XSPI_SR_TOF_Pos)             /*!< 0x00000010 */
#define XSPI_SR_TOF               XSPI_SR_TOF_Msk                        /*!< Timeout flag */
#define XSPI_SR_BUSY_Pos          (5U)
#define XSPI_SR_BUSY_Msk          (0x1UL << XSPI_SR_BUSY_Pos)            /*!< 0x00000020 */
#define XSPI_SR_BUSY              XSPI_SR_BUSY_Msk                       /*!< Busy */
#define XSPI_SR_FLEVEL_Pos        (8U)
#define XSPI_SR_FLEVEL_Msk        (0x3FUL << XSPI_SR_FLEVEL_Pos)         /*!< 0x00003F00 */
#define XSPI_SR_FLEVEL            XSPI_SR_FLEVEL_Msk                     /*!< FIFO level */

/* *************************************  Bit definition for XSPI_FCR register  ************************************* */
#define XSPI_FCR_CTEF_Pos         (0U)
#define XSPI_FCR_CTEF_Msk         (0x1UL << XSPI_FCR_CTEF_Pos)           /*!< 0x00000001 */
#define XSPI_FCR_CTEF             XSPI_FCR_CTEF_Msk                      /*!< Clear transfer error flag */
#define XSPI_FCR_CTCF_Pos         (1U)
#define XSPI_FCR_CTCF_Msk         (0x1UL << XSPI_FCR_CTCF_Pos)           /*!< 0x00000002 */
#define XSPI_FCR_CTCF             XSPI_FCR_CTCF_Msk                      /*!< Clear transfer complete flag */
#define XSPI_FCR_CSMF_Pos         (3U)
#define XSPI_FCR_CSMF_Msk         (0x1UL << XSPI_FCR_CSMF_Pos)           /*!< 0x00000008 */
#define XSPI_FCR_CSMF             XSPI_FCR_CSMF_Msk                      /*!< Clear status match flag */
#define XSPI_FCR_CTOF_Pos         (4U)
#define XSPI_FCR_CTOF_Msk         (0x1UL << XSPI_FCR_CTOF_Pos)           /*!< 0x00000010 */
#define XSPI_FCR_CTOF             XSPI_FCR_CTOF_Msk                      /*!< Clear timeout flag */

/* *************************************  Bit definition for XSPI_DLR register  ************************************* */
#define XSPI_DLR_DL_Pos           (0U)
#define XSPI_DLR_DL_Msk           (0xFFFFFFFFUL << XSPI_DLR_DL_Pos)      /*!< 0xFFFFFFFF */
#define XSPI_DLR_DL               XSPI_DLR_DL_Msk                        /*!< Data length */

