MaJerle/stm32-usart-uart-dma-rx-tx/drivers/CMSIS/Device/ST/STM32C5xx/Include/stm32c593xx.h
/* *************************************  Bit definition for XSPI_IR register  ************************************** */
#define XSPI_IR_INSTRUCTION_Pos   (0U)
#define XSPI_IR_INSTRUCTION_Msk   (0xFFFFFFFFUL << XSPI_IR_INSTRUCTION_Pos)  /*!< 0xFFFFFFFF */
#define XSPI_IR_INSTRUCTION       XSPI_IR_INSTRUCTION_Msk                    /*!< Instruction */

/* *************************************  Bit definition for XSPI_ABR register  ************************************* */
#define XSPI_ABR_ALTERNATE_Pos    (0U)
#define XSPI_ABR_ALTERNATE_Msk    (0xFFFFFFFFUL << XSPI_ABR_ALTERNATE_Pos)   /*!< 0xFFFFFFFF */
#define XSPI_ABR_ALTERNATE        XSPI_ABR_ALTERNATE_Msk                     /*!< Alternate bytes */

/* ************************************  Bit definition for XSPI_LPTR register  ************************************* */
#define XSPI_LPTR_TIMEOUT_Pos     (0U)
#define XSPI_LPTR_TIMEOUT_Msk     (0xFFFFUL << XSPI_LPTR_TIMEOUT_Pos)    /*!< 0x0000FFFF */
#define XSPI_LPTR_TIMEOUT         XSPI_LPTR_TIMEOUT_Msk                  /*!< Timeout period */

/* ************************************  Bit definition for XSPI_WPCCR register  ************************************ */
#define XSPI_WPCCR_IMODE_Pos      (0U)
#define XSPI_WPCCR_IMODE_Msk      (0x7UL << XSPI_WPCCR_IMODE_Pos)        /*!< 0x00000007 */
#define XSPI_WPCCR_IMODE          XSPI_WPCCR_IMODE_Msk                   /*!< Instruction mode */
#define XSPI_WPCCR_IMODE_0        (0x1UL << XSPI_WPCCR_IMODE_Pos)        /*!< 0x00000001 */
#define XSPI_WPCCR_IMODE_1        (0x2UL << XSPI_WPCCR_IMODE_Pos)        /*!< 0x00000002 */
#define XSPI_WPCCR_IMODE_2        (0x4UL << XSPI_WPCCR_IMODE_Pos)        /*!< 0x00000004 */
#define XSPI_WPCCR_IDTR_Pos       (3U)
#define XSPI_WPCCR_IDTR_Msk       (0x1UL << XSPI_WPCCR_IDTR_Pos)         /*!< 0x00000008 */
#define XSPI_WPCCR_IDTR           XSPI_WPCCR_IDTR_Msk                    /*!< Instruction double transfer rate */
#define XSPI_WPCCR_ISIZE_Pos      (4U)
#define XSPI_WPCCR_ISIZE_Msk      (0x3UL << XSPI_WPCCR_ISIZE_Pos)        /*!< 0x00000030 */
#define XSPI_WPCCR_ISIZE          XSPI_WPCCR_ISIZE_Msk                   /*!< Instruction size */
#define XSPI_WPCCR_ISIZE_0        (0x1UL << XSPI_WPCCR_ISIZE_Pos)        /*!< 0x00000010 */
#define XSPI_WPCCR_ISIZE_1        (0x2UL << XSPI_WPCCR_ISIZE_Pos)        /*!< 0x00000020 */
#define XSPI_WPCCR_ADMODE_Pos     (8U)
#define XSPI_WPCCR_ADMODE_Msk     (0x7UL << XSPI_WPCCR_ADMODE_Pos)       /*!< 0x00000700 */
#define XSPI_WPCCR_ADMODE         XSPI_WPCCR_ADMODE_Msk                  /*!< Address mode */
#define XSPI_WPCCR_ADMODE_0       (0x1UL << XSPI_WPCCR_ADMODE_Pos)       /*!< 0x00000100 */
#define XSPI_WPCCR_ADMODE_1       (0x2UL << XSPI_WPCCR_ADMODE_Pos)       /*!< 0x00000200 */
#define XSPI_WPCCR_ADMODE_2       (0x4UL << XSPI_WPCCR_ADMODE_Pos)       /*!< 0x00000400 */
#define XSPI_WPCCR_ADDTR_Pos      (11U)
#define XSPI_WPCCR_ADDTR_Msk      (0x1UL << XSPI_WPCCR_ADDTR_Pos)        /*!< 0x00000800 */
#define XSPI_WPCCR_ADDTR          XSPI_WPCCR_ADDTR_Msk                   /*!< Address double transfer rate */
#define XSPI_WPCCR_ADSIZE_Pos     (12U)
#define XSPI_WPCCR_ADSIZE_Msk     (0x3UL << XSPI_WPCCR_ADSIZE_Pos)       /*!< 0x00003000 */
#define XSPI_WPCCR_ADSIZE         XSPI_WPCCR_ADSIZE_Msk                  /*!< Address size */
#define XSPI_WPCCR_ADSIZE_0       (0x1UL << XSPI_WPCCR_ADSIZE_Pos)       /*!< 0x00001000 */
#define XSPI_WPCCR_ADSIZE_1       (0x2UL << XSPI_WPCCR_ADSIZE_Pos)       /*!< 0x00002000 */
#define XSPI_WPCCR_ABMODE_Pos     (16U)
#define XSPI_WPCCR_ABMODE_Msk     (0x7UL << XSPI_WPCCR_ABMODE_Pos)       /*!< 0x00070000 */
#define XSPI_WPCCR_ABMODE         XSPI_WPCCR_ABMODE_Msk                  /*!< Alternate-byte mode */
#define XSPI_WPCCR_ABMODE_0       (0x1UL << XSPI_WPCCR_ABMODE_Pos)       /*!< 0x00010000 */
#define XSPI_WPCCR_ABMODE_1       (0x2UL << XSPI_WPCCR_ABMODE_Pos)       /*!< 0x00020000 */
#define XSPI_WPCCR_ABMODE_2       (0x4UL << XSPI_WPCCR_ABMODE_Pos)       /*!< 0x00040000 */
#define XSPI_WPCCR_ABDTR_Pos      (19U)
#define XSPI_WPCCR_ABDTR_Msk      (0x1UL << XSPI_WPCCR_ABDTR_Pos)        /*!< 0x00080000 */
#define XSPI_WPCCR_ABDTR          XSPI_WPCCR_ABDTR_Msk                   /*!< Alternate-byte double transfer rate */
#define XSPI_WPCCR_ABSIZE_Pos     (20U)
#define XSPI_WPCCR_ABSIZE_Msk     (0x3UL << XSPI_WPCCR_ABSIZE_Pos)       /*!< 0x00300000 */
#define XSPI_WPCCR_ABSIZE         XSPI_WPCCR_ABSIZE_Msk                  /*!< Alternate-byte size */
#define XSPI_WPCCR_ABSIZE_0       (0x1UL << XSPI_WPCCR_ABSIZE_Pos)       /*!< 0x00100000 */
#define XSPI_WPCCR_ABSIZE_1       (0x2UL << XSPI_WPCCR_ABSIZE_Pos)       /*!< 0x00200000 */
#define XSPI_WPCCR_DMODE_Pos      (24U)
#define XSPI_WPCCR_DMODE_Msk      (0x7UL << XSPI_WPCCR_DMODE_Pos)        /*!< 0x07000000 */
#define XSPI_WPCCR_DMODE          XSPI_WPCCR_DMODE_Msk                   /*!< Data mode */
#define XSPI_WPCCR_DMODE_0        (0x1UL << XSPI_WPCCR_DMODE_Pos)        /*!< 0x01000000 */
#define XSPI_WPCCR_DMODE_1        (0x2UL << XSPI_WPCCR_DMODE_Pos)        /*!< 0x02000000 */
#define XSPI_WPCCR_DMODE_2        (0x4UL << XSPI_WPCCR_DMODE_Pos)        /*!< 0x04000000 */
#define XSPI_WPCCR_DDTR_Pos       (27U)
#define XSPI_WPCCR_DDTR_Msk       (0x1UL << XSPI_WPCCR_DDTR_Pos)         /*!< 0x08000000 */
#define XSPI_WPCCR_DDTR           XSPI_WPCCR_DDTR_Msk                    /*!< Data double transfer rate */
#define XSPI_WPCCR_DQSE_Pos       (29U)
#define XSPI_WPCCR_DQSE_Msk       (0x1UL << XSPI_WPCCR_DQSE_Pos)         /*!< 0x20000000 */
#define XSPI_WPCCR_DQSE           XSPI_WPCCR_DQSE_Msk                    /*!< DQS enable */

/* ************************************  Bit definition for XSPI_WPTCR register  ************************************ */
#define XSPI_WPTCR_DCYC_Pos       (0U)
#define XSPI_WPTCR_DCYC_Msk       (0x1FUL << XSPI_WPTCR_DCYC_Pos)        /*!< 0x0000001F */
#define XSPI_WPTCR_DCYC           XSPI_WPTCR_DCYC_Msk                    /*!< Number of dummy cycles */
#define XSPI_WPTCR_DHQC_Pos       (28U)
#define XSPI_WPTCR_DHQC_Msk       (0x1UL << XSPI_WPTCR_DHQC_Pos)         /*!< 0x10000000 */
#define XSPI_WPTCR_DHQC           XSPI_WPTCR_DHQC_Msk                    /*!< Delay hold quarter cycle */
#define XSPI_WPTCR_SSHIFT_Pos     (30U)
#define XSPI_WPTCR_SSHIFT_Msk     (0x1UL << XSPI_WPTCR_SSHIFT_Pos)       /*!< 0x40000000 */
#define XSPI_WPTCR_SSHIFT         XSPI_WPTCR_SSHIFT_Msk                  /*!< Sample shift */

/* ************************************  Bit definition for XSPI_WPIR register  ************************************* */
#define XSPI_WPIR_INSTRUCTION_Pos (0U)
#define XSPI_WPIR_INSTRUCTION_Msk (0xFFFFFFFFUL << XSPI_WPIR_INSTRUCTION_Pos)  /*!< 0xFFFFFFFF */
#define XSPI_WPIR_INSTRUCTION     XSPI_WPIR_INSTRUCTION_Msk                    /*!< Instruction */

/* ************************************  Bit definition for XSPI_WPABR register  ************************************ */
#define XSPI_WPABR_ALTERNATE_Pos  (0U)
#define XSPI_WPABR_ALTERNATE_Msk  (0xFFFFFFFFUL << XSPI_WPABR_ALTERNATE_Pos)   /*!< 0xFFFFFFFF */
#define XSPI_WPABR_ALTERNATE      XSPI_WPABR_ALTERNATE_Msk                     /*!< Alternate bytes */

/* ************************************  Bit definition for XSPI_WCCR register  ************************************* */
#define XSPI_WCCR_IMODE_Pos       (0U)
#define XSPI_WCCR_IMODE_Msk       (0x7UL << XSPI_WCCR_IMODE_Pos)         /*!< 0x00000007 */
#define XSPI_WCCR_IMODE           XSPI_WCCR_IMODE_Msk                    /*!< Instruction mode */
#define XSPI_WCCR_IMODE_0         (0x1UL << XSPI_WCCR_IMODE_Pos)         /*!< 0x00000001 */
#define XSPI_WCCR_IMODE_1         (0x2UL << XSPI_WCCR_IMODE_Pos)         /*!< 0x00000002 */
#define XSPI_WCCR_IMODE_2         (0x4UL << XSPI_WCCR_IMODE_Pos)         /*!< 0x00000004 */
#define XSPI_WCCR_IDTR_Pos        (3U)
#define XSPI_WCCR_IDTR_Msk        (0x1UL << XSPI_WCCR_IDTR_Pos)          /*!< 0x00000008 */
#define XSPI_WCCR_IDTR            XSPI_WCCR_IDTR_Msk                     /*!< Instruction double transfer rate */
#define XSPI_WCCR_ISIZE_Pos       (4U)
#define XSPI_WCCR_ISIZE_Msk       (0x3UL << XSPI_WCCR_ISIZE_Pos)         /*!< 0x00000030 */
#define XSPI_WCCR_ISIZE           XSPI_WCCR_ISIZE_Msk                    /*!< Instruction size */
#define XSPI_WCCR_ISIZE_0         (0x1UL << XSPI_WCCR_ISIZE_Pos)         /*!< 0x00000010 */
#define XSPI_WCCR_ISIZE_1         (0x2UL << XSPI_WCCR_ISIZE_Pos)         /*!< 0x00000020 */
#define XSPI_WCCR_ADMODE_Pos      (8U)
#define XSPI_WCCR_ADMODE_Msk      (0x7UL << XSPI_WCCR_ADMODE_Pos)        /*!< 0x00000700 */
#define XSPI_WCCR_ADMODE          XSPI_WCCR_ADMODE_Msk                   /*!< Address mode */
#define XSPI_WCCR_ADMODE_0        (0x1UL << XSPI_WCCR_ADMODE_Pos)        /*!< 0x00000100 */
#define XSPI_WCCR_ADMODE_1        (0x2UL << XSPI_WCCR_ADMODE_Pos)        /*!< 0x00000200 */
#define XSPI_WCCR_ADMODE_2        (0x4UL << XSPI_WCCR_ADMODE_Pos)        /*!< 0x00000400 */
#define XSPI_WCCR_ADDTR_Pos       (11U)
#define XSPI_WCCR_ADDTR_Msk       (0x1UL << XSPI_WCCR_ADDTR_Pos)         /*!< 0x00000800 */
#define XSPI_WCCR_ADDTR           XSPI_WCCR_ADDTR_Msk                    /*!< Address double transfer rate */
#define XSPI_WCCR_ADSIZE_Pos      (12U)
#define XSPI_WCCR_ADSIZE_Msk      (0x3UL << XSPI_WCCR_ADSIZE_Pos)        /*!< 0x00003000 */
#define XSPI_WCCR_ADSIZE          XSPI_WCCR_ADSIZE_Msk                   /*!< Address size */
#define XSPI_WCCR_ADSIZE_0        (0x1UL << XSPI_WCCR_ADSIZE_Pos)        /*!< 0x00001000 */
#define XSPI_WCCR_ADSIZE_1        (0x2UL << XSPI_WCCR_ADSIZE_Pos)        /*!< 0x00002000 */
#define XSPI_WCCR_ABMODE_Pos      (16U)
#define XSPI_WCCR_ABMODE_Msk      (0x7UL << XSPI_WCCR_ABMODE_Pos)        /*!< 0x00070000 */
#define XSPI_WCCR_ABMODE          XSPI_WCCR_ABMODE_Msk                   /*!< Alternate-byte mode */
#define XSPI_WCCR_ABMODE_0        (0x1UL << XSPI_WCCR_ABMODE_Pos)        /*!< 0x00010000 */
#define XSPI_WCCR_ABMODE_1        (0x2UL << XSPI_WCCR_ABMODE_Pos)        /*!< 0x00020000 */
#define XSPI_WCCR_ABMODE_2        (0x4UL << XSPI_WCCR_ABMODE_Pos)        /*!< 0x00040000 */
#define XSPI_WCCR_ABDTR_Pos       (19U)
#define XSPI_WCCR_ABDTR_Msk       (0x1UL << XSPI_WCCR_ABDTR_Pos)         /*!< 0x00080000 */
#define XSPI_WCCR_ABDTR           XSPI_WCCR_ABDTR_Msk                    /*!< Alternate bytes double transfer rate */
#define XSPI_WCCR_ABSIZE_Pos      (20U)
#define XSPI_WCCR_ABSIZE_Msk      (0x3UL << XSPI_WCCR_ABSIZE_Pos)        /*!< 0x00300000 */
#define XSPI_WCCR_ABSIZE          XSPI_WCCR_ABSIZE_Msk                   /*!< Alternate-byte size */
#define XSPI_WCCR_ABSIZE_0        (0x1UL << XSPI_WCCR_ABSIZE_Pos)        /*!< 0x00100000 */
#define XSPI_WCCR_ABSIZE_1        (0x2UL << XSPI_WCCR_ABSIZE_Pos)        /*!< 0x00200000 */
#define XSPI_WCCR_DMODE_Pos       (24U)
#define XSPI_WCCR_DMODE_Msk       (0x7UL << XSPI_WCCR_DMODE_Pos)         /*!< 0x07000000 */
#define XSPI_WCCR_DMODE           XSPI_WCCR_DMODE_Msk                    /*!< Data mode */
#define XSPI_WCCR_DMODE_0         (0x1UL << XSPI_WCCR_DMODE_Pos)         /*!< 0x01000000 */
#define XSPI_WCCR_DMODE_1         (0x2UL << XSPI_WCCR_DMODE_Pos)         /*!< 0x02000000 */
#define XSPI_WCCR_DMODE_2         (0x4UL << XSPI_WCCR_DMODE_Pos)         /*!< 0x04000000 */
#define XSPI_WCCR_DDTR_Pos        (27U)
#define XSPI_WCCR_DDTR_Msk        (0x1UL << XSPI_WCCR_DDTR_Pos)          /*!< 0x08000000 */
#define XSPI_WCCR_DDTR            XSPI_WCCR_DDTR_Msk                     /*!< data double transfer rate */
#define XSPI_WCCR_DQSE_Pos        (29U)
#define XSPI_WCCR_DQSE_Msk        (0x1UL << XSPI_WCCR_DQSE_Pos)          /*!< 0x20000000 */
#define XSPI_WCCR_DQSE            XSPI_WCCR_DQSE_Msk                     /*!< DQS enable */

/* ************************************  Bit definition for XSPI_WTCR register  ************************************* */
#define XSPI_WTCR_DCYC_Pos        (0U)
#define XSPI_WTCR_DCYC_Msk        (0x1FUL << XSPI_WTCR_DCYC_Pos)               /*!< 0x0000001F */
#define XSPI_WTCR_DCYC            XSPI_WTCR_DCYC_Msk                           /*!< Number of dummy cycles */

